{
  "ir_version": "9",
  "graph": {
    "node": [
      {
        "output": [
          "reshape_shape_Gemm_MM_0"
        ],
        "op_type": "Constant",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "2"
              ],
              "data_type": 7,
              "int64_data": [
                "1",
                "128"
              ],
              "name": "reshape_shape_Gemm_MM_0"
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "trip_count_Gemm_MM_0"
        ],
        "op_type": "Constant",
        "attribute": [
          {
            "name": "value",
            "t": {
              "data_type": 7,
              "int64_data": [
                "81920"
              ],
              "name": "trip_count_Gemm_MM_0"
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "cond_Gemm_MM_0"
        ],
        "op_type": "Constant",
        "attribute": [
          {
            "name": "value",
            "t": {
              "data_type": 9,
              "int32_data": [
                1
              ],
              "name": "cond_Gemm_MM_0"
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "trip_count_Gemm_MM_0",
          "cond_Gemm_MM_0",
          "init_carry"
        ],
        "output": [
          "loop_out"
        ],
        "op_type": "Loop",
        "attribute": [
          {
            "name": "body",
            "g": {
              "node": [
                {
                  "output": [
                    "axes"
                  ],
                  "op_type": "Constant",
                  "attribute": [
                    {
                      "name": "value",
                      "t": {
                        "dims": [
                          "1"
                        ],
                        "data_type": 7,
                        "int64_data": [
                          "0"
                        ],
                        "name": "axes"
                      },
                      "type": "TENSOR"
                    }
                  ]
                },
                {
                  "output": [
                    "M_Gemm_MM_0"
                  ],
                  "op_type": "Constant",
                  "attribute": [
                    {
                      "name": "value",
                      "t": {
                        "data_type": 7,
                        "int64_data": [
                          "1"
                        ],
                        "name": "M_Gemm_MM_0"
                      },
                      "type": "TENSOR"
                    }
                  ]
                },
                {
                  "output": [
                    "K_Gemm_MM_0"
                  ],
                  "op_type": "Constant",
                  "attribute": [
                    {
                      "name": "value",
                      "t": {
                        "data_type": 7,
                        "int64_data": [
                          "640"
                        ],
                        "name": "K_Gemm_MM_0"
                      },
                      "type": "TENSOR"
                    }
                  ]
                },
                {
                  "output": [
                    "N_Gemm_MM_0"
                  ],
                  "op_type": "Constant",
                  "attribute": [
                    {
                      "name": "value",
                      "t": {
                        "data_type": 7,
                        "int64_data": [
                          "128"
                        ],
                        "name": "N_Gemm_MM_0"
                      },
                      "type": "TENSOR"
                    }
                  ]
                },
                {
                  "output": [
                    "axes_shape2_A_Gemm_MM_0_d0"
                  ],
                  "op_type": "Constant",
                  "attribute": [
                    {
                      "name": "value",
                      "t": {
                        "dims": [
                          "1"
                        ],
                        "data_type": 7,
                        "int64_data": [
                          "0"
                        ],
                        "name": "axes_shape2_A_Gemm_MM_0_d0"
                      },
                      "type": "TENSOR"
                    }
                  ]
                },
                {
                  "output": [
                    "axes_shape2_A_Gemm_MM_0_d1"
                  ],
                  "op_type": "Constant",
                  "attribute": [
                    {
                      "name": "value",
                      "t": {
                        "dims": [
                          "1"
                        ],
                        "data_type": 7,
                        "int64_data": [
                          "0"
                        ],
                        "name": "axes_shape2_A_Gemm_MM_0_d1"
                      },
                      "type": "TENSOR"
                    }
                  ]
                },
                {
                  "output": [
                    "axes_shape2_B_Gemm_MM_0_d0"
                  ],
                  "op_type": "Constant",
                  "attribute": [
                    {
                      "name": "value",
                      "t": {
                        "dims": [
                          "1"
                        ],
                        "data_type": 7,
                        "int64_data": [
                          "0"
                        ],
                        "name": "axes_shape2_B_Gemm_MM_0_d0"
                      },
                      "type": "TENSOR"
                    }
                  ]
                },
                {
                  "output": [
                    "axes_shape2_B_Gemm_MM_0_d1"
                  ],
                  "op_type": "Constant",
                  "attribute": [
                    {
                      "name": "value",
                      "t": {
                        "dims": [
                          "1"
                        ],
                        "data_type": 7,
                        "int64_data": [
                          "0"
                        ],
                        "name": "axes_shape2_B_Gemm_MM_0_d1"
                      },
                      "type": "TENSOR"
                    }
                  ]
                },
                {
                  "output": [
                    "axes_fixshape_a_vec_Gemm_MM_0"
                  ],
                  "op_type": "Constant",
                  "attribute": [
                    {
                      "name": "value",
                      "t": {
                        "dims": [
                          "1"
                        ],
                        "data_type": 7,
                        "int64_data": [
                          "0"
                        ],
                        "name": "axes_fixshape_a_vec_Gemm_MM_0"
                      },
                      "type": "TENSOR"
                    }
                  ]
                },
                {
                  "output": [
                    "axes_fixshape_b_vec_Gemm_MM_0"
                  ],
                  "op_type": "Constant",
                  "attribute": [
                    {
                      "name": "value",
                      "t": {
                        "dims": [
                          "1"
                        ],
                        "data_type": 7,
                        "int64_data": [
                          "0"
                        ],
                        "name": "axes_fixshape_b_vec_Gemm_MM_0"
                      },
                      "type": "TENSOR"
                    }
                  ]
                },
                {
                  "output": [
                    "one_Gemm_MM_0"
                  ],
                  "op_type": "Constant",
                  "attribute": [
                    {
                      "name": "value",
                      "t": {
                        "data_type": 7,
                        "int64_data": [
                          "1"
                        ],
                        "name": "one_Gemm_MM_0"
                      },
                      "type": "TENSOR"
                    }
                  ]
                },
                {
                  "input": [
                    "K_Gemm_MM_0",
                    "N_Gemm_MM_0"
                  ],
                  "output": [
                    "KN_out_Gemm_MM_0"
                  ],
                  "op_type": "Mul"
                },
                {
                  "input": [
                    "M_Gemm_MM_0",
                    "N_Gemm_MM_0"
                  ],
                  "output": [
                    "MN_out_Gemm_MM_0"
                  ],
                  "op_type": "Mul"
                },
                {
                  "input": [
                    "M_Gemm_MM_0",
                    "KN_out_Gemm_MM_0"
                  ],
                  "output": [
                    "MKN_out_Gemm_MM_0"
                  ],
                  "op_type": "Mul"
                },
                {
                  "input": [
                    "M_Gemm_MM_0",
                    "axes_shape2_A_Gemm_MM_0_d0"
                  ],
                  "output": [
                    "shape2_A_Gemm_MM_0_d0_u_out"
                  ],
                  "op_type": "Unsqueeze"
                },
                {
                  "input": [
                    "K_Gemm_MM_0",
                    "axes_shape2_A_Gemm_MM_0_d1"
                  ],
                  "output": [
                    "shape2_A_Gemm_MM_0_d1_u_out"
                  ],
                  "op_type": "Unsqueeze"
                },
                {
                  "input": [
                    "shape2_A_Gemm_MM_0_d0_u_out",
                    "shape2_A_Gemm_MM_0_d1_u_out"
                  ],
                  "output": [
                    "concat_out_shape2_A_Gemm_MM_0"
                  ],
                  "op_type": "Concat",
                  "attribute": [
                    {
                      "name": "axis",
                      "i": "0",
                      "type": "INT"
                    }
                  ]
                },
                {
                  "input": [
                    "input_1",
                    "concat_out_shape2_A_Gemm_MM_0"
                  ],
                  "output": [
                    "input_1_reshaped_unused"
                  ],
                  "op_type": "Reshape"
                },
                {
                  "input": [
                    "K_Gemm_MM_0",
                    "axes_shape2_B_Gemm_MM_0_d0"
                  ],
                  "output": [
                    "shape2_B_Gemm_MM_0_d0_u_out"
                  ],
                  "op_type": "Unsqueeze"
                },
                {
                  "input": [
                    "N_Gemm_MM_0",
                    "axes_shape2_B_Gemm_MM_0_d1"
                  ],
                  "output": [
                    "shape2_B_Gemm_MM_0_d1_u_out"
                  ],
                  "op_type": "Unsqueeze"
                },
                {
                  "input": [
                    "shape2_B_Gemm_MM_0_d0_u_out",
                    "shape2_B_Gemm_MM_0_d1_u_out"
                  ],
                  "output": [
                    "concat_out_shape2_B_Gemm_MM_0"
                  ],
                  "op_type": "Concat",
                  "attribute": [
                    {
                      "name": "axis",
                      "i": "0",
                      "type": "INT"
                    }
                  ]
                },
                {
                  "input": [
                    "const_fold_opt__59",
                    "concat_out_shape2_B_Gemm_MM_0"
                  ],
                  "output": [
                    "const_fold_opt__59_reshaped_unused"
                  ],
                  "op_type": "Reshape"
                },
                {
                  "input": [
                    "iter",
                    "KN_out_Gemm_MM_0"
                  ],
                  "output": [
                    "Div_i_Gemm_MM_0_out"
                  ],
                  "op_type": "Div"
                },
                {
                  "input": [
                    "iter",
                    "KN_out_Gemm_MM_0"
                  ],
                  "output": [
                    "Mod_rem_Gemm_MM_0_out"
                  ],
                  "op_type": "Mod"
                },
                {
                  "input": [
                    "Mod_rem_Gemm_MM_0_out",
                    "K_Gemm_MM_0"
                  ],
                  "output": [
                    "Div_j_Gemm_MM_0_out"
                  ],
                  "op_type": "Div"
                },
                {
                  "input": [
                    "Mod_rem_Gemm_MM_0_out",
                    "K_Gemm_MM_0"
                  ],
                  "output": [
                    "Mod_k_Gemm_MM_0_out"
                  ],
                  "op_type": "Mod"
                },
                {
                  "input": [
                    "Div_i_Gemm_MM_0_out",
                    "axes"
                  ],
                  "output": [
                    "iU_Gemm_MM_0_out"
                  ],
                  "op_type": "Unsqueeze"
                },
                {
                  "input": [
                    "Div_j_Gemm_MM_0_out",
                    "axes"
                  ],
                  "output": [
                    "jU_Gemm_MM_0_out"
                  ],
                  "op_type": "Unsqueeze"
                },
                {
                  "input": [
                    "Mod_k_Gemm_MM_0_out",
                    "axes"
                  ],
                  "output": [
                    "kU_Gemm_MM_0_out"
                  ],
                  "op_type": "Unsqueeze"
                },
                {
                  "input": [
                    "Div_i_Gemm_MM_0_out",
                    "N_Gemm_MM_0"
                  ],
                  "output": [
                    "iMulN_out_Gemm_MM_0"
                  ],
                  "op_type": "Mul"
                },
                {
                  "input": [
                    "iMulN_out_Gemm_MM_0",
                    "Div_j_Gemm_MM_0_out"
                  ],
                  "output": [
                    "flat_no_batch_out_Gemm_MM_0"
                  ],
                  "op_type": "Add"
                },
                {
                  "input": [
                    "flat_no_batch_out_Gemm_MM_0",
                    "axes"
                  ],
                  "output": [
                    "flatU_Gemm_MM_0_out"
                  ],
                  "op_type": "Unsqueeze"
                },
                {
                  "input": [
                    "input_1",
                    "iU_Gemm_MM_0_out"
                  ],
                  "output": [
                    "a_row_Gemm_MM_0"
                  ],
                  "op_type": "Gather",
                  "attribute": [
                    {
                      "name": "axis",
                      "i": "0",
                      "type": "INT"
                    }
                  ]
                },
                {
                  "input": [
                    "K_Gemm_MM_0",
                    "axes_fixshape_a_vec_Gemm_MM_0"
                  ],
                  "output": [
                    "fixshape_a_vec_Gemm_MM_0_u_out"
                  ],
                  "op_type": "Unsqueeze"
                },
                {
                  "input": [
                    "a_row_Gemm_MM_0",
                    "fixshape_a_vec_Gemm_MM_0_u_out"
                  ],
                  "output": [
                    "a_vec_out_Gemm_MM_0"
                  ],
                  "op_type": "Reshape"
                },
                {
                  "input": [
                    "a_vec_out_Gemm_MM_0",
                    "kU_Gemm_MM_0_out"
                  ],
                  "output": [
                    "a_scalar_Gemm_MM_0"
                  ],
                  "op_type": "Gather",
                  "attribute": [
                    {
                      "name": "axis",
                      "i": "0",
                      "type": "INT"
                    }
                  ]
                },
                {
                  "input": [
                    "a_scalar_Gemm_MM_0",
                    "axes"
                  ],
                  "output": [
                    "sq_a_sq_Gemm_MM_0_out"
                  ],
                  "op_type": "Squeeze"
                },
                {
                  "input": [
                    "const_fold_opt__59",
                    "jU_Gemm_MM_0_out"
                  ],
                  "output": [
                    "b_col_Gemm_MM_0"
                  ],
                  "op_type": "Gather",
                  "attribute": [
                    {
                      "name": "axis",
                      "i": "1",
                      "type": "INT"
                    }
                  ]
                },
                {
                  "input": [
                    "K_Gemm_MM_0",
                    "axes_fixshape_b_vec_Gemm_MM_0"
                  ],
                  "output": [
                    "fixshape_b_vec_Gemm_MM_0_u_out"
                  ],
                  "op_type": "Unsqueeze"
                },
                {
                  "input": [
                    "b_col_Gemm_MM_0",
                    "fixshape_b_vec_Gemm_MM_0_u_out"
                  ],
                  "output": [
                    "b_vec_out_Gemm_MM_0"
                  ],
                  "op_type": "Reshape"
                },
                {
                  "input": [
                    "b_vec_out_Gemm_MM_0",
                    "kU_Gemm_MM_0_out"
                  ],
                  "output": [
                    "b_scalar_Gemm_MM_0"
                  ],
                  "op_type": "Gather",
                  "attribute": [
                    {
                      "name": "axis",
                      "i": "0",
                      "type": "INT"
                    }
                  ]
                },
                {
                  "input": [
                    "b_scalar_Gemm_MM_0",
                    "axes"
                  ],
                  "output": [
                    "sq_b_sq_Gemm_MM_0_out"
                  ],
                  "op_type": "Squeeze"
                },
                {
                  "input": [
                    "sq_a_sq_Gemm_MM_0_out",
                    "sq_b_sq_Gemm_MM_0_out"
                  ],
                  "output": [
                    "prod_Gemm_MM_0"
                  ],
                  "op_type": "Mul"
                },
                {
                  "input": [
                    "carry",
                    "flatU_Gemm_MM_0_out"
                  ],
                  "output": [
                    "prev_out_Gemm_MM_0"
                  ],
                  "op_type": "GatherElements",
                  "attribute": [
                    {
                      "name": "axis",
                      "i": "0",
                      "type": "INT"
                    }
                  ]
                },
                {
                  "input": [
                    "prev_out_Gemm_MM_0",
                    "axes"
                  ],
                  "output": [
                    "sq_prev_sq_Gemm_MM_0_out"
                  ],
                  "op_type": "Squeeze"
                },
                {
                  "input": [
                    "sq_prev_sq_Gemm_MM_0_out",
                    "prod_Gemm_MM_0"
                  ],
                  "output": [
                    "acc_out_Gemm_MM_0"
                  ],
                  "op_type": "Add"
                },
                {
                  "input": [
                    "K_Gemm_MM_0",
                    "one_Gemm_MM_0"
                  ],
                  "output": [
                    "Km1_out_Gemm_MM_0"
                  ],
                  "op_type": "Sub"
                },
                {
                  "input": [
                    "functional_1/dense/BiasAdd/ReadVariableOp/resource",
                    "jU_Gemm_MM_0_out"
                  ],
                  "output": [
                    "gather_functional_1/dense/BiasAdd/ReadVariableOp/resource_Gemm_Add_0_out"
                  ],
                  "op_type": "Gather",
                  "attribute": [
                    {
                      "name": "axis",
                      "i": "0",
                      "type": "INT"
                    }
                  ]
                },
                {
                  "input": [
                    "gather_functional_1/dense/BiasAdd/ReadVariableOp/resource_Gemm_Add_0_out",
                    "axes"
                  ],
                  "output": [
                    "sq_Gemm_Add_0_in1_scalar_out"
                  ],
                  "op_type": "Squeeze"
                },
                {
                  "input": [
                    "acc_out_Gemm_MM_0",
                    "sq_Gemm_Add_0_in1_scalar_out"
                  ],
                  "output": [
                    "Gemm_Add_0_out"
                  ],
                  "op_type": "Add"
                },
                {
                  "input": [
                    "Mod_k_Gemm_MM_0_out",
                    "Km1_out_Gemm_MM_0"
                  ],
                  "output": [
                    "eq_k_last_Gemm_Add_0_out"
                  ],
                  "op_type": "Equal"
                },
                {
                  "input": [
                    "eq_k_last_Gemm_Add_0_out",
                    "Gemm_Add_0_out",
                    "acc_out_Gemm_MM_0"
                  ],
                  "output": [
                    "gated_Gemm_Add_0"
                  ],
                  "op_type": "Where"
                },
                {
                  "input": [
                    "gated_Gemm_Add_0"
                  ],
                  "output": [
                    "1_out"
                  ],
                  "op_type": "Relu"
                },
                {
                  "input": [
                    "Mod_k_Gemm_MM_0_out",
                    "Km1_out_Gemm_MM_0"
                  ],
                  "output": [
                    "eq_k_last_1_out"
                  ],
                  "op_type": "Equal"
                },
                {
                  "input": [
                    "eq_k_last_1_out",
                    "1_out",
                    "acc_out_Gemm_MM_0"
                  ],
                  "output": [
                    "gated_1"
                  ],
                  "op_type": "Where"
                },
                {
                  "input": [
                    "gated_1",
                    "axes"
                  ],
                  "output": [
                    "updateUnsq_out"
                  ],
                  "op_type": "Unsqueeze"
                },
                {
                  "input": [
                    "cond_in"
                  ],
                  "output": [
                    "cond_out"
                  ],
                  "op_type": "Identity"
                },
                {
                  "input": [
                    "carry",
                    "flatU_Gemm_MM_0_out",
                    "updateUnsq_out"
                  ],
                  "output": [
                    "carry_out"
                  ],
                  "op_type": "ScatterElements",
                  "attribute": [
                    {
                      "name": "axis",
                      "i": "0",
                      "type": "INT"
                    }
                  ]
                }
              ],
              "name": "loop_body_0",
              "input": [
                {
                  "name": "iter",
                  "type": {
                    "tensor_type": {
                      "elem_type": 7,
                      "shape": {}
                    }
                  }
                },
                {
                  "name": "cond_in",
                  "type": {
                    "tensor_type": {
                      "elem_type": 9,
                      "shape": {}
                    }
                  }
                },
                {
                  "name": "carry",
                  "type": {
                    "tensor_type": {
                      "elem_type": 1,
                      "shape": {
                        "dim": [
                          {
                            "dim_value": "128"
                          }
                        ]
                      }
                    }
                  }
                }
              ],
              "output": [
                {
                  "name": "cond_out",
                  "type": {
                    "tensor_type": {
                      "elem_type": 9,
                      "shape": {}
                    }
                  }
                },
                {
                  "name": "carry_out",
                  "type": {
                    "tensor_type": {
                      "elem_type": 1,
                      "shape": {
                        "dim": [
                          {
                            "dim_value": "128"
                          }
                        ]
                      }
                    }
                  }
                }
              ],
              "value_info": [
                {
                  "name": "cond_out",
                  "type": {
                    "tensor_type": {
                      "elem_type": 9,
                      "shape": {}
                    }
                  }
                },
                {
                  "name": "carry_out",
                  "type": {
                    "tensor_type": {
                      "elem_type": 1,
                      "shape": {
                        "dim": [
                          {
                            "dim_value": "128"
                          }
                        ]
                      }
                    }
                  }
                }
              ]
            },
            "type": "GRAPH"
          }
        ]
      },
      {
        "input": [
          "loop_out",
          "reshape_shape_Gemm_MM_0"
        ],
        "output": [
          "output_1"
        ],
        "op_type": "Reshape"
      }
    ],
    "name": "Graph",
    "initializer": [
      {
        "dims": [
          "640",
          "128"
        ],
        "data_type": 1,
        "name": "const_fold_opt__59",
        "raw_data": 