{"irVersion":9,"opsetImport":[{"version":19}],"graph":{"name":"Graph","initializer":[{"name":"zero_point__98","dataType":3,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[128]}},{"name":"zero_point__64","dataType":3,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[0]}},{"name":"zero_point__62","dataType":6,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[0,0,0,0]}},{"name":"zero_point__54","dataType":3,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[89]}},{"name":"zero_point__132","dataType":3,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[96]}},{"name":"scale__99","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[141,5,17,61]}},{"name":"scale__97","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[168,149,74,61]}},{"name":"scale__93","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[175,133,26,57]}},{"name":"scale__91","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[78,151,197,57]}},{"name":"scale__89","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[54,217,66,58]}},{"name":"scale__87","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[95,57,118,60]}},{"name":"scale__85","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[106,71,248,58]}},{"name":"scale__83","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[59,35,91,61]}},{"name":"scale__81","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[175,164,129,58]}},{"name":"scale__79","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[78,135,147,61]}},{"name":"scale__77","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[102,136,78,57]}},{"name":"scale__75","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[239,183,8,60]}},{"name":"scale__73","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[130,182,46,58]}},{"name":"scale__71","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[73,2,219,60]}},{"name":"scale__69","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[36,246,32,58]}},{"name":"scale__67","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[88,101,158,60]}},{"name":"scale__65","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[163,69,215,57]}},{"name":"scale__63","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[151,194,81,60]}},{"name":"scale__61","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[102,44,81,57]}},{"name":"scale__59","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[183,2,231,59]}},{"name":"scale__57","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[117,48,254,57]}},{"name":"scale__55","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[86,53,160,60]}},{"name":"scale__53","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[38,51,200,62]}},{"name":"scale__131","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[139,159,186,62]}},{"name":"scale__129","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[68,22,203,60]}},{"name":"scale__123","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[245,204,231,60]}},{"name":"scale__119","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[13,93,3,61]}},{"name":"scale__115","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[194,18,2,61]}},{"name":"scale__113","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[233,56,204,60]}},{"name":"scale__109","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[190,92,193,60]}},{"name":"scale__105","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[233,246,96,60]}},{"name":"functional_1/dense_9/MatMul","dataType":3,"dims":[128,640],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[239,218,237,224,205,201,219,204,203,245,247,241,225,235,242,236,228,232,238,245,231,240,255,250,245,252,232,240,10,18,19,21,21,7,10,11,1,230,221,231,232,221,222,243,2,248,245,253,17,46,30,255,241,246,255,245,242,222,218,222,228,226,231,233,243,234,237,238,242,246,238,228,228,238,235,229,226,225,213,218,227,231,232,232,220,233,244,236,222,211,209,215,226,226,227,220,232,238,232,238,239,226,223,229,237,244,250,244,248,245,242,244,240,243,241,234,220,222,231,234,218,220,221,204,200,206,209,212,236,215,239,226,202,199,211,188,191,243,246,238,220,228,238,234,224,226,236,245,229,235,253,249,238,245,230,239,7,15,19,21,20,2,4,7,254,226,213,226,229,220,223,240,255,246,238,244,14,45,27,254,238,239,249,245,246,221,213,219,227,220,224,229,243,232,232,233,243,242,236,228,229,239,232,226,224,227,217,218,224,228,236,236,223,232,245,237,224,212,210,218,227,226,229,220,230,239,233,240,239,227,225,234,241,249,0,246,250,248,247,249,246,249,251,243,227,231,239,244,229,233,234,220,217,223,224,227,242,218,248,235,208,204,210,186,191,244,245,235,221,231,243,239,225,218,220,228,221,229,248,247,240,249,234,243,11,16,16,25,26,7,10,14,2,232,224,235,234,219,219,235,255,250,247,1,31,62,40,11,255,6,15,2,254,242,241,248,245,239,241,246,1,254,249,247,254,248,250,248,246,249,242,235,233,242,225,221,226,231,242,244,233,240,253,249,223,212,213,218,222,225,226,214,224,230,224,232,228,219,216,224,235,244,248,242,247,246,246,248,242,248,252,239,226,228,238,245,231,233,234,215,217,225,222,221,242,231,15,0,224,218,224,203,202,246,245,231,216,224,242,240,222,210,204,213,217,229,246,247,243,254,242,250,12,11,12,21,21,3,5,11,0,229,223,233,232,217,216,237,1,247,251,6,33,65,49,17,6,12,17,2,1,247,248,9,10,0,251,249,5,7,3,1,0,255,4,4,254,1,252,244,241,251,233,231,238,244,253,252,239,244,1,254,230,220,216,215,224,231,229,217,224,229,224,234,232,221,214,222,234,244,248,243,249,246,248,249,244,250,251,239,229,229,237,247,234,237,239,219,222,228,225,224,244,237,29,15,236,229,239,218,213,245,240,228,215,220,235,240,225,212,205,215,221,232,244,242,236,242,230,238,4,5,10,19,13,250,249,251,241,217,211,223,221,211,212,228,242,235,237,241,3,39,30,0,238,240,248,236,238,220,212,227,234,228,228,224,233,231,233,236,233,231,233,233,235,243,240,228,228,233,223,222,227,233,236,235,224,229,237,236,225,218,209,211,222,228,226,213,220,230,226,236,238,227,222,229,239,247,254,250,255,249,249,249,247,251,254,243,234,234,241,252,241,244,243,232,229,234,232,233,240,248,11,246,240,6,0,245,245,248,9,255,235,249,9,12,11,13,4,254,4,246,224,214,229,237,222,223,229,239,239,220,212,221,236,1,249,224,217,217,219,221,218,246,249,240,225,226,231,234,237,233,254,10,9,250,226,225,227,207,204,239,234,236,236,238,224,225,233,236,240,246,246,239,229,228,243,245,245,232,232,239,233,228,204,214,223,218,227,237,233,231,236,231,221,234,238,232,225,228,234,220,222,232,226,237,227,224,237,241,239,245,245,236,238,231,226,217,218,230,218,220,226,208,218,222,212,194,244,255,22,254,247,12,4,246,245,250,11,0,238,252,11,14,15,21,13,3,10,253,224,216,240,249,231,227,233,243,240,221,212,224,242,9,255,229,222,222,222,227,228,4,5,251,239,242,249,249,253,252,16,26,20,9,248,244,245,226,225,255,246,249,252,253,239,243,250,253,2,8,8,255,243,240,0,5,4,248,246,255,251,243,216,225,234,223,237,250,245,241,249,241,233,246,249,243,235,237,247,228,228,240,231,243,234,227,241,246,241,249,251,239,240,235,229,221,221,233,219,222,231,209,221,226,218,197,242,4,22,246,238,9,0,242,243,244,2,250,230,245,4,6,8,17,7,251,0,243,213,207,235,243,227,226,233,236,229,210,200,210,233,4,249,221,214,217,221,226,225,253,254,243,231,230,236,237,244,248,10,21,10,254,239,235,234,212,213,248,238,242,240,243,231,234,241,244,249,4,3,249,234,230,249,0,1,245,240,249,245,238,213,225,236,219,229,241,242,237,241,235,228,237,241,237,232,234,247,224,224,235,224,235,226,222,236,239,230,235,237,226,229,224,223,217,217,226,213,215,224,203,217,221,212,190,245,1,17,240,230,1,249,240,238,235,248,245,227,234,247,252,250,254,244,241,248,236,205,199,225,232,220,223,230,229,217,202,195,199,218,245,237,210,203,205,213,224,222,244,241,230,221,221,222,222,232,238,1,14,255,241,227,226,226,203,206,243,235,235,228,234,228,230,229,235,240,251,251,239,226,223,241,250,252,242,240,247,241,233,209,221,235,217,226,240,241,233,236,230,222,230,233,231,229,230,244,222,219,230,220,230,221,217,231,234,225,227,228,217,221,220,220,216,214,223,209,212,221,202,216,219,209,188,245,249,9,241,234,252,250,243,236,229,245,242,228,232,242,247,243,244,234,237,244,235,209,203,224,233,222,220,227,225,215,205,200,202,218,243,235,212,207,208,215,227,228,254,252,239,230,229,230,231,240,249,12,18,6,246,232,230,229,213,222,0,249,246,236,239,236,239,235,244,247,253,255,246,233,231,248,250,254,249,250,4,251,242,220,228,239,222,237,254,252,243,249,244,236,245,246,243,241,240,255,234,231,244,234,242,235,230,242,243,239,244,246,233,232,231,230,228,226,234,223,226,232,220,232,233,222,207,243,8,12,34,22,18,6,248,245,247,243,1,17,16,7,252,0,250,215,204,236,253,249,247,251,3,20,24,13,253,250,1,6,253,240,234,239,245,246,252,249,237,227,236,244,233,236,238,236,242,238,251,16,17,14,11,3,4,9,19,11,255,14,21,1,234,244,248,253,2,242,225,230,238,250,252,248,236,236,239,255,246,223,236,239,240,237,238,232,222,229,207,199,214,216,231,230,207,208,198,219,211,214,216,210,209,200,207,228,226,213,215,224,227,221,249,5,4,2,255,3,10,250,227,236,2,1,240,242,6,11,36,20,12,0,243,241,243,241,254,14,16,0,241,249,244,208,194,221,242,238,237,245,1,23,29,15,248,237,246,9,3,238,227,230,231,234,243,240,230,216,219,229,222,223,225,222,228,216,229,6,11,9,254,246,1,1,252,247,246,5,11,245,215,224,233,246,0,233,212,213,222,234,247,247,227,222,236,5,252,233,232,242,254,242,232,218,219,219,212,212,219,216,221,227,213,219,208,222,207,214,217,215,201,194,207,224,223,213,212,217,218,209,240,253,2,250,238,236,247,236,222,217,230,238,230,240,2,6,36,18,7,2,247,240,242,248,5,13,16,251,232,245,248,225,207,219,239,240,240,246,1,28,36,20,245,229,237,6,3,236,223,226,224,223,237,236,226,215,219,227,221,220,221,216,221,213,231,6,12,10,250,248,7,0,244,254,245,255,9,247,210,211,222,247,6,234,213,216,227,226,249,3,237,230,253,19,8,251,246,1,17,11,251,234,232,235,245,246,244,240,234,237,234,242,231,240,224,232,242,241,211,212,224,231,229,222,219,221,218,211,242,1,13,253,233,230,243,239,244,232,228,238,240,240,249,254,27,10,4,6,252,242,236,248,9,10,10,247,231,238,243,233,219,226,243,245,244,243,252,24,38,24,243,227,234,255,251,229,219,226,224,222,235,237,223,213,219,227,220,216,216,213,223,223,245,12,12,7,248,249,6,1,251,6,245,252,10,250,213,209,217,246,3,231,219,223,232,227,247,6,240,236,4,20,8,253,253,5,18,23,11,246,233,244,2,255,250,249,234,234,236,244,231,243,228,234,249,246,213,216,226,226,222,217,210,210,208,208,236,254,8,248,230,228,240,238,248,241,233,235,235,237,244,244,13,3,6,6,251,241,237,247,7,7,3,247,234,237,240,233,224,232,247,249,247,246,251,22,39,27,246,230,238,252,246,230,223,231,234,232,242,243,225,217,223,230,225,223,224,224,236,239,4,19,17,13,2,1,8,5,7,18,255,2,17,1,225,225,229,250,5,237,227,229,239,238,251,5,242,241,8,22,6,251,255,5,14,23,14,255,233,244,250,253,246,243,231,232,232,237,225,242,226,229,241,240,214,214,223,221,217,213,206,205,205,205,233,250,255,243,232,229,242,238,239,238,237,235,231,250,232,234,222,220,227,1,3,254,13,18,0,254,255,247,248,251,248,245,243,246,251,4,255,248,250,253,3,249,236,211,223,16,26,253,242,241,240,245,246,229,171,177,232,246,3,249,245,237,230,224,221,228,230,240,238,237,250,239,229,237,232,216,233,223,221,219,224,231,248,241,232,225,232,226,229,237,235,234,239,250,238,244,248,9,15,14,255,250,248,244,255,0,253,247,239,240,237,236,245,244,225,228,232,232,229,235,233,228,234,238,234,229,230,230,230,225,233,231,231,227,217,215,224,222,221,221,226,241,214,211,201,198,207,251,254,245,11,25,10,1,2,246,245,247,249,3,1,0,6,10,0,249,248,254,3,247,235,212,221,12,23,252,239,241,243,246,248,230,168,175,231,245,5,2,248,233,229,228,228,233,235,239,238,242,251,238,229,236,232,221,236,226,221,222,225,235,249,242,237,233,239,234,233,238,244,245,242,251,239,244,251,4,9,14,6,4,255,253,6,1,253,246,237,238,236,232,242,245,224,227,233,229,229,231,227,222,231,231,227,223,224,229,230,227,232,231,234,230,219,216,220,222,224,222,222,236,195,190,183,184,194,240,241,232,3,17,1,252,253,245,246,248,250,12,7,2,7,9,252,247,244,245,249,240,233,215,226,11,20,254,239,243,246,246,248,230,164,172,228,243,5,3,250,233,229,232,236,233,231,232,243,251,245,231,229,236,228,216,231,226,217,217,220,233,247,240,235,233,241,240,230,229,246,248,240,249,241,244,251,255,0,11,6,11,4,1,4,0,253,243,239,242,242,235,244,254,231,231,239,233,237,236,229,225,236,231,228,227,227,232,235,234,236,235,242,237,228,224,220,223,230,228,223,232,193,181,175,181,192,227,227,225,251,0,236,239,245,241,243,243,239,254,248,247,250,252,240,238,235,233,237,232,230,213,221,3,14,252,235,237,241,240,242,228,165,171,218,231,249,253,249,236,228,223,228,224,223,227,235,245,240,229,225,225,218,205,221,217,208,208,210,226,241,235,228,222,228,228,218,215,236,234,225,239,231,234,240,247,251,1,250,252,250,245,245,244,243,233,234,241,240,233,241,251,227,225,234,230,233,235,229,228,239,232,230,231,230,231,234,234,236,237,245,237,227,222,215,216,224,225,219,233,204,197,188,194,203,224,217,215,247,250,231,241,249,241,236,237,232,239,236,242,244,246,236,238,240,241,241,229,228,211,217,1,15,251,238,240,242,240,245,231,169,175,225,236,250,0,2,250,240,228,227,227,230,242,242,249,251,245,240,237,226,211,228,227,219,216,215,232,249,242,232,224,228,226,222,220,236,231,227,244,240,240,243,253,4,5,249,248,251,244,245,246,243,236,242,247,245,239,246,251,226,229,237,233,232,238,232,234,246,242,240,240,239,236,238,236,239,242,247,238,229,225,218,217,223,228,223,211,250,252,250,247,252,15,23,8,251,17,22,7,4,244,251,4,8,31,41,21,19,23,7,240,229,243,247,237,242,254,4,21,27,14,255,243,230,218,223,245,5,2,24,42,16,247,231,224,217,230,242,234,244,2,251,247,234,232,247,4,4,1,255,252,233,241,255,3,238,242,249,14,37,18,10,23,26,24,9,244,242,5,11,245,250,3,252,4,243,243,1,245,246,244,227,244,250,239,244,240,238,224,228,232,234,231,224,208,214,212,211,215,213,216,227,233,237,240,233,221,226,234,236,223,218,234,229,211,247,250,249,245,251,19,28,10,252,17,19,6,4,248,255,7,8,29,37,20,20,26,11,245,236,248,249,239,244,2,9,27,35,25,10,254,242,230,231,253,11,11,38,57,33,8,250,243,234,242,255,249,3,17,9,2,243,247,13,25,25,17,12,9,246,0,15,14,251,1,5,25,48,28,16,32,35,29,11,250,249,10,19,249,251,5,253,8,247,245,251,239,246,240,230,250,249,233,238,234,234,217,221,226,232,226,220,208,215,213,213,219,217,216,226,233,235,239,236,221,228,237,231,221,219,233,225,210,243,240,237,235,250,20,29,11,248,6,8,2,255,240,249,4,252,3,14,6,7,15,254,233,229,241,244,235,235,249,2,22,31,19,2,245,232,220,222,244,7,8,33,50,25,0,245,237,225,229,241,239,252,10,254,243,228,235,3,18,20,9,0,251,235,248,8,2,243,249,248,12,35,16,4,19,19,14,2,244,242,2,7,243,242,248,237,249,238,232,233,229,238,228,222,244,242,228,233,231,229,213,217,224,228,222,219,209,216,217,217,224,221,216,229,234,238,241,240,223,232,240,238,223,219,235,229,211,240,234,230,228,247,14,18,1,240,253,2,255,251,232,242,253,238,236,244,239,243,254,240,224,223,236,240,230,228,237,249,18,25,10,247,232,218,208,212,232,2,3,26,41,15,244,230,221,211,212,223,227,246,1,237,226,221,226,247,8,11,255,246,240,229,240,255,247,236,243,241,2,21,0,252,10,6,2,250,239,234,251,253,241,242,242,228,236,229,223,228,227,236,226,219,240,237,230,236,228,228,215,219,228,224,221,223,212,218,220,221,228,224,219,231,234,243,246,241,225,231,240,249,228,218,237,234,211,242,237,231,231,248,9,13,252,235,253,2,0,253,229,237,251,237,230,235,226,230,245,243,234,236,245,243,228,224,237,250,18,27,15,255,243,223,212,219,239,11,11,31,47,24,0,247,237,223,223,234,245,11,20,248,239,244,253,20,37,33,18,10,6,255,5,14,11,6,10,8,21,32,9,9,20,16,9,4,251,242,5,9,1,3,1,244,247,234,228,238,235,244,237,227,244,239,234,238,227,229,217,221,230,221,221,226,215,222,223,225,232,228,222,233,234,245,248,242,226,229,240,254,235,224,243,237,4,232,0,252,2,250,6,236,227,238,241,6,12,10,254,240,226,230,230,241,252,254,2,11,8,15,5,1,14,16,7,6,1,241,244,0,250,232,236,253,247,221,224,246,251,242,230,245,250,2,249,247,244,236,250,0,1,251,6,6,254,239,232,6,3,251,2,4,5,8,241,232,231,227,230,238,236,230,222,228,5,250,235,241,245,251,3,0,249,230,233,243,238,235,239,237,229,217,230,237,251,232,244,242,236,231,244,243,237,236,231,233,235,236,226,223,229,224,219,223,231,213,213,215,206,211,207,206,251,225,2,255,7,2,8,242,235,247,253,18,16,8,250,239,227,230,229,240,250,252,2,8,11,21,10,6,18,13,3,4,0,237,242,3,1,234,240,1,252,226,225,241,250,243,232,249,252,6,1,253,0,250,5,2,253,250,12,18,5,246,238,16,14,7,12,16,13,14,251,242,236,231,236,236,235,232,223,230,5,249,230,234,235,245,255,249,245,226,226,235,234,232,233,233,227,210,218,228,241,222,231,226,222,220,229,230,226,224,220,222,226,229,217,219,225,215,213,217,222,203,204,199,189,197,197,196,251,219,11,8,15,13,16,252,245,248,254,19,18,2,245,241,229,225,224,239,248,252,4,5,3,10,255,254,13,3,251,2,0,235,237,249,246,224,232,249,243,224,222,233,237,228,212,229,233,236,240,239,243,236,245,244,241,237,0,7,0,233,219,252,7,7,11,15,7,3,251,242,232,235,239,235,230,236,235,239,252,239,228,231,224,233,240,236,247,234,226,234,241,229,236,240,232,222,225,234,241,228,238,231,227,228,239,232,228,224,224,229,235,237,228,234,233,226,223,224,230,215,214,214,203,210,214,219,252,227,21,17,26,23,24,6,253,249,255,17,9,247,244,245,228,223,228,240,250,0,8,11,253,249,239,235,246,242,243,255,248,226,226,236,230,215,225,240,237,218,216,232,232,220,197,206,214,219,227,225,221,212,224,226,224,221,235,243,236,209,197,231,245,255,4,255,248,232,232,230,225,230,236,231,222,233,238,233,229,219,212,225,211,214,222,226,240,230,225,234,233,217,233,231,222,222,227,233,238,231,245,234,227,236,250,235,232,230,231,236,243,246,240,241,235,231,232,232,247,227,219,224,220,228,228,232,249,235,30,26,27,20,22,9,2,255,2,16,7,245,251,1,232,223,235,245,0,8,12,20,5,255,246,238,239,238,251,9,254,231,230,239,235,226,234,243,243,225,220,238,245,237,216,220,234,242,250,243,239,230,240,247,245,245,4,13,254,228,216,246,1,19,26,14,5,242,240,245,245,243,1,254,243,251,255,245,239,233,225,237,223,221,229,241,249,241,237,241,236,224,239,230,224,225,230,237,244,235,245,230,229,244,253,238,233,236,239,246,246,251,241,237,232,224,226,231,247,227,219,219,220,234,229,229,207,237,252,225,187,191,228,212,208,220,215,222,219,228,255,251,208,214,238,243,246,8,12,243,212,236,27,9,2,255,14,8,239,248,245,232,222,216,225,223,227,202,220,251,250,248,234,221,218,235,231,218,234,236,237,226,221,236,236,220,211,225,230,226,232,237,228,230,221,213,232,235,233,223,218,244,5,232,221,243,253,249,252,243,241,238,242,1,243,245,6,14,247,241,250,249,250,255,250,226,235,242,244,2,247,246,4,248,1,254,0,9,7,9,24,2,244,230,234,7,13,247,248,247,255,247,232,239,203,244,3,227,194,202,235,217,207,217,214,227,224,232,2,3,217,219,245,247,251,17,17,246,222,245,33,15,6,3,23,18,246,0,253,241,233,218,226,228,233,213,228,255,253,250,240,232,230,247,245,230,242,247,245,230,229,247,250,240,225,235,237,235,242,249,237,241,233,227,244,250,245,234,238,255,10,245,234,253,8,7,5,251,245,243,248,11,251,252,12,15,250,244,249,244,247,255,250,228,242,243,244,2,245,243,254,244,253,253,249,3,1,3,19,251,239,222,228,5,10,242,243,232,244,238,221,221,202,244,5,230,201,210,240,220,208,217,214,230,230,233,4,8,224,222,243,244,251,16,15,244,225,245,26,12,6,3,27,19,240,252,253,238,230,211,218,225,233,215,230,247,240,236,232,225,228,241,244,232,234,236,234,221,224,241,246,239,222,224,226,225,239,244,227,237,230,224,241,249,242,236,243,252,6,249,239,254,2,255,251,245,235,233,239,0,246,248,6,8,246,235,245,244,245,255,249,230,247,243,247,4,245,244,254,242,250,251,244,1,2,1,22,254,242,221,227,8,13,245,245,226,242,241,223,218,202,239,251,228,204,211,239,222,212,219,213,232,233,235,5,10,228,221,234,237,251,12,10,242,224,239,11,2,3,0,25,16,231,246,252,233,223,202,208,219,233,215,228,238,227,222,223,219,224,237,245,232,225,228,228,214,220,238,246,239,217,216,221,220,237,247,228,234,226,213,232,245,238,239,250,249,0,250,243,251,245,244,235,233,220,221,223,239,233,244,255,251,232,220,238,239,237,250,244,225,241,236,249,4,242,243,252,235,246,247,240,0,1,0,26,0,245,219,227,11,22,252,249,225,248,253,231,220,200,240,251,232,204,204,234,217,214,226,217,237,239,237,10,15,232,220,227,228,255,19,14,249,238,251,16,8,9,6,26,18,237,251,0,238,232,212,220,227,242,225,240,254,246,240,244,244,248,3,17,4,246,248,250,240,251,14,23,21,255,248,244,242,11,25,7,11,254,242,4,22,15,16,25,21,25,19,14,20,8,5,254,252,240,238,237,252,253,7,11,1,240,234,254,3,253,6,252,236,253,247,8,17,252,1,9,245,0,1,253,16,16,13,38,14,255,231,237,22,37,13,11,241,9,17,252,240,232,240,251,13,14,254,245,7,25,10,17,1,0,11,249,234,241,252,247,252,4,247,243,244,235,241,227,231,252,15,8,252,2,253,1,22,3,242,0,5,244,0,1,2,251,251,251,252,250,245,255,0,246,242,250,251,244,244,241,252,1,239,233,250,7,13,12,2,2,252,5,14,10,251,238,247,9,254,232,227,238,248,254,250,253,1,8,2,234,239,243,0,3,254,244,238,243,235,236,250,241,226,230,227,223,223,231,240,244,240,235,232,229,228,224,226,217,245,1,254,244,231,232,248,240,237,241,236,229,223,230,246,252,236,229,246,6,2,14,250,248,4,244,223,228,241,244,4,8,246,227,221,213,222,215,225,238,252,250,243,247,240,245,12,252,234,247,253,237,246,248,254,247,248,244,243,238,241,1,5,247,241,248,244,234,227,227,237,245,232,230,241,251,251,251,244,243,240,244,251,247,236,227,231,0,240,218,212,228,235,232,231,229,235,245,240,221,219,229,244,239,237,230,227,234,224,224,239,229,214,218,216,209,214,222,234,235,231,230,228,225,223,215,216,209,234,246,243,232,222,223,234,227,224,228,223,229,216,224,248,7,239,227,229,236,246,9,248,249,7,249,223,227,244,253,13,16,249,227,217,214,221,218,227,230,245,248,246,249,241,244,13,3,243,249,253,238,244,247,253,249,255,247,244,247,1,13,17,4,247,253,249,244,232,233,240,244,231,236,244,246,235,234,234,238,238,235,234,230,221,220,223,248,228,206,197,214,223,208,211,207,213,225,219,210,204,217,236,227,226,218,220,224,215,215,231,223,206,212,208,198,210,218,229,230,229,226,227,227,226,220,224,217,235,248,249,238,232,235,238,233,231,238,231,225,226,231,2,23,252,233,222,228,241,4,250,0,18,0,227,233,252,255,5,11,247,230,222,229,231,225,228,234,255,0,250,254,250,251,16,8,246,244,250,236,247,249,251,244,252,248,250,7,14,14,14,1,247,1,251,251,244,244,245,243,230,234,243,246,229,229,231,236,236,229,226,221,218,222,221,241,224,205,198,208,221,204,202,198,204,215,207,205,212,214,227,228,225,212,217,223,217,216,230,223,205,212,207,199,210,215,226,230,232,228,233,233,229,226,231,224,239,251,254,244,240,245,246,240,240,247,241,227,239,242,8,28,10,242,229,239,251,6,253,7,18,251,227,238,252,244,245,253,239,233,234,241,239,223,228,244,11,0,245,254,249,247,12,0,232,231,245,233,248,254,253,241,240,237,244,1,255,251,248,234,233,243,240,245,247,243,244,247,225,220,229,244,233,234,239,240,241,239,237,230,234,233,228,242,230,221,220,220,229,225,219,216,217,225,216,216,231,226,231,244,236,224,228,233,233,231,244,235,219,229,228,220,224,230,239,241,246,242,243,244,238,238,245,235,255,5,5,252,251,255,12,1,251,5,3,3,248,253,238,253,255,244,252,23,48,36,11,245,252,22,15,3,21,46,45,23,7,232,227,250,255,3,15,31,32,11,250,237,243,15,26,15,3,0,247,247,221,239,23,13,2,4,4,1,246,6,22,249,228,227,252,5,242,241,238,238,236,216,220,229,244,249,253,243,235,236,240,247,244,245,236,229,232,234,226,246,11,0,245,236,244,239,241,252,16,23,3,244,248,235,241,232,217,217,222,235,233,239,235,223,219,216,216,222,234,229,228,231,227,220,223,229,230,224,221,221,211,216,217,216,205,194,188,2,237,233,223,246,254,231,239,17,51,37,7,240,252,25,14,0,28,56,53,28,9,229,227,243,251,255,16,38,36,11,252,240,247,23,37,27,10,5,252,247,222,251,47,37,31,24,17,16,5,24,45,9,235,246,14,22,255,0,255,0,249,226,233,244,255,9,10,255,249,249,251,2,254,253,246,239,237,236,232,9,30,17,8,254,1,248,249,8,24,31,9,249,1,245,3,250,228,228,228,245,243,252,250,236,230,235,232,237,247,246,250,1,249,234,238,241,247,241,240,243,235,236,245,240,227,218,214,0,236,225,221,250,0,223,225,3,43,28,248,231,246,22,8,249,20,40,39,21,1,222,223,235,242,249,14,36,34,6,244,239,245,16,34,24,7,2,254,250,224,247,34,30,31,12,255,4,245,254,20,254,228,244,1,1,250,6,249,237,238,220,228,231,244,2,253,247,244,241,241,244,233,236,238,231,225,220,219,9,23,9,2,3,10,254,254,248,5,16,4,240,247,236,243,236,213,222,218,232,230,245,242,229,219,227,228,233,244,244,248,252,248,235,237,241,249,245,242,246,237,234,249,241,228,217,216,4,249,239,236,4,4,226,222,249,35,24,246,236,250,22,7,249,19,26,24,16,1,227,230,241,247,6,19,37,35,6,245,248,253,16,34,26,6,255,2,254,227,239,18,21,20,253,241,248,230,233,254,249,229,245,243,241,4,22,5,239,235,219,230,230,248,254,249,244,241,235,238,241,229,231,240,232,223,218,222,9,18,10,255,13,24,11,14,245,6,14,8,245,249,238,237,223,205,222,220,228,224,244,240,229,216,224,227,232,244,246,246,244,246,240,244,249,255,249,243,247,239,238,0,249,232,218,221,7,2,253,246,2,0,237,229,252,27,21,252,243,2,23,10,2,18,17,14,12,254,229,239,252,0,16,25,38,35,10,247,246,0,18,35,29,4,254,2,254,226,234,12,16,16,252,242,246,232,236,1,255,238,247,242,239,5,20,10,249,239,220,232,232,250,249,249,242,235,231,236,239,231,228,240,238,222,217,220,0,7,3,248,12,26,15,20,244,4,11,8,247,254,243,235,216,204,225,224,228,222,243,239,230,220,225,231,237,247,250,247,243,247,244,245,253,0,252,242,248,237,238,0,248,230,217,219,243,225,203,209,221,221,220,212,214,240,247,244,245,252,12,18,7,4,4,6,21,29,21,14,9,10,15,9,6,7,6,5,3,10,7,10,19,21,20,27,30,23,25,26,31,32,33,31,33,39,41,38,40,43,32,27,28,33,41,49,45,47,43,27,34,48,44,46,37,22,37,40,31,33,32,34,42,41,29,24,15,11,17,14,14,7,7,8,241,229,228,232,231,243,252,255,252,247,239,239,222,224,235,227,217,228,237,240,246,242,241,240,239,241,241,240,235,231,231,231,233,237,240,221,228,227,235,234,242,234,224,229,231,225,227,221,221,242,249,246,246,254,14,23,13,8,11,11,20,28,30,28,19,16,14,8,11,17,11,10,10,17,15,16,22,24,23,31,31,21,24,24,25,23,27,29,30,38,41,37,36,39,25,19,24,25,29,35,33,38,36,21,25,36,34,38,30,17,31,33,25,28,25,26,32,33,23,18,11,8,15,12,10,4,4,4,242,233,230,233,231,247,253,1,255,250,241,243,231,231,240,233,222,233,239,242,246,245,242,240,242,240,244,243,238,234,233,234,237,241,243,228,233,232,241,241,249,0,9,8,252,241,236,241,244,252,253,245,242,249,5,16,10,8,4,254,1,12,24,24,14,8,1,255,10,19,8,3,3,11,7,5,10,13,8,15,20,15,16,3,253,252,5,12,12,14,17,9,2,7,248,246,253,252,250,253,254,10,11,249,250,5,5,8,255,249,7,9,4,6,3,1,7,11,1,255,252,250,0,250,251,248,251,248,232,228,225,231,231,245,248,0,1,0,245,249,244,245,249,246,237,241,245,244,249,249,245,241,243,240,249,250,248,247,242,244,244,248,254,249,247,243,253,255,4,15,38,33,17,6,247,253,4,5,251,239,237,240,250,9,2,247,231,226,237,253,19,20,3,252,242,247,7,12,251,242,241,249,247,244,244,245,243,250,5,11,10,241,232,232,245,249,244,244,244,238,234,239,222,219,231,230,227,229,238,248,243,220,225,236,241,244,233,233,250,250,241,248,242,236,240,248,243,247,241,239,248,238,243,242,247,242,230,228,224,235,240,252,253,4,6,11,253,2,1,6,6,11,5,253,255,252,2,0,252,247,252,249,5,10,7,11,2,1,1,7,17,25,17,5,18,22,6,18,43,39,24,14,255,7,14,9,248,234,235,238,247,255,249,239,216,208,224,242,9,14,249,238,227,233,250,1,240,229,232,239,238,234,231,229,228,235,245,2,4,234,221,221,233,236,233,230,229,223,219,224,210,208,219,215,212,213,222,234,232,208,214,226,231,231,219,220,237,238,228,230,227,224,225,235,234,242,231,227,239,231,238,236,242,242,229,220,219,236,240,251,254,3,4,13,254,4,4,11,9,17,11,253,3,2,7,3,1,251,0,253,8,12,9,15,6,4,5,11,21,35,24,9,21,29,252,228,232,245,234,242,231,220,232,232,216,218,232,248,241,235,242,1,29,34,252,232,216,207,212,225,229,219,202,213,217,203,194,203,223,230,233,224,216,229,243,251,239,227,232,241,252,255,251,242,244,254,252,252,244,223,227,238,238,241,248,252,253,241,240,240,236,235,241,249,250,249,247,237,223,230,245,249,240,243,247,1,0,248,231,224,219,218,226,228,224,218,213,231,233,232,241,243,241,227,218,243,232,223,236,248,240,236,230,233,231,240,246,246,243,246,254,246,244,249,247,251,245,240,235,227,225,216,0,239,239,252,238,247,244,232,240,237,225,227,239,254,252,245,247,11,45,55,12,240,222,212,212,227,236,227,206,216,223,209,199,210,230,239,241,233,224,232,246,254,242,226,234,246,254,254,251,240,249,4,5,1,247,226,231,244,243,244,252,253,0,241,240,243,240,237,242,248,253,254,254,244,229,236,0,1,250,251,253,8,6,253,236,234,227,221,230,234,233,227,223,237,241,237,245,251,249,230,223,248,241,229,240,250,244,234,226,229,225,235,241,244,246,251,3,250,249,254,252,1,249,245,239,233,233,222,9,253,2,11,246,252,8,251,249,247,243,246,254,16,16,7,6,31,79,90,40,8,244,233,225,234,251,241,221,233,238,228,226,235,246,254,253,244,236,243,253,255,244,232,245,255,250,247,245,241,252,6,10,1,252,232,232,247,246,239,247,244,250,240,239,243,240,236,245,245,247,254,4,253,237,248,17,12,8,9,11,23,24,10,250,254,243,233,240,249,247,245,243,250,1,241,251,9,10,242,233,2,0,243,252,0,254,240,229,231,225,233,237,241,248,253,4,252,250,253,252,1,246,244,239,233,231,224,9,5,14,19,248,1,30,18,11,5,8,8,9,32,39,28,24,53,110,119,60,26,7,254,240,247,8,255,244,3,3,248,253,5,11,15,15,5,251,5,8,4,255,247,8,17,0,252,252,249,2,10,15,7,5,247,243,253,248,236,243,240,246,245,246,248,241,238,252,249,250,4,12,8,248,8,35,30,22,24,27,36,41,27,11,18,9,0,255,9,5,10,8,11,19,251,5,25,28,2,245,14,14,2,11,11,13,255,240,239,236,243,241,246,252,0,6,1,251,250,250,1,246,246,240,233,231,230,6,9,17,16,244,253,30,22,20,10,11,7,11,37,45,34,30,58,110,115,57,26,8,254,242,250,9,3,0,15,11,0,2,10,16,20,19,6,252,7,8,5,0,249,10,17,0,253,255,253,3,9,16,14,11,249,241,248,243,233,238,240,247,245,247,248,238,234,250,248,250,6,12,8,249,6,30,28,18,17,23,25,35,26,10,14,12,5,253,0,253,8,4,9,14,247,1,17,20,248,235,6,3,247,2,6,6,251,238,234,233,236,233,240,246,249,1,251,246,243,241,247,237,237,233,227,224,221,254,252,238,45,59,15,243,233,229,242,239,250,247,235,235,235,220,242,29,23,254,14,2,235,221,223,229,223,236,255,4,31,44,38,15,6,255,255,251,238,243,254,254,252,7,2,243,234,241,244,247,6,2,250,2,249,243,236,241,238,242,253,252,223,223,225,223,227,242,243,235,241,237,240,252,249,247,240,227,231,250,5,4,2,253,1,6,2,241,231,243,254,242,1,1,244,245,238,225,223,239,228,228,234,234,234,238,232,228,231,221,221,218,219,227,214,207,205,210,224,228,231,232,225,234,232,227,221,1,6,245,61,80,26,242,234,230,232,228,246,247,235,234,241,228,248,32,22,253,11,255,235,226,231,234,226,240,8,13,39,50,44,23,15,5,3,253,241,250,5,6,6,14,7,252,252,7,7,1,7,3,0,10,0,250,242,248,246,246,1,1,231,231,232,227,233,248,250,241,241,236,243,255,250,246,240,226,228,246,2,255,254,248,255,3,254,239,232,242,248,235,254,0,249,248,235,218,219,233,225,226,228,230,236,238,233,233,236,226,228,225,227,232,216,206,202,210,226,229,232,233,223,234,234,231,223,5,8,246,66,89,32,245,239,234,232,224,250,253,233,229,242,232,247,26,16,253,10,1,237,227,229,231,225,240,8,12,29,36,30,12,2,248,249,249,238,244,7,10,7,5,252,245,246,2,255,251,254,245,243,248,241,240,234,238,236,238,251,253,225,229,229,225,233,246,246,240,242,235,245,3,249,244,242,230,230,238,0,255,249,235,244,248,245,238,239,245,246,232,248,252,251,251,237,214,219,233,229,234,234,235,245,243,231,235,240,232,235,232,232,244,229,214,209,216,235,238,244,245,233,245,248,243,236,7,4,240,57,79,25,244,246,241,236,232,254,251,232,227,241,235,246,17,5,244,0,252,236,222,225,223,220,237,254,0,15,17,14,3,242,232,237,240,228,237,5,10,255,251,248,244,240,248,245,246,252,237,238,237,235,232,221,221,220,225,245,246,219,222,222,217,226,241,238,237,244,235,246,1,245,245,244,232,227,228,245,249,244,227,233,240,240,235,232,247,248,227,241,251,248,249,236,212,222,234,234,240,242,244,253,248,236,240,244,236,240,238,238,254,237,221,217,222,239,245,252,254,241,252,255,250,242,2,255,237,42,59,12,239,250,250,243,236,253,248,229,226,240,231,234,0,250,238,248,248,231,215,217,210,214,233,245,248,6,6,2,250,234,225,231,238,226,235,0,3,246,243,243,241,240,248,249,249,245,229,236,236,231,226,214,216,211,208,235,240,217,216,214,210,219,230,228,228,238,226,235,249,239,239,240,227,219,222,237,240,235,216,224,234,234,223,215,235,238,215,229,242,238,245,230,204,215,221,224,229,231,235,244,237,231,235,239,232,234,230,233,244,228,214,207,212,229,232,239,241,224,236,240,236,224,201,253,7,45,42,35,34,37,33,42,32,46,55,29,7,21,18,12,1,245,2,17,32,30,22,14,4,244,248,241,231,237,2,17,3,249,241,238,245,246,248,247,240,247,240,240,240,238,252,11,8,240,240,242,230,227,222,243,239,225,215,224,229,223,228,239,228,235,229,221,228,245,241,249,253,250,252,252,250,241,224,242,243,233,226,240,247,237,229,237,244,251,247,242,255,242,248,247,233,243,247,254,8,11,20,253,244,237,243,233,240,244,241,240,239,234,235,233,223,226,226,235,235,241,238,230,211,193,195,251,12,46,39,33,50,57,47,50,45,64,68,41,23,35,32,30,29,16,18,35,53,50,37,28,16,252,7,1,246,250,15,34,20,9,2,254,4,1,1,253,250,8,2,2,7,2,14,35,37,15,10,10,248,248,245,5,3,248,235,241,247,241,245,253,241,247,242,232,240,6,5,9,13,5,8,14,14,254,236,254,0,249,238,248,5,253,245,248,4,10,254,251,6,250,2,253,239,250,1,6,13,18,26,3,249,241,247,237,241,244,244,243,241,236,241,234,226,230,232,240,239,241,243,236,215,193,192,243,13,39,23,24,51,67,62,53,45,62,66,43,29,39,31,33,35,27,24,38,49,41,28,21,8,251,11,6,252,2,20,41,30,14,7,2,8,1,255,251,251,5,253,253,5,0,8,33,40,24,17,12,245,248,242,250,252,244,229,240,245,233,237,244,233,236,230,219,228,252,251,255,5,247,252,4,3,241,230,244,244,241,229,233,250,243,233,235,251,250,236,237,245,238,246,239,228,236,247,249,254,4,8,244,232,229,237,226,228,229,230,233,228,225,233,224,218,224,225,232,229,223,228,227,204,179,191,234,3,30,13,17,36,56,55,45,32,46,54,33,25,34,24,23,25,22,23,33,35,23,9,2,248,241,1,255,246,1,22,42,30,11,3,253,5,253,250,248,246,249,242,243,251,245,250,19,25,14,10,3,242,237,231,241,242,234,222,231,232,216,225,232,222,223,216,210,217,234,234,240,244,232,238,240,237,227,224,236,233,228,223,224,234,223,214,223,232,229,219,225,229,228,233,225,222,226,237,234,242,252,249,228,220,221,228,218,222,223,223,226,222,221,227,220,212,219,224,231,226,223,226,225,201,181,193,233,2,33,14,11,20,38,38,38,24,33,45,33,27,29,13,20,23,15,21,28,25,14,4,255,248,239,247,249,244,0,28,48,32,15,8,254,2,1,255,253,251,0,252,1,2,251,255,22,21,8,9,0,254,242,235,253,253,240,231,236,235,221,230,238,227,227,224,223,225,236,237,240,238,236,245,237,231,227,231,241,235,230,234,234,234,224,215,222,226,226,219,227,232,233,233,224,224,224,235,228,244,253,247,222,221,224,230,219,228,230,229,230,225,222,227,222,215,221,229,236,230,235,234,229,207,191,237,1,11,246,242,11,27,38,23,14,22,23,6,5,10,14,11,0,3,252,245,0,11,16,14,3,251,244,241,249,246,247,2,8,253,243,244,249,10,8,1,235,233,5,22,12,2,243,250,1,245,230,237,249,4,254,234,230,231,244,252,2,6,0,4,19,14,15,11,247,253,2,254,250,247,254,245,240,236,243,231,229,247,9,3,249,252,245,248,243,246,248,13,3,5,2,4,6,4,11,251,240,237,234,244,242,230,241,231,243,237,223,219,211,201,200,202,212,229,225,205,219,239,225,226,234,223,206,234,252,255,230,231,3,18,30,16,10,19,19,3,255,7,12,4,247,254,250,244,253,255,255,0,245,241,237,227,234,236,239,246,251,239,231,234,238,0,0,253,232,228,254,15,6,250,232,237,245,240,223,224,237,249,245,225,214,214,231,244,248,250,243,253,16,11,8,6,243,249,254,251,251,247,249,240,239,234,241,228,230,243,5,249,241,242,232,243,241,240,237,6,251,252,253,0,1,252,4,246,231,229,226,232,234,221,231,221,232,224,210,207,198,186,187,191,200,217,214,190,205,225,202,206,217,206,186,234,242,243,223,227,250,7,18,6,8,18,18,4,0,11,15,5,253,11,4,249,2,255,253,254,244,242,238,227,234,235,242,252,255,245,236,239,241,4,4,253,232,233,9,25,19,5,239,246,2,253,236,233,242,2,255,240,224,222,241,0,255,1,248,6,20,18,18,19,3,6,5,5,5,254,254,247,246,240,246,239,243,250,11,255,247,244,229,250,247,243,239,8,0,3,7,9,7,255,7,252,235,235,233,238,239,229,236,224,233,228,217,218,205,191,195,197,206,223,222,200,217,236,213,216,226,218,200,229,240,243,229,231,248,7,15,3,8,19,19,4,4,17,16,6,9,26,15,254,6,7,5,3,246,246,243,233,241,238,241,253,3,250,245,248,250,7,7,255,232,235,14,31,28,10,240,251,8,254,240,235,243,8,4,246,233,228,240,251,1,8,254,7,15,16,17,23,8,6,4,4,4,251,252,248,245,235,244,245,250,255,15,2,252,251,232,247,241,241,243,7,0,3,5,11,6,1,8,252,233,238,238,243,240,233,241,230,238,233,224,225,211,197,202,205,217,231,230,211,229,247,228,227,233,228,212,226,239,245,236,237,249,10,13,3,11,21,22,6,5,16,18,7,11,28,18,2,11,17,15,8,247,249,246,241,251,243,240,1,7,250,244,249,253,4,6,255,233,235,13,30,26,8,238,248,5,250,234,231,245,11,1,241,232,230,236,245,252,4,254,2,6,9,11,17,4,255,253,253,255,247,249,244,239,230,242,250,250,0,14,2,252,0,238,247,236,239,244,7,0,2,0,7,3,255,8,252,232,236,240,246,239,233,244,234,242,237,227,227,215,199,207,212,224,235,235,217,234,253,239,236,239,235,216,252,255,1,245,252,6,244,238,250,19,15,19,19,254,0,13,12,11,6,6,7,253,242,253,251,242,254,252,9,23,12,17,11,253,247,245,238,225,229,243,4,23,12,223,210,204,206,205,205,199,211,229,242,247,222,225,235,229,237,239,229,233,238,221,229,248,243,243,238,222,231,238,237,233,236,236,222,217,219,217,204,197,198,204,212,223,221,219,211,217,228,246,235,224,230,220,225,230,236,0,252,237,226,213,227,240,242,251,248,249,243,238,243,246,246,251,253,255,249,243,246,233,241,244,244,240,252,12,251,246,240,224,237,255,237,234,253,21,11,14,15,254,0,10,9,16,9,4,2,247,237,4,0,247,253,254,19,30,15,18,12,3,3,0,244,230,234,248,12,30,22,236,217,209,210,212,217,211,222,235,245,251,231,237,250,246,252,251,241,243,243,226,237,253,251,254,248,234,245,251,249,241,239,240,228,219,224,224,205,196,206,212,222,229,229,229,216,216,229,249,237,231,241,232,235,237,242,2,2,248,235,225,237,247,250,4,2,2,0,253,4,7,4,4,2,10,6,254,4,244,252,8,5,0,12,26,242,239,234,215,228,253,229,226,250,16,2,4,3,247,245,253,249,2,252,251,251,239,232,1,252,245,249,253,12,22,10,11,7,1,254,2,244,231,237,248,16,30,18,233,216,209,209,214,213,210,218,230,243,252,237,242,250,250,251,245,240,252,250,231,237,254,254,253,247,236,248,249,245,233,236,240,231,217,219,226,215,206,219,218,228,230,228,230,208,208,220,238,239,232,233,221,227,233,241,250,247,236,219,211,225,227,224,245,243,245,240,235,235,244,235,230,229,239,240,228,227,203,211,224,218,213,224,235,243,230,231,219,230,251,226,218,241,11,254,4,3,246,242,252,251,254,251,252,254,246,240,2,250,248,0,5,20,26,17,24,24,17,7,8,253,237,244,252,15,28,17,239,229,219,218,230,224,218,226,237,249,255,248,255,8,9,2,0,14,18,8,243,251,8,10,8,1,1,8,3,2,255,252,2,253,232,233,253,249,238,251,239,253,253,243,248,235,241,241,2,17,6,255,244,244,1,10,17,13,251,232,232,248,236,234,253,244,244,240,239,235,239,229,226,223,238,235,217,207,188,201,224,210,196,211,231,247,228,232,227,235,247,226,217,240,1,248,0,253,243,240,249,249,252,252,255,253,249,243,251,239,241,250,2,18,25,14,21,16,9,7,8,251,233,239,252,11,21,9,233,227,217,208,215,208,203,208,229,244,243,240,242,253,252,242,243,8,7,2,237,245,255,1,251,253,255,9,0,2,1,244,250,250,230,231,249,246,229,244,242,4,5,248,253,241,243,244,15,26,14,8,252,245,4,16,19,14,254,239,244,5,239,240,255,244,239,235,232,231,235,233,229,226,244,242,217,206,190,202,238,220,199,215,240,239,240,245,229,233,250,250,3,248,246,252,249,250,251,4,255,250,252,6,14,252,250,236,226,243,2,241,227,241,243,251,5,7,9,13,2,2,4,8,7,252,243,4,1,251,250,245,253,246,9,5,248,255,9,0,243,241,243,253,6,251,6,14,3,255,246,247,1,250,248,254,243,241,246,238,240,236,246,242,252,240,240,242,239,248,245,238,249,241,225,254,240,218,240,255,15,16,247,228,209,187,235,240,231,224,220,225,241,2,249,250,250,251,5,250,251,232,231,239,233,241,246,252,242,252,250,4,9,236,236,240,223,235,254,246,3,248,247,254,250,248,247,3,254,247,246,2,10,246,242,228,215,230,249,234,225,241,239,245,3,9,8,8,253,251,253,5,5,249,243,3,246,240,238,228,236,229,246,246,235,244,0,251,235,233,240,249,3,249,3,4,250,247,244,247,254,245,246,0,249,244,244,229,230,234,244,237,250,240,237,245,240,0,251,240,247,233,215,247,235,213,235,250,9,10,241,226,204,182,227,234,225,221,213,219,236,252,240,240,239,239,250,241,245,227,231,235,225,234,237,244,239,246,241,252,3,235,243,252,235,244,3,246,2,245,248,1,247,242,243,1,250,238,243,5,14,245,241,225,214,229,248,237,228,243,236,237,253,11,11,5,254,251,249,1,2,249,245,4,250,246,242,227,230,223,241,236,222,239,254,255,230,223,238,251,1,248,5,4,251,247,250,253,1,248,251,8,253,247,244,221,233,242,243,233,253,249,237,247,245,11,8,249,251,227,205,239,234,210,232,251,10,12,239,224,201,171,216,226,215,215,206,216,235,250,236,237,238,237,248,236,238,219,225,230,216,223,225,231,232,237,229,241,253,237,249,12,250,251,7,5,11,246,248,7,0,245,244,3,251,238,248,18,31,4,0,239,225,233,247,243,235,244,239,245,4,19,16,5,255,0,251,254,2,249,241,1,3,1,250,229,228,220,239,238,224,242,251,255,231,220,236,248,251,246,0,5,250,247,249,253,252,244,248,1,244,243,244,220,238,248,244,237,6,255,244,250,247,10,7,253,0,238,216,250,246,215,235,2,19,16,245,231,207,179,223,238,225,223,217,230,241,255,241,247,249,248,2,249,252,231,236,237,224,235,239,244,250,4,249,2,19,238,252,17,253,243,253,10,12,243,239,2,5,246,242,6,254,235,249,24,38,12,9,248,235,230,233,237,235,248,243,248,3,9,5,250,241,246,248,246,246,238,235,248,240,239,237,214,201,191,213,221,216,228,229,225,204,199,208,215,218,214,229,242,225,216,220,229,230,219,217,225,221,223,226,208,222,232,226,222,240,225,217,222,221,240,235,235,244,227,205,246,240,200,222,244,253,246,226,216,195,181,224,236,223,219,217,225,235,247,234,236,235,235,248,251,254,237,239,238,229,248,252,255,5,19,9,12,27,226,242,242,236,246,5,12,20,17,239,241,12,18,18,18,9,4,2,234,229,254,255,243,253,252,254,1,254,6,14,8,5,10,12,27,37,29,3,249,3,1,239,235,0,11,249,241,239,233,239,242,245,244,245,6,1,8,7,26,42,32,6,247,2,254,250,250,249,0,6,245,240,243,244,242,234,244,239,233,227,250,239,227,226,244,253,241,235,220,229,204,198,202,235,238,230,232,231,240,221,227,242,4,5,242,240,242,235,232,230,225,238,242,246,245,235,230,228,231,240,6,254,236,242,3,10,251,244,222,236,233,229,243,4,9,23,20,241,244,11,12,12,12,4,0,2,234,230,0,1,236,245,250,253,254,253,3,11,10,7,11,13,30,43,37,6,252,6,2,237,232,251,7,247,238,241,234,239,239,235,236,240,4,255,4,5,25,39,30,4,242,0,255,248,251,252,3,10,249,239,241,243,239,230,245,237,228,225,251,241,228,222,240,253,237,228,213,227,197,189,202,234,234,227,230,231,238,215,219,235,255,255,235,232,233,225,223,220,215,228,229,235,233,223,217,215,219,228,246,237,220,222,238,247,231,228,227,236,236,234,249,14,13,26,22,237,240,9,9,7,5,0,252,0,237,231,1,0,234,239,242,246,250,253,2,10,7,4,10,9,25,38,30,2,251,6,1,235,229,247,2,240,222,224,217,222,223,217,211,214,241,245,252,250,3,14,19,246,222,240,244,240,243,245,255,6,244,236,238,248,240,232,247,235,230,233,253,246,237,223,241,1,237,224,217,238,201,195,218,242,243,235,235,245,249,225,226,243,10,11,251,239,241,228,227,220,216,228,226,231,233,225,214,219,218,224,240,234,221,233,242,243,231,236,231,246,255,250,5,25,22,29,22,236,239,10,8,7,6,1,251,2,247,234,255,2,243,250,247,248,252,252,6,13,4,255,8,8,22,32,23,4,250,1,252,232,225,243,255,240,219,216,214,217,214,210,204,208,235,239,244,242,245,252,5,239,219,238,238,237,239,238,249,252,239,235,235,246,240,235,246,234,231,231,244,236,232,221,238,255,238,230,217,232,204,208,225,244,251,235,236,248,250,227,223,245,11,12,3,246,250,232,232,223,221,231,230,234,237,226,213,222,223,225,240,232,221,242,247,242,232,239,233,2,14,2,11,31,34,38,29,241,246,13,10,10,9,5,254,6,1,241,254,5,251,1,255,4,9,1,8,16,9,3,8,10,28,38,29,10,254,3,1,235,228,252,11,254,237,234,236,238,232,229,229,236,0,0,1,254,7,17,20,2,243,5,0,255,255,250,6,7,252,248,245,250,249,243,248,244,238,233,246,238,236,231,239,253,243,240,224,228,209,213,225,244,251,236,242,245,243,222,215,240,254,254,252,243,243,226,230,222,221,233,231,237,234,223,210,216,219,221,232,224,214,230,239,238,230,231,212,192,237,247,250,244,252,11,2,7,12,239,233,242,229,231,10,252,233,237,255,0,252,254,254,252,252,7,2,236,229,236,247,236,245,255,249,234,239,246,244,243,253,247,237,238,237,234,223,219,204,206,217,218,227,220,208,221,223,231,232,219,217,225,234,229,226,229,224,250,248,235,238,231,215,230,223,219,208,228,241,233,242,255,5,3,248,248,232,230,210,206,238,239,244,0,8,6,7,0,246,236,227,227,226,223,232,237,236,234,237,243,240,247,4,248,227,240,241,233,241,239,245,7,6,243,249,5,212,193,240,251,6,254,3,14,3,12,18,246,236,243,232,234,14,3,245,2,25,25,8,8,7,2,6,19,11,241,231,242,248,232,240,254,254,245,248,252,251,244,251,252,247,247,248,245,235,235,223,231,241,237,237,231,218,231,236,247,240,230,233,241,240,235,226,232,228,248,244,235,240,236,227,243,236,231,221,231,239,235,234,250,0,0,249,255,232,224,220,207,231,234,245,249,255,255,3,251,239,231,224,218,214,223,232,235,235,234,234,241,236,246,2,241,226,231,235,231,241,238,242,246,255,243,243,248,213,202,254,5,13,3,5,11,1,12,22,254,240,245,236,240,22,9,2,19,43,44,15,11,19,16,27,39,26,254,245,2,8,246,252,11,16,15,19,19,13,250,254,5,11,14,16,12,4,7,251,4,17,13,7,8,248,255,3,17,5,254,8,15,3,252,245,255,248,4,1,248,252,253,255,12,6,253,241,247,253,253,246,0,5,10,0,6,239,232,230,212,234,239,253,253,2,5,10,0,240,228,221,209,208,227,234,238,239,239,235,243,238,247,0,239,227,225,231,230,237,236,237,222,236,232,236,240,215,212,4,3,11,2,1,5,0,12,24,4,247,253,242,244,26,16,11,29,50,49,13,5,25,30,41,50,38,8,253,13,22,6,13,25,31,32,37,36,23,252,2,13,22,22,24,29,23,25,7,14,30,30,26,29,10,11,14,28,17,15,22,32,18,7,1,16,9,15,14,5,9,14,13,24,19,11,255,2,10,10,2,8,8,22,5,5,243,244,231,214,240,245,2,4,11,14,15,5,243,229,221,203,206,227,232,236,239,240,233,240,237,244,249,235,226,223,231,224,228,227,225,204,215,216,224,229,220,215,2,254,3,248,251,4,1,9,20,255,244,245,235,243,16,6,8,23,44,41,7,253,9,15,28,41,32,5,248,7,16,1,6,13,15,18,29,26,16,245,250,0,1,0,251,254,247,249,235,238,0,2,252,1,243,240,241,252,249,249,254,4,253,244,238,0,248,253,0,247,255,8,1,7,5,2,254,0,5,2,254,2,0,15,254,247,234,242,220,207,234,236,247,252,3,12,12,254,237,229,220,204,207,222,227,228,231,228,223,227,226,234,242,234,223,226,230,219,220,220,217,205,209,207,218,230,253,18,5,3,9,36,26,18,17,12,3,2,11,15,255,3,15,3,241,233,229,235,236,230,223,229,241,251,239,226,227,238,250,247,238,241,250,248,241,231,213,218,221,227,226,237,240,239,227,232,243,252,4,1,7,252,241,242,248,250,3,11,8,249,4,249,240,248,255,2,3,244,241,244,241,240,242,246,247,251,248,250,251,8,254,242,244,238,254,236,226,212,226,236,230,233,226,230,228,238,245,221,219,232,213,210,212,215,226,223,229,242,237,230,234,243,234,233,230,236,243,253,246,231,251,2,237,208,6,21,4,255,8,32,26,11,9,6,254,3,9,10,0,4,9,0,252,246,244,254,248,242,229,229,240,243,229,220,230,239,242,239,230,234,248,255,246,239,224,