{"irVersion":9,"opsetImport":[{"version":19}],"graph":{"name":"Graph","initializer":[{"name":"functional_1/dense_9/BiasAdd/ReadVariableOp/resource","dataType":1,"dims":[640],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[207,179,166,191,255,68,19,191,209,179,169,190,6,225,75,60,5,65,18,188,188,82,27,62,91,32,92,190,81,208,37,189,69,34,117,57,102,176,41,61,69,110,253,189,180,79,74,190,48,34,39,190,216,109,166,188,106,159,147,190,236,226,117,190,235,115,150,190,31,34,3,190,185,71,76,190,194,174,149,190,196,157,173,190,216,93,169,190,174,198,145,190,129,222,160,190,150,248,224,190,210,62,218,190,27,19,37,191,140,153,177,190,223,106,174,190,36,239,198,190,89,31,179,190,87,103,136,190,30,233,171,190,48,223,190,190,83,54,214,190,253,63,157,190,163,253,162,190,170,18,197,190,213,105,244,190,118,230,173,190,223,214,253,190,38,155,190,190,57,236,214,190,237,40,1,191,194,242,14,191,101,201,186,190,62,59,170,190,64,177,217,190,92,47,3,191,235,145,253,190,123,210,209,190,221,188,170,190,112,83,180,190,107,65,190,190,36,11,196,190,238,16,247,190,52,173,222,190,153,92,255,190,19,138,1,191,181,93,8,191,241,154,22,191,98,13,237,190,158,147,5,191,208,217,20,191,64,245,0,191,37,188,253,190,190,128,18,191,171,39,60,191,52,44,45,191,175,68,25,191,177,150,30,191,81,138,10,191,40,71,16,191,200,44,18,191,218,193,10,191,112,179,27,191,110,18,16,191,137,206,17,191,214,25,19,191,64,104,27,191,19,193,20,191,172,203,32,191,57,139,50,191,126,217,83,191,162,190,79,191,235,114,118,191,57,43,87,191,92,99,79,191,24,17,67,191,110,86,90,191,36,102,30,191,194,79,66,191,8,145,70,191,236,100,89,191,243,113,55,191,104,87,45,191,77,95,87,191,65,134,93,191,121,135,92,191,88,147,72,191,106,198,60,191,197,42,72,191,97,189,108,191,1,239,92,191,213,27,115,191,111,72,116,191,179,146,95,191,118,174,135,191,99,131,153,191,81,230,138,191,138,129,95,191,215,216,124,191,161,254,133,191,156,182,144,191,184,170,113,191,238,234,113,191,163,142,114,191,93,232,119,191,211,202,148,191,217,145,139,191,208,58,133,191,26,73,102,191,173,144,127,191,27,248,76,191,166,149,55,191,14,28,79,191,222,167,160,191,51,84,9,192,169,162,156,191,120,163,5,191,39,174,162,190,107,206,136,59,186,56,71,189,101,57,5,62,176,172,82,190,128,187,203,189,225,73,105,189,162,216,163,59,103,147,29,190,168,89,107,190,48,98,61,190,108,235,41,189,65,5,167,190,24,241,146,190,63,191,180,190,180,154,66,190,237,220,93,190,168,41,133,190,59,53,169,190,19,95,176,190,8,252,157,190,144,47,173,190,224,217,230,190,38,197,222,190,58,225,34,191,56,242,168,190,7,27,183,190,201,71,206,190,255,232,168,190,190,15,141,190,85,210,156,190,66,57,190,190,81,17,237,190,115,223,183,190,99,203,180,190,151,254,195,190,181,7,243,190,241,98,160,190,64,11,237,190,76,123,189,190,224,122,219,190,61,185,250,190,143,163,1,191,252,178,171,190,70,210,177,190,65,165,229,190,64,138,0,191,103,141,0,191,237,133,236,190,153,129,203,190,182,130,202,190,32,10,208,190,39,90,193,190,207,210,229,190,206,100,233,190,55,228,3,191,253,232,4,191,229,203,20,191,60,40,36,191,63,125,255,190,136,80,14,191,160,220,22,191,110,59,3,191,13,13,0,191,0,245,22,191,9,196,67,191,140,197,43,191,166,27,33,191,61,165,44,191,88,98,14,191,153,133,23,191,140,0,24,191,37,170,17,191,197,44,22,191,193,196,11,191,154,201,25,191,242,231,29,191,193,152,29,191,78,34,18,191,38,64,22,191,24,207,38,191,161,1,75,191,239,114,67,191,38,222,109,191,118,91,76,191,157,61,56,191,127,60,57,191,83,74,83,191,63,22,28,191,236,234,53,191,120,253,62,191,178,73,78,191,58,92,45,191,4,82,37,191,9,249,74,191,12,124,78,191,26,32,75,191,51,253,58,191,207,8,55,191,141,6,58,191,42,76,97,191,91,23,86,191,95,202,104,191,68,177,105,191,105,236,66,191,13,112,106,191,83,187,135,191,2,4,118,191,51,45,54,191,142,69,84,191,92,29,111,191,143,238,127,191,252,216,82,191,220,165,89,191,33,155,93,191,205,117,105,191,255,156,141,191,25,137,135,191,200,189,120,191,199,58,85,191,31,209,112,191,131,213,60,191,190,238,41,191,3,184,58,191,185,161,152,191,89,244,2,192,114,41,150,191,94,215,249,190,205,13,153,190,101,40,167,60,67,2,141,189,249,224,27,62,38,117,44,190,31,206,23,190,198,129,213,189,71,84,12,59,151,68,4,190,12,89,111,190,7,62,95,190,131,123,146,189,4,155,189,190,99,196,154,190,147,167,200,190,185,38,86,190,118,69,59,190,3,20,74,190,79,114,165,190,215,68,174,190,224,100,156,190,201,180,143,190,180,159,219,190,42,202,230,190,158,209,24,191,174,66,144,190,137,37,176,190,197,31,192,190,225,175,158,190,147,41,137,190,20,156,159,190,36,136,184,190,152,134,240,190,223,240,167,190,120,34,161,190,173,140,181,190,205,63,236,190,235,190,140,190,230,207,230,190,142,201,191,190,159,206,208,190,120,75,234,190,46,63,251,190,37,83,176,190,93,1,180,190,44,172,239,190,178,131,247,190,55,109,244,190,222,41,246,190,43,152,213,190,76,92,202,190,65,111,200,190,193,227,189,190,106,81,229,190,197,147,236,190,169,57,2,191,251,50,6,191,91,140,18,191,54,146,40,191,232,226,2,191,190,146,13,191,60,147,25,191,157,243,0,191,160,218,0,191,219,247,27,191,131,105,59,191,182,139,44,191,110,151,33,191,215,80,43,191,24,1,12,191,251,161,22,191,153,155,19,191,165,8,17,191,147,76,19,191,115,63,13,191,22,51,13,191,87,244,17,191,233,155,20,191,238,180,18,191,39,157,16,191,144,152,33,191,161,217,68,191,207,88,68,191,31,179,119,191,169,28,83,191,63,104,53,191,68,49,51,191,68,179,72,191,0,13,30,191,41,211,53,191,25,117,66,191,41,197,90,191,102,100,53,191,185,52,38,191,178,75,83,191,28,19,81,191,251,151,79,191,124,191,69,191,66,99,68,191,69,174,56,191,174,240,106,191,167,59,99,191,17,204,115,191,250,27,115,191,248,194,76,191,196,143,113,191,28,157,141,191,76,80,128,191,137,81,50,191,168,185,83,191,15,188,114,191,232,36,126,191,138,182,79,191,193,136,89,191,199,64,102,191,19,253,117,191,115,151,148,191,148,133,141,191,230,146,125,191,47,233,97,191,39,226,121,191,191,191,68,191,43,216,48,191,79,140,68,191,30,75,157,191,105,197,3,192,146,83,152,191,27,12,253,190,14,163,146,190,142,244,134,60,87,184,32,189,220,198,39,62,67,213,31,190,184,108,75,190,181,153,62,190,170,177,81,189,32,91,57,190,183,116,122,190,61,129,71,190,186,19,91,189,100,5,187,190,139,234,160,190,92,155,204,190,178,111,90,190,194,107,27,190,217,113,78,190,193,146,175,190,84,169,168,190,122,27,134,190,252,47,111,190,91,90,187,190,2,158,225,190,157,237,22,191,10,127,134,190,239,75,153,190,98,97,184,190,142,198,143,190,129,227,97,190,77,249,166,190,77,251,184,190,76,157,236,190,171,87,157,190,101,191,153,190,175,70,176,190,253,248,228,190,18,30,158,190,65,122,230,190,175,195,180,190,119,152,184,190,14,96,219,190,150,44,249,190,88,130,172,190,240,171,177,190,173,8,234,190,119,190,247,190,4,6,3,191,199,210,238,190,250,0,211,190,52,28,198,190,43,92,212,190,154,228,187,190,240,236,230,190,172,241,230,190,237,217,245,190,9,227,4,191,93,250,25,191,121,173,33,191,242,68,252,190,135,38,8,191,8,8,30,191,207,106,5,191,26,206,6,191,63,70,29,191,12,231,49,191,145,198,43,191,17,19,28,191,212,60,32,191,133,242,8,191,254,159,17,191,138,78,6,191,57,37,5,191,78,37,16,191,45,115,8,191,227,5,6,191,198,254,9,191,98,215,9,191,167,149,32,191,224,95,21,191,31,187,36,191,82,127,69,191,33,191,66,191,89,169,126,191,195,154,85,191,134,91,60,191,122,42,53,191,157,223,62,191,175,45,32,191,144,122,57,191,64,95,65,191,9,73,92,191,152,192,52,191,20,206,38,191,226,107,87,191,139,49,81,191,71,164,82,191,88,94,70,191,37,153,70,191,13,92,52,191,209,0,107,191,73,55,103,191,87,61,119,191,37,5,115,191,54,166,79,191,221,67,124,191,151,182,147,191,72,83,139,191,168,96,59,191,17,23,91,191,48,184,122,191,22,122,131,191,239,42,80,191,178,152,88,191,229,9,101,191,138,86,116,191,126,191,154,191,119,127,142,191,120,110,120,191,14,13,95,191,88,67,119,191,69,98,44,191,203,253,26,191,56,208,59,191,31,175,151,191,137,110,0,192,213,87,160,191,94,116,17,191,56,59,174,190,80,97,180,60,244,107,141,60,143,104,65,62,189,143,247,189,247,116,44,190,21,183,74,190,116,69,120,189,125,136,33,190,227,230,107,190,204,81,38,190,169,119,142,188,51,251,172,190,20,237,152,190,170,75,190,190,208,0,82,190,124,81,43,190,137,148,91,190,184,43,186,190,238,242,172,190,5,73,116,190,189,183,77,190,161,85,166,190,159,224,213,190,179,85,24,191,41,107,164,190,60,130,148,190,136,83,173,190,173,71,142,190,221,217,129,190,87,5,198,190,218,80,197,190,201,195,240,190,245,239,172,190,242,223,159,190,211,238,172,190,165,158,225,190,99,102,167,190,202,128,241,190,217,84,175,190,252,87,180,190,249,52,205,190,95,109,255,190,50,216,165,190,35,206,174,190,68,255,237,190,82,36,246,190,161,43,6,191,203,228,222,190,53,185,194,190,240,232,206,190,241,6,230,190,210,13,189,190,112,139,231,190,152,151,223,190,217,55,219,190,127,9,245,190,26,235,23,191,160,247,40,191,255,130,3,191,12,44,13,191,166,41,27,191,143,10,8,191,180,193,15,191,191,241,18,191,42,247,41,191,37,112,38,191,212,133,31,191,67,60,35,191,98,107,0,191,77,126,9,191,190,99,2,191,199,218,4,191,95,74,17,191,101,65,10,191,255,144,2,191,155,168,8,191,139,172,13,191,80,176,48,191,112,112,35,191,210,79,47,191,130,245,77,191,81,139,69,191,124,230,130,191,90,152,87,191,249,106,52,191,146,167,48,191,89,233,68,191,233,235,43,191,75,164,60,191,17,224,72,191,29,53,93,191,254,69,55,191,145,166,56,191,82,229,99,191,34,229,84,191,120,51,87,191,249,22,74,191,212,56,72,191,228,8,55,191,37,231,106,191,251,78,109,191,109,170,118,191,216,238,122,191,26,123,90,191,113,131,131,191,174,194,159,191,62,28,148,191,53,126,85,191,161,127,115,191,196,242,134,191,157,122,142,191,112,1,97,191,28,35,104,191,160,243,121,191,239,191,130,191,235,31,162,191,54,241,153,191,183,200,130,191,150,170,105,191,219,78,131,191,117,154,48,191,42,100,34,191,15,163,75,191,245,115,162,191,10,251,6,192]}},{"name":"functional_1/dense_8/BiasAdd/ReadVariableOp/resource","dataType":1,"dims":[128],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[32,201,199,188,54,135,4,64,48,91,40,64,172,77,55,64,2,59,227,62,135,246,217,63,216,158,211,62,126,224,63,63,108,30,98,63,222,30,211,63,228,199,17,62,143,191,70,63,195,250,167,63,135,70,24,64,232,163,180,63,30,221,132,63,231,161,79,64,147,219,139,63,203,115,35,63,38,33,218,63,132,185,46,64,214,1,254,63,153,39,167,63,170,160,2,190,94,99,217,62,74,195,127,63,192,193,211,190,74,105,228,62,112,185,232,63,211,35,9,64,154,38,170,63,148,159,194,63,112,113,216,63,227,173,238,62,76,249,79,63,33,41,1,63,26,211,135,63,16,101,230,63,152,242,46,63,85,182,61,63,108,158,63,63,23,42,170,62,239,131,73,63,152,3,254,63,17,15,250,62,24,18,138,63,6,146,132,62,70,145,217,62,217,214,12,64,148,203,64,63,242,170,96,63,10,129,24,191,210,219,66,63,41,226,206,63,44,205,134,63,198,182,172,63,36,235,10,63,122,137,154,63,198,235,207,63,65,103,210,63,227,166,146,63,36,174,8,64,223,238,17,64,82,3,182,63,88,65,111,63,184,39,236,190,208,123,159,60,226,144,245,63,83,59,174,62,40,187,141,63,96,0,108,63,160,176,31,61,145,195,6,64,202,162,86,63,228,26,211,63,159,101,128,63,24,8,149,63,70,3,142,63,196,206,1,191,120,148,175,63,123,152,65,63,104,233,47,64,133,104,80,63,91,253,61,63,48,156,2,64,154,141,63,63,178,20,215,63,222,95,92,63,54,177,172,62,214,216,220,63,52,120,132,62,159,26,12,64,42,251,4,63,8,242,2,64,160,241,16,64,43,38,207,62,227,217,140,63,226,57,105,63,16,17,255,63,29,49,146,63,195,108,16,64,140,59,255,63,94,120,144,63,175,68,66,63,171,68,62,63,29,67,171,63,94,175,231,63,212,181,134,63,2,12,40,64,216,167,145,63,14,149,26,63,22,189,201,63,48,118,252,189,181,163,169,62,32,179,210,62,6,109,83,63,234,173,143,63,252,238,41,63,203,97,34,63,216,23,219,190,230,62,190,63,4,160,123,63,34,202,52,63,240,20,49,63,8,99,79,63,56,80,71,63,125,30,167,63,99,5,208,63]}},{"name":"functional_1/dense_7/BiasAdd/ReadVariableOp/resource","dataType":1,"dims":[128],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[176,46,136,61,0,216,16,63,170,90,186,190,167,62,4,62,118,247,131,190,112,141,59,61,191,58,122,190,16,165,192,62,174,168,87,62,40,80,27,191,113,62,49,63,76,9,146,63,218,190,3,64,12,43,125,62,128,204,67,62,10,231,186,63,48,234,3,61,252,43,232,188,120,212,119,61,231,189,106,190,198,126,137,62,54,6,61,63,37,11,218,190,139,8,54,63,24,239,32,61,101,202,197,62,108,148,96,63,101,74,205,190,121,212,129,191,225,211,234,62,100,151,19,189,236,48,155,62,16,247,102,62,215,33,150,191,85,81,121,191,160,194,95,189,52,11,222,190,176,238,25,63,179,35,6,62,13,134,80,190,179,227,162,63,236,12,32,62,53,22,186,63,150,200,230,61,222,62,98,62,83,223,152,190,144,56,220,62,182,73,184,62,49,133,68,63,199,32,113,63,146,226,241,190,252,183,59,62,221,78,6,63,181,30,9,191,50,168,223,62,225,172,2,63,217,45,113,191,170,238,134,191,168,126,231,62,74,238,31,63,24,215,196,60,220,216,26,63,238,119,141,63,130,136,136,63,48,104,73,190,143,207,135,63,146,81,73,190,207,44,51,191,74,247,1,63,76,93,42,190,181,92,201,190,222,217,139,191,221,171,63,191,128,161,37,63,7,159,192,190,190,41,115,191,92,194,206,62,104,9,7,63,7,31,23,191,4,112,58,189,187,137,172,63,192,225,21,63,246,17,31,64,65,196,158,191,55,32,167,63,164,119,93,63,150,2,170,189,128,68,5,191,204,250,59,191,21,91,35,62,245,15,187,61,128,11,160,187,68,29,7,192,42,246,22,190,220,19,252,61,96,234,194,60,200,102,120,190,200,205,243,61,66,218,241,188,21,1,191,62,92,166,13,63,138,2,60,190,147,87,158,63,86,183,164,63,186,254,110,190,36,231,147,62,56,189,129,62,2,176,52,63,170,187,221,189,108,139,83,63,216,165,187,62,169,33,135,63,184,20,56,63,125,55,148,62,184,235,129,189,237,71,98,62,26,28,78,191,236,138,134,63,64,43,181,58,55,239,28,190,221,105,162,190,31,244,18,64,206,174,21,190,71,39,193,62,162,217,203,63,53,176,152,62,97,51,231,191,225,0,25,191]}},{"name":"functional_1/dense_6/BiasAdd/ReadVariableOp/resource","dataType":1,"dims":[128],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[93,114,13,191,208,107,59,189,119,110,102,63,186,164,160,191,250,138,2,62,192,158,1,63,211,229,7,63,245,144,203,62,228,187,29,63,224,198,0,63,207,245,253,62,15,64,110,190,21,180,21,191,56,147,62,63,192,56,222,62,78,79,7,63,175,121,17,63,191,3,247,190,160,62,83,191,248,85,219,62,64,154,222,59,87,128,58,63,84,247,89,62,230,154,26,63,50,3,142,190,144,199,124,61,176,85,68,190,18,140,188,62,164,110,222,61,20,45,138,191,0,143,213,189,108,68,90,63,198,24,62,191,147,61,155,191,232,76,28,63,43,128,45,61,255,255,166,63,111,181,105,63,192,252,7,63,34,30,59,62,143,228,94,190,210,109,98,63,208,31,3,63,204,156,239,62,164,157,21,64,15,174,80,190,123,87,72,63,63,117,167,191,145,141,148,190,32,78,169,63,73,198,76,62,188,183,5,63,180,33,105,63,132,255,116,189,106,239,61,190,134,104,47,191,10,235,172,61,183,123,133,63,22,108,8,191,200,98,18,189,219,156,209,63,160,124,144,63,42,189,41,191,158,86,211,62,192,76,35,190,115,62,89,190,60,48,53,63,224,1,179,189,87,196,130,62,190,253,187,63,174,196,113,191,234,149,160,190,90,43,94,191,33,23,91,190,16,119,137,63,137,185,130,62,114,188,161,63,238,127,214,189,235,195,25,62,156,225,115,191,64,205,84,62,255,144,42,63,188,175,17,61,65,1,130,62,164,56,216,62,6,172,161,188,21,114,33,191,78,91,58,191,121,117,206,61,178,176,22,63,144,65,95,62,93,94,49,62,206,5,181,191,206,130,182,190,214,144,182,63,32,44,255,61,188,250,69,62,90,109,232,190,230,74,74,63,172,139,59,63,62,138,216,190,194,120,189,62,248,108,17,190,220,14,121,191,179,166,157,63,224,11,246,191,100,15,253,189,56,198,71,191,22,77,89,191,170,89,20,190,178,176,191,190,208,234,6,63,0,14,138,63,152,149,48,63,172,3,22,191,110,76,123,62,197,59,130,63,206,191,46,191,9,151,110,61,250,86,116,63,89,165,206,190,78,192,125,190,22,252,192,63,114,129,207,62,215,72,101,63,19,69,18,63,87,80,242,62,58,132,154,63]}},{"name":"functional_1/dense_5/BiasAdd/ReadVariableOp/resource","dataType":1,"dims":[128],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[248,17,41,64,225,222,153,63,196,214,189,192,217,46,141,191,58,224,130,64,23,90,224,191,188,181,182,64,155,11,11,63,38,200,102,64,85,173,241,189,210,220,149,192,88,60,10,192,183,105,48,192,89,172,133,190,80,86,189,63,234,157,162,191,239,73,18,64,253,137,225,62,199,140,6,64,20,138,210,62,112,113,0,192,38,40,135,63,203,95,70,192,58,46,134,64,146,144,72,64,27,130,217,62,217,70,5,193,220,210,102,63,239,39,132,64,210,227,11,190,70,48,26,64,248,168,13,65,67,133,140,64,168,236,7,192,178,243,130,63,144,40,126,64,197,4,157,64,105,198,158,192,126,197,48,64,194,194,160,191,133,153,21,64,85,43,7,192,49,45,208,63,144,129,248,62,91,96,167,190,42,93,43,64,115,85,37,64,136,19,216,190,90,171,66,192,175,41,33,64,142,225,10,192,75,187,234,191,182,62,113,191,171,110,154,62,65,15,204,63,111,99,189,192,100,109,202,192,23,243,233,191,10,166,30,191,50,90,171,63,122,183,67,192,90,166,152,192,94,236,175,191,66,145,213,63,139,159,152,64,134,192,89,64,204,231,46,191,78,221,14,192,24,17,33,64,0,47,226,191,110,148,202,64,41,11,156,192,108,84,30,192,102,186,72,192,195,165,149,64,195,197,73,192,58,9,144,64,133,123,181,192,5,183,189,192,119,119,70,63,140,16,2,192,232,125,231,62,117,49,116,64,134,107,94,64,234,35,130,64,238,209,187,64,72,203,222,190,47,1,31,192,81,105,27,192,233,106,159,191,101,18,35,191,105,49,241,62,39,8,58,192,169,14,222,64,149,30,83,63,163,244,53,64,41,6,196,64,28,80,15,191,0,28,65,58,48,42,198,63,238,127,112,64,63,160,145,192,114,233,89,192,10,10,164,192,140,73,156,63,142,240,147,63,198,88,50,64,163,47,140,62,32,90,98,63,58,190,111,192,236,143,16,63,135,159,151,64,146,50,87,192,115,12,73,63,1,119,197,191,77,29,218,190,120,129,55,64,56,232,74,64,92,210,162,64,147,167,69,63,128,240,121,190,219,243,97,64,118,79,20,191,130,25,87,191,40,210,151,192,2,231,105,192,146,207,53,64,40,102,170,64]}},{"name":"functional_1/dense_4/BiasAdd/ReadVariableOp/resource","dataType":1,"dims":[8],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[29,248,9,64,178,53,31,64,109,110,26,64,181,166,26,64,79,178,251,63,195,227,14,64,120,172,46,64,3,255,0,64]}},{"name":"functional_1/dense_3/BiasAdd/ReadVariableOp/resource","dataType":1,"dims":[128],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[26,170,133,62,194,80,62,189,38,200,122,191,242,199,222,61,48,156,2,189,62,52,197,62,216,4,44,190,4,3,113,192,64,209,199,60,163,114,38,192,139,236,12,192,185,124,14,62,24,187,131,61,232,98,70,188,90,173,116,62,105,88,67,62,100,84,91,189,195,67,34,191,4,197,15,61,244,88,115,192,209,194,173,190,140,212,247,61,182,66,220,189,28,155,117,61,195,121,31,62,1,22,149,190,47,231,38,62,30,120,148,62,132,124,137,61,20,84,129,62,36,207,239,189,142,230,19,190,28,217,13,192,168,107,162,190,112,239,235,60,243,168,36,190,154,180,113,62,172,41,185,188,80,197,106,188,48,125,254,61,94,108,204,63,186,121,76,63,234,55,54,62,60,212,196,62,92,148,235,60,58,97,247,189,156,166,25,189,0,65,55,188,144,157,151,188,76,4,86,190,217,236,123,190,0,75,250,61,180,79,167,62,100,11,37,191,192,141,157,61,52,250,0,191,100,109,227,189,168,144,41,191,239,40,151,61,221,142,3,63,213,3,147,191,114,191,216,190,248,46,187,189,224,113,233,186,253,182,169,190,230,220,29,63,98,120,160,62,126,168,173,190,137,9,93,62,160,179,108,62,17,73,161,62,14,167,167,62,64,147,153,189,48,37,82,61,156,165,59,61,156,230,74,62,54,240,245,62,88,170,212,190,205,117,175,190,150,16,8,61,60,160,11,63,254,140,222,61,37,157,149,61,84,1,169,62,38,19,93,190,160,114,34,61,82,158,155,62,199,140,68,62,128,142,142,61,106,169,138,62,160,181,255,190,16,209,179,60,44,145,183,189,112,30,73,190,112,75,229,191,108,10,186,61,85,189,223,62,123,210,93,192,133,52,219,62,140,54,93,190,180,5,162,189,163,238,201,62,41,140,145,190,224,133,193,60,96,191,196,190,200,119,136,188,182,110,220,62,248,121,107,62,100,90,35,61,80,33,29,62,36,84,135,62,143,147,165,190,120,133,97,190,209,221,123,191,6,5,225,190,61,143,188,63,82,125,154,190,24,57,216,62,231,137,237,189,23,23,207,61,203,3,165,189,139,57,13,192,128,188,70,62,228,116,64,192,144,41,22,60,63,36,231,61,92,18,185,190,41,164,29,190]}},{"name":"functional_1/dense_2/BiasAdd/ReadVariableOp/resource","dataType":1,"dims":[128],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[68,128,126,63,232,33,2,63,117,35,45,190,130,16,146,63,42,42,184,190,237,238,8,62,246,109,160,62,167,174,157,190,47,192,18,62,0,254,254,59,136,19,36,189,192,122,115,190,113,197,18,189,216,148,106,190,206,116,252,62,149,10,22,61,10,249,143,62,196,20,37,63,8,180,177,61,122,241,88,62,13,210,252,191,23,175,133,61,172,3,86,62,72,61,79,189,228,20,220,62,16,179,245,188,211,6,31,190,148,172,94,61,116,90,8,192,232,165,142,61,168,247,132,62,176,208,224,189,64,163,124,62,61,95,46,62,19,190,53,190,123,58,166,62,234,55,8,191,110,191,144,61,16,117,234,61,208,106,37,189,111,70,136,63,74,156,5,62,11,229,92,191,82,58,18,61,211,100,13,190,220,203,6,62,118,8,46,190,125,9,5,63,172,132,18,62,238,43,187,62,74,231,171,62,88,202,252,60,48,211,46,62,89,8,242,62,56,39,11,62,135,165,42,189,208,253,7,191,149,178,11,191,76,231,0,190,160,69,45,187,239,206,136,191,120,10,105,61,72,27,65,190,207,127,8,190,53,53,246,189,216,31,241,61,156,55,50,62,124,90,104,62,76,175,161,62,119,84,235,190,148,150,253,61,249,58,10,63,207,69,133,190,96,227,171,188,238,159,164,189,184,66,103,61,244,63,249,61,49,99,0,63,63,114,22,190,200,123,124,62,140,125,18,61,253,254,219,189,12,13,135,190,155,183,23,62,66,234,41,62,238,209,178,61,96,187,33,60,207,219,217,61,156,26,22,189,210,55,12,63,157,148,6,63,207,227,34,62,130,83,134,190,128,214,13,189,216,254,33,190,80,92,245,61,254,11,99,190,238,240,31,190,233,182,171,62,254,57,184,190,152,191,188,189,202,240,47,62,0,48,75,56,192,60,154,189,160,220,138,62,173,70,136,61,92,108,35,189,100,252,52,62,0,250,92,188,240,103,89,61,217,232,4,62,208,249,1,190,89,21,18,63,144,52,109,61,146,57,67,190,68,152,195,62,48,96,40,62,92,101,145,62,216,183,78,189,125,188,233,188,192,170,113,189,27,104,22,62,145,125,36,62,81,220,157,190,152,9,188,62,224,198,222,60,84,133,142,63,160,62,228,59]}},{"name":"functional_1/dense_1/BiasAdd/ReadVariableOp/resource","dataType":1,"dims":[128],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[221,6,224,63,80,42,202,187,20,105,151,188,62,56,226,189,85,75,46,191,37,56,4,192,2,231,195,62,52,53,244,188,40,250,119,60,102,186,207,61,36,114,177,189,232,177,19,190,122,64,149,62,96,212,197,189,246,66,54,62,87,20,102,62,218,252,89,62,168,112,209,61,101,31,175,62,97,200,47,62,44,118,164,62,70,248,152,62,72,31,35,190,215,213,54,189,78,62,22,63,112,5,47,191,96,211,26,187,96,105,89,190,163,104,92,63,118,243,229,190,221,201,32,62,96,65,252,188,223,255,64,61,82,229,112,191,190,255,67,62,168,98,163,62,107,35,26,62,190,151,16,190,232,56,127,190,130,92,206,61,238,9,70,190,237,222,151,61,84,172,225,61,192,13,83,188,220,155,155,191,3,129,37,62,90,62,14,63,117,194,137,191,100,177,165,189,210,28,206,189,92,194,130,190,178,3,26,190,224,234,103,190,45,234,165,63,24,45,232,61,92,174,178,191,76,109,224,60,124,194,28,63,160,42,175,61,20,15,11,190,208,124,13,190,220,27,0,191,80,209,30,63,178,209,167,189,54,119,209,62,115,66,186,62,210,163,156,62,94,180,212,189,168,63,57,62,183,12,97,190,27,232,19,62,6,215,82,62,180,145,224,189,159,70,243,189,47,67,130,63,48,48,83,62,6,160,206,62,60,6,137,61,149,79,69,190,179,139,158,191,182,245,63,61,181,113,18,190,246,82,163,62,7,4,90,190,241,208,20,192,130,243,115,190,239,241,206,190,112,214,215,61,131,24,181,62,51,26,141,190,173,40,158,190,102,137,8,191,153,238,189,190,80,6,216,189,240,169,19,62,166,235,53,190,209,110,190,62,190,203,159,190,31,244,17,191,218,80,191,61,184,194,153,60,68,18,179,189,64,62,196,60,9,250,187,189,115,52,47,190,176,159,212,61,176,92,191,60,171,107,156,191,8,32,238,61,24,137,228,188,102,180,174,63,212,249,180,61,185,182,238,62,116,142,116,190,126,202,149,189,128,152,131,59,67,183,71,63,244,106,176,62,211,212,238,62,20,246,85,190,64,106,169,62,168,125,101,62,220,210,161,62,104,193,132,60,119,67,101,62,172,24,209,188,209,19,211,62,122,238,172,191]}},{"name":"functional_1/dense/BiasAdd/ReadVariableOp/resource","dataType":1,"dims":[128],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[60,15,232,63,40,50,172,191,125,115,86,193,52,60,181,192,220,32,139,62,238,132,218,192,71,255,158,191,111,6,104,65,95,70,6,192,134,122,153,62,242,107,29,63,116,75,253,190,125,61,223,192,188,212,199,61,223,217,145,61,120,23,10,64,5,123,176,64,220,98,66,64,21,202,176,63,242,24,17,192,137,80,165,193,26,232,225,190,44,210,172,64,119,150,50,64,18,77,164,64,181,51,89,65,62,152,213,192,218,122,150,64,13,103,141,191,181,148,42,192,185,217,0,192,118,237,140,191,177,82,1,192,85,181,196,192,89,103,20,64,253,172,177,191,38,195,138,64,201,213,75,64,46,81,215,191,56,84,152,192,108,115,153,64,0,197,129,62,124,164,137,191,242,226,59,63,16,9,22,190,232,246,0,189,242,134,159,192,236,37,166,63,78,167,72,65,201,236,79,192,221,253,91,192,58,32,245,191,126,14,67,192,176,109,116,192,61,236,119,192,177,101,22,193,58,82,20,192,70,64,190,191,92,222,169,192,75,96,133,191,224,180,238,61,243,196,44,64,189,77,91,192,57,157,17,193,195,162,34,193,89,128,6,64,62,75,41,191,192,196,160,63,170,234,57,192,109,182,239,191,14,232,53,191,80,181,157,64,10,55,133,64,133,41,210,64,72,248,214,64,202,10,105,64,211,217,204,191,35,101,218,190,213,193,39,193,78,192,76,64,124,190,193,190,178,138,186,63,106,185,27,192,220,240,142,63,169,255,177,64,184,102,184,64,157,167,191,64,68,32,25,63,80,161,206,62,148,91,57,64,206,126,22,65,108,184,139,190,247,190,36,65,191,86,99,193,159,147,187,64,202,104,102,63,140,235,175,191,180,79,99,192,158,28,4,193,83,179,50,64,114,157,60,64,123,77,87,65,196,137,67,64,252,219,29,64,3,196,49,64,11,203,142,64,26,244,133,193,29,237,243,63,130,234,236,64,207,24,132,192,126,20,184,62,150,189,56,192,180,234,53,63,58,85,190,191,78,208,36,191,196,22,204,191,230,62,156,192,238,35,163,190,109,154,130,64,227,17,136,64,238,249,0,191,17,17,147,190,103,52,116,64,0,22,180,187,253,12,80,63,164,120,216,64,60,53,232,192,215,49,7,65]}},{"name":"const_fold_opt__62","dataType":1,"dims":[128,8],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[77,107,228,60,125,88,49,60,161,176,191,188,118,155,110,62,212,26,2,62,160,144,203,189,156,21,54,189,47,66,144,61,109,56,76,189,95,42,43,62,60,119,140,189,53,206,216,187,111,144,88,188,212,15,190,59,2,133,212,187,150,90,46,60,29,246,115,188,44,226,245,188,237,11,163,60,11,85,182,188,156,111,40,188,163,18,12,187,89,185,79,189,128,135,112,60,6,163,45,188,49,253,196,59,119,79,205,60,84,232,243,188,110,128,242,59,28,7,189,60,22,41,73,190,12,137,213,56,155,188,187,188,234,131,197,62,67,209,185,189,108,157,157,188,237,81,32,187,128,109,138,60,97,177,226,59,7,220,117,60,24,136,172,189,157,213,108,61,52,45,133,62,209,203,69,62,247,105,179,59,100,127,239,189,1,152,131,187,57,108,21,60,162,171,167,62,132,79,30,188,10,60,31,190,212,12,244,188,246,180,44,62,36,94,94,62,196,133,53,60,152,74,208,188,147,242,68,189,202,121,26,190,53,187,170,189,124,175,200,59,243,64,134,189,42,188,219,188,6,80,38,189,208,166,29,188,186,68,48,60,68,24,2,189,99,41,181,189,146,121,233,189,28,181,29,189,234,227,195,187,106,122,78,60,46,176,144,189,137,18,136,189,85,81,239,189,57,148,229,187,136,153,150,188,37,193,160,189,219,2,21,188,120,54,142,187,49,77,19,187,154,195,12,189,40,133,157,60,8,112,203,61,110,209,161,189,177,66,158,61,79,60,53,61,76,51,118,60,32,70,109,189,87,60,240,60,36,92,47,60,158,126,141,188,56,199,82,61,224,118,15,60,237,6,27,189,74,5,68,189,220,9,53,188,118,123,4,57,122,182,66,60,251,151,95,189,118,210,53,188,42,82,220,60,11,174,39,190,119,61,166,188,79,231,128,187,194,220,112,60,76,190,31,60,29,7,16,60,179,85,23,61,213,57,189,188,134,126,55,61,45,246,254,61,81,190,187,59,13,175,174,61,132,107,176,188,96,228,173,189,8,51,131,187,120,41,209,60,103,126,184,61,100,63,93,187,48,54,92,58,128,141,158,189,4,204,207,60,32,140,9,62,13,254,191,60,204,164,20,189,95,237,249,189,207,183,111,188,106,130,89,59,78,228,167,189,233,217,12,61,231,33,9,61,247,252,170,188,4,155,6,190,72,241,44,190,151,77,53,59,43,54,4,62,34,167,209,58,87,50,134,187,221,199,32,60,72,188,18,189,118,100,252,188,101,122,54,60,83,68,230,189,72,12,225,188,165,107,152,60,245,105,147,60,98,37,251,61,40,98,67,60,87,164,35,61,139,230,99,62,247,207,57,188,243,203,151,184,54,84,31,190,242,254,177,189,113,54,223,189,177,28,225,188,174,4,131,60,108,104,42,189,71,7,0,188,144,213,108,60,198,123,149,61,250,226,14,189,166,197,20,190,0,192,228,189,219,93,190,188,187,163,44,60,143,36,108,188,218,250,86,188,91,29,18,188,248,241,63,190,229,172,117,61,188,187,181,185,150,130,188,59,124,16,165,188,114,2,166,187,148,108,88,188,79,247,39,189,34,209,248,59,147,253,21,61,161,69,184,189,89,143,52,62,21,143,119,61,247,241,155,59,209,52,19,61,194,36,148,61,96,10,0,61,208,221,6,61,166,245,223,59,181,93,132,189,145,213,70,61,117,47,26,188,126,79,6,189,12,4,183,60,175,170,9,61,56,58,230,61,187,131,184,189,222,9,210,187,49,231,144,61,120,136,5,60,255,70,124,187,218,114,179,185,214,228,66,188,118,32,149,60,116,41,154,60,181,41,192,188,180,73,10,62,156,120,123,60,113,50,44,61,63,202,126,61,105,96,13,189,77,223,229,189,24,201,225,60,142,84,122,189,28,0,241,189,21,77,13,189,90,180,25,190,80,185,177,189,41,242,156,60,159,143,134,60,107,170,6,188,178,45,56,62,23,52,100,60,201,219,119,188,125,224,38,191,226,177,36,61,149,216,107,58,226,1,122,186,50,181,247,189,9,217,150,188,164,30,222,187,99,193,165,58,195,28,18,188,198,229,156,61,27,27,143,188,200,72,204,61,0,65,217,188,221,179,230,188,90,46,247,188,237,226,107,188,177,214,168,188,238,219,1,188,83,143,27,187,44,128,63,189,230,63,2,188,145,146,191,58,120,41,67,189,108,254,241,189,224,130,166,60,20,222,233,59,74,166,238,189,194,67,142,61,105,137,178,61,83,77,60,60,143,224,213,60,137,239,23,60,200,51,83,61,152,147,242,59,130,125,86,59,213,39,95,60,171,89,152,189,149,202,28,60,128,50,223,187,76,216,162,58,7,244,70,60,66,180,239,190,31,225,23,61,120,14,105,62,244,129,153,60,15,221,33,190,35,47,181,190,110,34,76,186,53,222,166,188,51,40,37,190,217,154,153,189,220,112,142,61,251,173,128,58,133,33,70,62,94,121,205,60,164,99,43,187,106,49,151,189,204,125,139,189,170,223,167,185,115,53,254,60,53,112,96,61,100,155,11,190,175,154,134,61,139,101,71,60,88,205,242,60,167,4,71,59,254,199,183,187,95,96,120,189,236,6,132,62,104,210,191,60,117,58,67,60,166,151,28,187,108,17,121,60,207,166,208,188,135,5,165,186,215,88,39,61,115,152,249,60,117,187,91,61,236,251,171,61,231,41,16,61,244,39,109,188,162,164,100,189,187,86,93,185,146,228,159,61,176,215,223,61,202,89,86,61,1,81,152,61,172,43,240,187,206,247,207,189,62,136,51,190,51,196,205,189,32,186,186,188,4,77,19,59,243,63,171,60,208,180,203,60,198,84,178,60,220,96,164,62,60,86,116,60,13,73,175,59,236,59,8,61,117,111,115,188,22,100,86,188,150,145,178,188,243,235,187,189,73,137,235,187,13,120,241,189,5,249,90,187,116,153,235,186,137,232,248,188,178,244,139,62,164,91,3,60,187,82,128,188,64,63,6,190,144,129,95,189,59,149,234,60,37,14,150,61,102,180,185,60,52,187,184,60,62,210,244,61,149,110,112,59,111,96,118,61,158,156,69,61,102,35,72,184,237,178,114,187,198,221,76,62,109,125,97,62,9,22,129,189,26,91,67,189,134,220,35,62,206,247,135,60,3,133,199,60,66,178,182,61,207,4,135,60,5,47,81,61,33,242,33,62,217,41,16,188,216,189,252,185,8,6,61,61,171,155,185,189,198,142,192,189,114,209,30,189,109,108,170,61,222,147,21,61,91,226,18,189,232,146,136,61,154,157,74,60,39,1,234,189,28,253,2,189,94,91,132,59,221,251,60,187,102,60,35,60,194,115,171,188,188,137,197,188,42,230,182,60,189,241,5,191,120,151,236,61,6,11,132,60,239,176,73,60,83,114,200,188,183,81,66,188,17,113,18,59,183,254,176,188,64,146,156,187,182,153,220,188,233,185,27,61,0,18,7,61,18,245,24,61,218,229,21,190,234,70,91,188,73,84,133,188,68,21,155,60,137,251,76,61,67,106,123,190,16,74,219,60,22,29,147,189,43,102,75,188,134,139,238,60,63,56,43,60,87,8,20,59,85,149,219,61,33,47,184,188,26,198,182,61,201,44,125,189,225,183,120,61,176,178,193,187,172,223,4,190,25,191,164,189,180,234,223,189,94,241,234,60,255,236,77,62,130,52,37,61,16,228,93,188,101,82,225,189,166,49,196,61,76,11,113,189,24,140,124,190,56,187,83,190,110,33,183,185,5,60,244,61,39,25,249,187,253,203,19,188,193,33,130,59,0,11,24,60,81,26,250,185,182,240,5,62,24,33,154,61,158,162,162,189,4,89,54,189,188,236,143,61,84,57,234,188,182,181,204,188,205,246,198,189,204,16,5,62,243,207,111,61,237,35,177,61,188,16,67,188,131,84,132,60,48,79,205,189,83,17,34,61,45,25,111,61,43,104,39,188,25,1,192,60,141,118,23,62,19,153,145,188,5,189,52,62,98,248,116,188,177,170,95,62,110,119,138,189,77,143,170,188,136,121,83,188,117,54,145,60,75,239,211,59,50,60,11,60,13,38,162,189,20,8,36,189,139,1,158,189,172,151,175,187,185,249,3,190,150,132,3,62,8,143,250,189,12,183,48,61,170,69,8,61,213,22,233,188,14,243,211,188,133,114,86,61,247,131,64,62,106,102,26,61,89,164,233,188,241,48,31,61,199,168,101,62,29,26,3,61,54,160,160,188,155,153,146,61,145,190,252,60,249,0,174,187,5,245,225,188,45,136,173,189,134,149,169,188,186,108,36,63,24,59,18,190,78,166,227,188,241,68,18,188,62,135,160,60,164,180,25,60,27,7,160,60,88,67,6,60,82,78,74,190,49,99,166,60,222,35,145,60,25,1,198,186,178,31,234,188,42,200,60,188,87,251,215,187,65,146,246,188,40,54,45,62,4,198,165,189,219,85,129,188,67,154,18,188,45,10,111,60,216,10,45,60,252,82,213,60,69,110,194,60,246,8,21,189,22,6,51,187,94,141,120,189,255,50,82,190,114,169,114,188,247,11,88,60,5,76,28,189,139,106,232,60,20,245,41,190,89,100,46,58,170,108,106,61,156,136,57,189,238,238,149,189,214,136,152,188,188,211,193,59,178,74,79,61,92,76,244,188,31,42,101,189,252,12,125,189,192,113,199,59,65,28,116,186,162,5,78,189,29,250,136,62,204,88,139,62,50,100,188,60,80,241,6,60,215,127,144,188,199,244,229,187,121,130,177,61,108,33,249,58,26,119,247,61,124,191,178,190,202,79,27,61,38,204,79,62,22,147,217,61,74,123,23,63,226,144,64,62,120,201,136,60,46,11,239,190,149,40,128,61,35,215,202,60,207,139,197,61,237,65,7,190,38,152,239,60,161,254,215,189,15,74,35,58,216,244,136,187,95,153,208,189,168,104,166,59,40,70,177,188,127,130,59,60,191,1,68,62,74,244,153,185,192,255,185,188,161,173,29,191,145,249,154,188,117,156,85,61,150,38,37,62,158,181,28,190,16,135,58,61,250,196,145,61,33,228,61,59,253,72,58,60,23,42,11,189,6,134,65,187,80,251,182,188,204,168,36,60,171,198,83,61,81,69,137,187,75,128,7,60,200,175,48,190,154,43,25,62,112,156,21,190,13,51,45,191,65,204,41,190,103,224,75,61,18,51,160,62,243,227,1,189,136,237,82,187,177,113,58,61,127,166,135,191,27,150,137,62,186,237,83,61,56,76,165,186,185,245,250,188,72,123,182,188,235,41,103,189,148,30,112,189,38,189,244,189,115,231,118,190,138,238,188,60,224,196,0,190,129,17,233,186,135,205,73,188,87,143,2,59,14,211,147,188,24,5,2,189,219,229,223,189,89,184,2,62,139,108,142,60,106,2,129,59,48,52,183,187,246,188,3,187,71,167,156,189,182,129,120,61,118,250,22,61,238,171,0,189,120,50,77,60,14,98,11,62,15,101,164,60,241,137,11,190,35,48,249,59,61,24,82,60,246,119,193,60,228,217,54,189,162,154,178,189,253,115,104,189,32,74,172,60,68,143,9,189,65,203,35,190,1,168,193,186,27,242,140,61,73,68,141,59,6,117,120,189,202,76,221,189,38,4,88,187,124,85,21,59,226,3,134,60,115,50,242,188,44,149,223,189,143,135,64,61,174,187,233,188,61,100,0,190,251,15,168,187,134,189,212,58,190,64,148,61,165,228,165,61,152,90,23,61,138,84,9,190,160,245,73,189,160,232,0,189,236,233,135,188,16,9,77,189,191,61,8,189,112,218,216,60,185,64,28,61,95,220,167,60,212,116,150,189,193,131,83,62,17,52,39,60,185,57,136,61,9,17,231,189,6,171,226,188,209,227,45,189,125,223,64,187,145,237,74,190,174,68,40,61,19,50,34,188,144,177,90,189,102,149,234,61,41,242,106,189,32,230,124,190,6,166,73,190,22,80,58,188,76,106,249,61,193,152,204,187,249,12,157,188,31,65,51,61,109,160,15,188,242,143,19,189,69,72,221,60,73,1,141,61,82,247,227,189,44,111,102,188,23,17,154,60,125,28,59,61,223,27,145,188,225,177,237,189,71,245,185,189,231,98,25,190,48,181,209,190,57,80,234,59,165,204,47,189,4,76,57,60,131,47,69,58,107,174,229,188,255,47,94,61,203,250,165,188,129,127,9,61,222,170,172,189,10,55,42,187,239,31,43,189,86,144,53,61,187,180,65,62,23,114,5,61,63,144,24,188,178,61,153,189,239,73,103,60,254,20,27,59,40,174,153,189,82,76,148,61,155,98,214,189,148,251,31,189,64,222,53,60,247,118,218,189,175,131,115,188,235,84,20,60,47,40,21,59,183,203,10,61,4,254,144,62,87,236,234,188,158,216,112,189,139,129,106,188,156,239,80,59,220,44,151,189,105,15,113,190,167,181,171,187,52,80,65,189,67,48,84,188,190,181,232,62,30,208,56,61,55,113,170,188,211,224,138,190,214,16,208,189,121,119,44,188,112,216,36,59,77,33,76,60,198,222,2,190,238,140,71,62,38,231,153,188,97,222,215,188,19,18,202,188,53,192,32,189,176,121,42,190,190,183,215,61,224,56,40,189,215,164,138,188,208,100,136,59,149,79,192,186,83,195,128,61,1,170,182,61,54,163,56,189,117,250,233,61,192,16,203,61,9,37,154,58,151,240,146,188,27,186,97,60,143,166,165,60,137,133,131,186,238,19,220,59,59,50,100,60,118,55,1,61,85,26,23,189,21,47,40,190,212,174,199,60,95,37,80,190,183,148,71,60,136,142,34,61,163,120,138,60,49,241,189,189,110,204,82,189,229,0,139,188,211,28,107,60,101,56,63,189,194,67,136,187,115,233,45,62,222,58,133,61,179,253,136,189,255,92,165,189,138,234,139,59,106,223,251,188,104,246,173,188,214,61,196,189,57,219,250,189,198,235,253,60,205,13,15,189,155,46,128,60,169,161,0,188,171,72,159,188,79,74,7,189,92,171,160,60,32,17,107,61,112,239,9,189,58,109,113,61,247,162,189,60,71,118,67,60,236,186,84,190,44,188,73,59,216,38,134,188,104,212,133,189,236,112,22,62,54,205,96,189,249,13,140,60,16,85,174,185,239,131,99,61,149,89,133,60,13,79,10,188,27,85,24,189,158,192,160,60,7,90,150,187,170,82,141,188,246,46,152,189,65,237,150,188,192,35,6,190,238,249,124,189,96,97,27,190,152,202,135,61,17,100,246,189,1,170,14,62,197,98,223,188,168,164,89,188,87,189,152,187,226,157,185,187,105,195,141,188,151,180,80,59,211,167,169,60,45,229,155,188,152,57,243,61,26,98,231,186,230,167,243,61,103,113,23,188,136,104,202,190,174,165,133,188,30,98,197,61,176,68,96,189,110,3,197,60,70,161,233,61,16,101,131,187,70,187,119,62,140,16,42,189,224,69,79,188,107,150,214,188,207,169,2,60,135,124,29,60,172,47,226,58,67,84,77,189,211,29,232,189,237,229,234,189,10,67,89,189,164,50,150,186,17,71,199,189,129,18,186,60,196,186,243,188,166,1,154,189,223,231,109,61,232,26,120,62,201,210,168,60,228,125,3,189,201,143,12,190,105,32,88,60,13,30,210,59,2,186,195,190,255,131,45,189,207,170,92,189,49,42,233,188,168,54,48,191,91,97,111,62,155,158,55,58,43,246,1,190,167,35,57,188,204,76,192,59,16,207,144,60,16,28,82,60,42,44,107,187,191,48,100,61,251,164,147,189,211,60,12,61,121,84,131,188,133,52,76,59,7,27,214,60,84,131,128,188,246,223,96,60,30,133,139,188,62,21,34,62,248,30,81,188,128,90,166,61,37,46,190,188,28,247,50,190,163,24,183,189,90,138,70,190,34,147,6,191,86,30,23,60,110,177,158,189,120,116,210,189,176,172,35,187,208,145,30,58,189,31,99,188,217,47,235,189,161,231,127,61,70,65,161,59,58,178,159,188,181,105,61,60,190,146,21,59,207,177,75,61,10,131,186,188,102,101,38,59,98,82,135,60,147,24,205,61,150,148,111,188,54,252,127,61,0,0,97,61,38,233,1,62,72,209,164,61,89,91,192,61,227,163,31,190,38,14,10,187,183,58,144,61,50,44,108,61,46,76,216,189,167,76,125,61,54,231,164,189,240,93,227,189,68,71,156,61,185,89,71,60,103,203,18,62,104,202,135,62,59,160,193,60,15,193,185,61,88,63,122,60,86,131,34,190,175,167,67,189,204,24,67,189,13,248,16,188,154,106,172,61,242,120,138,187,189,32,127,189,209,150,22,61,37,58,35,189,27,134,160,62,18,220,18,60,245,137,207,189,107,93,71,189,148,162,128,59,228,10,192,188,34,252,64,60,64,69,183,61,57,93,198,188,165,167,160,58,165,27,173,190,19,35,189,188,65,126,19,61,175,95,252,61,149,140,200,189,194,168,65,61,105,36,198,60,228,1,222,187,165,168,191,60,6,44,109,187,238,251,159,60,146,2,141,61,97,233,70,188,125,11,233,186,113,105,161,61,146,244,167,60,11,33,104,60,50,62,33,188,176,11,87,62,230,79,211,188,241,105,18,187,233,205,129,187,22,237,20,60,144,31,233,58,96,194,98,59,151,159,228,187,178,8,52,60,145,188,226,188,195,103,150,189,63,203,117,188,29,157,121,188,239,210,155,187,52,190,220,60,232,195,233,62,166,40,138,188,14,193,4,190,51,5,37,189,209,166,18,62,12,40,165,62,39,84,222,60,122,134,201,60,140,15,199,189,103,223,133,188,174,44,135,189,177,167,20,60,9,187,143,189,163,62,65,60,237,182,126,188,144,90,162,60,181,19,19,190,93,134,72,189,190,47,164,60,154,222,135,189,45,151,5,62,123,188,239,61,151,243,101,60,196,73,145,58,128,175,204,60,13,231,251,60,42,204,21,62,249,162,140,188,52,156,209,61,8,93,53,61,177,2,5,60,135,71,175,61,94,21,105,187,161,230,85,187,164,66,7,189,4,252,83,60,35,245,74,187,186,83,11,188,23,228,29,190,242,59,149,60,211,97,136,60,69,40,194,58,52,176,19,188,186,35,105,59,81,91,112,188,44,145,175,188,130,5,91,62,221,133,58,59]}},{"name":"const_fold_opt__61","dataType":1,"dims":[128,640],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[159,225,169,190,92,13,64,191,219,218,188,190,230,48,30,191,89,62,127,191,114,174,136,191,159,144,59,191,148,117,130,191,160,190,132,191,164,9,88,190,53,230,53,190,34,150,154,190,248,224,27,191,66,224,207,190,190,60,135,190,180,37,201,190,147,160,11,191,144,184,241,190,34,169,178,190,243,80,97,190,103,224,245,190,101,119,158,190,119,80,212,188,179,203,224,189,121,29,87,190,77,227,140,189,75,39,236,190,64,154,155,190,3,11,81,62,123,198,181,62,34,166,186,62,172,74,210,62,200,206,213,62,117,80,16,62,46,121,72,62,88,184,95,62,100,154,141,60,102,226,2,191,28,255,48,191,88,220,249,190,194,223,242,190,134,5,47,191,15,44,44,191,16,205,134,190,130,21,252,60,178,54,37,190,53,20,90,190,148,188,128,189,141,126,173,62,188,183,104,63,206,62,24,63,93,207,227,188,122,209,151,190,190,27,75,190,221,65,172,188,4,9,84,190,43,156,137,190,223,103,42,191,205,156,63,191,223,17,42,191,170,93,13,191,60,238,19,191,87,251,249,190,137,193,234,190,146,121,130,190,104,53,225,190,22,211,190,190,197,146,183,190,70,158,140,190,118,190,69,190,59,121,175,190,80,22,10,191,189,131,10,191,44,91,177,190,243,96,205,190,163,16,6,191,112,160,20,191,96,244,25,191,48,114,87,191,172,47,63,191,146,154,15,191,164,197,249,190,64,13,237,190,32,240,244,190,123,112,52,191,99,45,233,190,126,87,111,190,63,43,204,190,1,42,44,191,104,143,95,191,108,237,107,191,132,150,78,191,89,4,21,191,162,48,21,191,41,147,19,191,124,88,51,191,80,2,237,190,144,136,182,190,150,90,242,190,189,84,175,190,161,158,170,190,67,64,20,191,220,24,35,191,162,152,7,191,84,183,187,190,132,37,117,190,209,85,222,189,116,181,121,190,139,113,37,190,14,55,101,190,6,44,143,190,25,92,115,190,56,142,158,190,206,229,132,190,44,242,147,190,81,232,221,190,164,202,53,191,9,114,40,191,128,179,248,190,81,237,220,190,90,71,63,191,142,6,54,191,190,253,45,191,162,24,130,191,33,121,139,191,35,135,120,191,233,107,105,191,84,12,93,191,165,254,198,190,70,3,78,191,163,228,174,190,58,61,24,191,177,255,134,191,161,137,143,191,23,136,96,191,246,253,170,191,241,75,163,191,231,200,129,190,10,218,62,190,148,165,183,190,246,71,50,191,19,227,11,191,60,113,175,190,45,21,223,190,103,95,32,191,246,229,22,191,12,41,205,190,130,19,86,190,201,245,4,191,16,174,210,190,145,68,137,189,249,243,20,190,174,169,183,190,38,87,83,190,52,208,0,191,108,239,173,190,208,144,11,62,49,111,148,62,27,204,192,62,216,119,210,62,35,31,204,62,55,149,20,61,253,99,140,61,50,213,15,62,79,191,48,189,120,110,24,191,101,199,87,191,86,127,23,191,131,145,6,191,199,23,52,191,231,223,36,191,39,129,157,190,166,63,81,188,126,137,80,190,167,196,176,190,54,107,105,190,105,50,141,62,243,218,94,63,12,199,8,63,151,210,23,189,109,22,185,190,30,117,166,190,25,170,11,190,58,73,87,190,34,247,70,190,215,91,49,191,152,95,85,191,129,1,57,191,204,105,17,191,31,184,54,191,79,193,33,191,232,57,9,191,120,89,132,190,97,132,235,190,251,215,242,190,232,165,225,190,213,174,132,190,218,215,139,190,160,47,198,190,91,161,11,191,142,239,5,191,231,66,173,190,128,156,241,190,247,190,19,191,91,60,31,191,120,218,15,191,30,183,68,191,32,232,60,191,143,101,33,191,22,201,11,191,175,221,199,190,70,20,199,190,229,87,37,191,216,228,235,190,75,134,83,190,128,233,187,190,160,72,34,191,146,147,91,191,139,99,103,191,157,251,62,191,90,187,15,191,245,76,20,191,106,48,8,191,147,193,51,191,132,119,0,191,86,237,168,190,64,181,233,190,253,241,161,190,223,203,169,190,201,36,18,191,64,170,26,191,1,27,222,190,207,36,151,190,249,31,14,190,85,241,199,59,20,10,78,190,147,218,253,189,219,190,40,190,5,236,51,190,18,242,14,190,36,5,69,190,228,137,19,190,94,18,181,189,255,18,134,190,181,227,18,191,244,120,252,190,55,200,174,190,125,251,110,190,210,149,7,191,243,214,233,190,206,65,219,190,237,113,53,191,239,219,65,191,209,73,39,191,100,241,33,191,211,155,16,191,123,1,142,190,53,55,61,191,145,16,33,190,71,204,209,190,170,42,113,191,146,130,130,191,203,252,100,191,249,33,175,191,30,157,161,191,100,209,115,190,24,252,91,190,94,157,209,190,114,155,47,191,112,15,253,190,243,211,130,190,211,116,173,190,190,237,25,191,177,19,64,191,22,13,53,191,198,231,12,191,124,159,48,191,136,141,7,191,235,227,27,190,106,114,51,190,239,144,161,190,184,154,20,190,214,212,221,190,145,205,127,190,42,93,100,62,72,18,157,62,211,22,165,62,54,193,245,62,49,24,2,63,139,112,16,62,12,96,66,62,31,150,135,62,97,121,58,61,154,145,240,190,247,45,34,191,222,131,210,190,137,97,220,190,233,247,58,191,224,10,57,191,161,128,208,190,110,56,238,188,96,64,248,189,22,15,47,190,245,107,125,60,25,171,25,63,49,255,153,63,201,192,74,63,212,19,94,62,225,126,88,188,60,94,223,61,89,95,146,62,42,120,3,61,255,113,21,189,89,60,142,190,245,219,145,190,227,88,33,190,21,66,83,190,24,80,168,190,76,11,151,190,159,171,68,190,64,114,166,60,152,176,66,189,146,185,3,190,83,234,52,190,44,215,63,189,159,4,34,190,71,47,0,190,20,52,24,190,1,59,81,190,37,82,14,190,138,126,143,190,67,69,212,190,165,105,228,190,144,221,137,190,8,95,26,191,219,153,48,191,148,100,22,191,243,240,247,190,108,56,135,190,215,135,102,190,8,203,232,190,248,123,161,190,80,236,100,189,24,208,15,190,78,221,34,191,73,85,91,191,150,179,86,191,29,116,62,191,156,14,42,191,116,129,25,191,181,222,20,191,112,11,84,191,56,31,34,191,171,219,0,191,36,89,32,191,213,245,240,190,22,178,10,191,45,115,59,191,72,61,74,191,121,212,33,191,77,212,214,190,16,172,103,190,60,156,29,190,176,31,143,190,80,98,51,190,197,134,81,190,180,127,64,190,14,144,35,190,191,146,135,190,99,221,36,190,2,66,162,189,110,28,174,190,74,196,23,191,210,187,13,191,227,190,179,190,234,53,93,190,169,53,247,190,168,230,231,190,187,156,215,190,198,216,76,191,185,215,64,191,53,170,28,191,66,230,39,191,146,14,46,191,189,255,135,190,163,180,247,190,3,33,147,62,234,74,148,187,235,182,29,191,102,16,60,191,186,240,32,191,158,38,133,191,139,216,134,191,72,69,78,190,108,245,99,190,61,252,251,190,21,167,72,191,190,59,30,191,72,232,141,190,8,152,164,190,10,233,40,191,83,250,103,191,112,79,130,191,39,134,88,191,88,189,67,191,112,57,5,191,225,113,65,190,143,206,50,190,100,100,123,190,31,40,69,189,79,10,138,190,153,135,0,190,128,97,106,62,57,144,91,62,136,86,109,62,189,79,210,62,250,209,211,62,140,37,130,61,31,113,182,61,46,39,101,62,190,85,115,59,184,50,8,191,52,23,37,191,44,13,232,190,11,101,235,190,145,121,66,191,27,70,72,191,69,242,191,190,151,50,196,60,92,195,59,190,88,23,206,189,226,207,220,61,180,231,34,63,103,234,162,63,183,78,116,63,53,80,168,62,156,106,0,62,132,111,121,62,227,181,172,62,78,205,35,61,237,85,187,60,236,172,55,190,124,95,22,190,223,189,45,62,51,162,64,62,212,74,221,187,48,126,194,189,10,51,4,190,99,36,207,61,219,160,10,62,37,100,114,61,199,50,208,60,111,188,40,59,191,57,45,188,141,126,178,61,178,213,160,61,74,96,7,189,176,44,149,60,246,196,154,189,252,87,121,190,169,8,152,190,94,95,192,189,238,234,232,190,250,57,254,190,136,78,180,190,177,47,107,190,135,118,90,189,153,170,175,189,78,197,170,190,214,199,107,190,65,254,88,60,23,102,24,189,90,171,3,191,189,28,50,191,248,13,71,191,69,223,74,191,168,101,34,191,159,79,251,190,198,104,5,191,241,39,68,191,44,115,31,191,191,46,5,191,61,118,33,191,119,146,221,190,11,172,244,190,191,208,48,191,35,115,81,191,29,214,43,191,194,98,219,190,142,188,104,190,45,191,32,190,27,153,128,190,181,202,14,190,234,132,66,190,20,50,33,190,12,30,13,190,76,185,114,190,246,161,238,189,251,170,208,189,132,31,170,190,54,33,9,191,6,103,6,191,77,169,187,190,168,34,48,190,63,17,224,190,127,109,192,190,120,70,168,190,240,159,55,191,172,65,42,191,96,151,12,191,220,155,26,191,167,135,31,191,141,182,115,190,100,39,195,190,170,156,18,63,132,136,150,62,231,45,196,190,45,25,5,191,99,197,165,190,120,182,60,191,199,175,86,191,183,20,87,190,250,46,158,190,42,79,10,191,245,11,76,191,80,135,54,191,102,160,210,190,230,134,164,190,255,101,26,191,186,95,90,191,99,172,125,191,85,110,79,191,171,54,49,191,32,69,237,190,37,62,105,190,102,203,142,190,63,217,204,190,162,25,139,190,139,162,2,191,17,46,178,190,39,53,163,61,247,203,216,61,125,14,69,62,119,80,187,62,29,218,134,62,74,217,234,189,42,17,6,190,138,37,183,189,107,181,152,190,22,139,69,191,171,124,96,191,87,121,36,191,100,197,47,191,59,58,96,191,156,155,94,191,135,63,14,191,94,225,140,190,31,199,210,190,103,81,186,190,132,124,146,190,64,223,132,61,117,54,66,63,255,41,20,63,77,93,15,188,43,94,182,190,137,145,158,190,62,52,37,190,254,179,202,190,210,253,181,190,91,104,51,191,29,45,90,191,131,20,18,191,90,52,217,190,74,139,14,191,214,228,11,191,129,29,30,191,242,208,231,190,174,135,249,190,166,151,232,190,24,16,199,190,91,111,233,190,235,38,252,190,83,195,234,190,207,106,225,190,67,195,211,190,17,41,133,190,104,160,162,190,34,118,12,191,234,164,11,191,146,52,230,190,89,47,39,191,164,1,44,191,196,91,19,191,109,84,233,190,188,168,204,190,197,219,208,190,225,11,32,191,61,149,5,191,165,212,192,190,32,47,196,190,66,74,26,191,135,51,61,191,98,36,106,191,154,115,97,191,110,228,39,191,64,89,12,191,114,227,19,191,158,74,87,191,0,40,54,191,250,19,1,191,173,38,24,191,5,104,198,