{
  "ir_version": "7",
  "producer_name": "tf2onnx",
  "producer_version": "1.16.1 15c810",
  "graph": {
    "node": [
      {
        "input": [
          "input_1",
          "scale__53",
          "zero_point__54"
        ],
        "output": [
          "input_1_dequant"
        ],
        "name": "input_1_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/dense_9/MatMul",
          "scale__55",
          "zero_point__64"
        ],
        "output": [
          "functional_1/dense_9/MatMul_dequant"
        ],
        "name": "functional_1/dense_9/MatMul_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/dense_9/BiasAdd/ReadVariableOp/resource",
          "scale__57",
          "zero_point__62"
        ],
        "output": [
          "functional_1/dense_9/BiasAdd/ReadVariableOp/resource_dequant"
        ],
        "name": "functional_1/dense_9/BiasAdd/ReadVariableOp/resource_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/dense_8/MatMul",
          "scale__59",
          "zero_point__64"
        ],
        "output": [
          "functional_1/dense_8/MatMul_dequant"
        ],
        "name": "functional_1/dense_8/MatMul_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/dense_8/BiasAdd/ReadVariableOp/resource",
          "scale__61",
          "zero_point__62"
        ],
        "output": [
          "functional_1/dense_8/BiasAdd/ReadVariableOp/resource_dequant"
        ],
        "name": "functional_1/dense_8/BiasAdd/ReadVariableOp/resource_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/dense_7/MatMul",
          "scale__63",
          "zero_point__64"
        ],
        "output": [
          "functional_1/dense_7/MatMul_dequant"
        ],
        "name": "functional_1/dense_7/MatMul_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/dense_7/BiasAdd/ReadVariableOp/resource",
          "scale__65",
          "zero_point__62"
        ],
        "output": [
          "functional_1/dense_7/BiasAdd/ReadVariableOp/resource_dequant"
        ],
        "name": "functional_1/dense_7/BiasAdd/ReadVariableOp/resource_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/dense_6/MatMul",
          "scale__67",
          "zero_point__64"
        ],
        "output": [
          "functional_1/dense_6/MatMul_dequant"
        ],
        "name": "functional_1/dense_6/MatMul_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/dense_6/BiasAdd/ReadVariableOp/resource",
          "scale__69",
          "zero_point__62"
        ],
        "output": [
          "functional_1/dense_6/BiasAdd/ReadVariableOp/resource_dequant"
        ],
        "name": "functional_1/dense_6/BiasAdd/ReadVariableOp/resource_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/dense_5/MatMul",
          "scale__71",
          "zero_point__64"
        ],
        "output": [
          "functional_1/dense_5/MatMul_dequant"
        ],
        "name": "functional_1/dense_5/MatMul_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/dense_5/BiasAdd/ReadVariableOp/resource",
          "scale__73",
          "zero_point__62"
        ],
        "output": [
          "functional_1/dense_5/BiasAdd/ReadVariableOp/resource_dequant"
        ],
        "name": "functional_1/dense_5/BiasAdd/ReadVariableOp/resource_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/dense_4/MatMul",
          "scale__75",
          "zero_point__64"
        ],
        "output": [
          "functional_1/dense_4/MatMul_dequant"
        ],
        "name": "functional_1/dense_4/MatMul_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/dense_4/BiasAdd/ReadVariableOp/resource",
          "scale__77",
          "zero_point__62"
        ],
        "output": [
          "functional_1/dense_4/BiasAdd/ReadVariableOp/resource_dequant"
        ],
        "name": "functional_1/dense_4/BiasAdd/ReadVariableOp/resource_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/dense_3/MatMul",
          "scale__79",
          "zero_point__64"
        ],
        "output": [
          "functional_1/dense_3/MatMul_dequant"
        ],
        "name": "functional_1/dense_3/MatMul_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/dense_3/BiasAdd/ReadVariableOp/resource",
          "scale__81",
          "zero_point__62"
        ],
        "output": [
          "functional_1/dense_3/BiasAdd/ReadVariableOp/resource_dequant"
        ],
        "name": "functional_1/dense_3/BiasAdd/ReadVariableOp/resource_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/dense_2/MatMul",
          "scale__83",
          "zero_point__64"
        ],
        "output": [
          "functional_1/dense_2/MatMul_dequant"
        ],
        "name": "functional_1/dense_2/MatMul_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/dense_2/BiasAdd/ReadVariableOp/resource",
          "scale__85",
          "zero_point__62"
        ],
        "output": [
          "functional_1/dense_2/BiasAdd/ReadVariableOp/resource_dequant"
        ],
        "name": "functional_1/dense_2/BiasAdd/ReadVariableOp/resource_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/dense_1/MatMul",
          "scale__87",
          "zero_point__64"
        ],
        "output": [
          "functional_1/dense_1/MatMul_dequant"
        ],
        "name": "functional_1/dense_1/MatMul_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/dense_1/BiasAdd/ReadVariableOp/resource",
          "scale__89",
          "zero_point__62"
        ],
        "output": [
          "functional_1/dense_1/BiasAdd/ReadVariableOp/resource_dequant"
        ],
        "name": "functional_1/dense_1/BiasAdd/ReadVariableOp/resource_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/dense/MatMul",
          "scale__91",
          "zero_point__64"
        ],
        "output": [
          "functional_1/dense/MatMul_dequant"
        ],
        "name": "functional_1/dense/MatMul_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/dense/BiasAdd/ReadVariableOp/resource",
          "scale__93",
          "zero_point__62"
        ],
        "output": [
          "functional_1/dense/BiasAdd/ReadVariableOp/resource_dequant"
        ],
        "name": "functional_1/dense/BiasAdd/ReadVariableOp/resource_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "input_1_dequant",
          "functional_1/dense/MatMul_dequant",
          "functional_1/dense/BiasAdd/ReadVariableOp/resource_dequant"
        ],
        "output": [
          "Add__8:0"
        ],
        "op_type": "Gemm",
        "attribute": [
          {
            "name": "alpha",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "beta",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "transA",
            "i": "0",
            "type": "INT"
          },
          {
            "name": "transB",
            "i": "0",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "Add__8:0"
        ],
        "output": [
          "Relu__5:0"
        ],
        "name": "Relu__5",
        "op_type": "Relu"
      },
      {
        "input": [
          "Relu__5:0",
          "scale__97",
          "zero_point__98"
        ],
        "output": [
          "functional_1/activation/Relu;functional_1/dense/BiasAdd"
        ],
        "name": "functional_1/activation/Relu;functional_1/dense/BiasAdd_quantize",
        "op_type": "QuantizeLinear"
      },
      {
        "input": [
          "functional_1/activation/Relu;functional_1/dense/BiasAdd",
          "scale__97",
          "zero_point__98"
        ],
        "output": [
          "functional_1/activation/Relu;functional_1/dense/BiasAdd_dequant"
        ],
        "name": "functional_1/activation/Relu;functional_1/dense/BiasAdd_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/activation/Relu;functional_1/dense/BiasAdd_dequant",
          "functional_1/dense_1/MatMul_dequant",
          "functional_1/dense_1/BiasAdd/ReadVariableOp/resource_dequant"
        ],
        "output": [
          "Add__13:0"
        ],
        "op_type": "Gemm",
        "attribute": [
          {
            "name": "alpha",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "beta",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "transA",
            "i": "0",
            "type": "INT"
          },
          {
            "name": "transB",
            "i": "0",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "Add__13:0"
        ],
        "output": [
          "Relu__10:0"
        ],
        "name": "Relu__10",
        "op_type": "Relu"
      },
      {
        "input": [
          "Relu__10:0",
          "scale__99",
          "zero_point__98"
        ],
        "output": [
          "functional_1/activation_1/Relu;functional_1/dense_1/BiasAdd"
        ],
        "name": "functional_1/activation_1/Relu;functional_1/dense_1/BiasAdd_quantize",
        "op_type": "QuantizeLinear"
      },
      {
        "input": [
          "functional_1/activation_1/Relu;functional_1/dense_1/BiasAdd",
          "scale__99",
          "zero_point__98"
        ],
        "output": [
          "functional_1/activation_1/Relu;functional_1/dense_1/BiasAdd_dequant"
        ],
        "name": "functional_1/activation_1/Relu;functional_1/dense_1/BiasAdd_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/activation_1/Relu;functional_1/dense_1/BiasAdd_dequant",
          "functional_1/dense_2/MatMul_dequant",
          "functional_1/dense_2/BiasAdd/ReadVariableOp/resource_dequant"
        ],
        "output": [
          "Add__18:0"
        ],
        "op_type": "Gemm",
        "attribute": [
          {
            "name": "alpha",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "beta",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "transA",
            "i": "0",
            "type": "INT"
          },
          {
            "name": "transB",
            "i": "0",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "Add__18:0"
        ],
        "output": [
          "Relu__15:0"
        ],
        "name": "Relu__15",
        "op_type": "Relu"
      },
      {
        "input": [
          "Relu__15:0",
          "scale__105",
          "zero_point__98"
        ],
        "output": [
          "functional_1/activation_2/Relu;functional_1/dense_2/BiasAdd"
        ],
        "name": "functional_1/activation_2/Relu;functional_1/dense_2/BiasAdd_quantize",
        "op_type": "QuantizeLinear"
      },
      {
        "input": [
          "functional_1/activation_2/Relu;functional_1/dense_2/BiasAdd",
          "scale__105",
          "zero_point__98"
        ],
        "output": [
          "functional_1/activation_2/Relu;functional_1/dense_2/BiasAdd_dequant"
        ],
        "name": "functional_1/activation_2/Relu;functional_1/dense_2/BiasAdd_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/activation_2/Relu;functional_1/dense_2/BiasAdd_dequant",
          "functional_1/dense_3/MatMul_dequant",
          "functional_1/dense_3/BiasAdd/ReadVariableOp/resource_dequant"
        ],
        "output": [
          "Add__23:0"
        ],
        "op_type": "Gemm",
        "attribute": [
          {
            "name": "alpha",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "beta",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "transA",
            "i": "0",
            "type": "INT"
          },
          {
            "name": "transB",
            "i": "0",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "Add__23:0"
        ],
        "output": [
          "Relu__20:0"
        ],
        "name": "Relu__20",
        "op_type": "Relu"
      },
      {
        "input": [
          "Relu__20:0",
          "scale__109",
          "zero_point__98"
        ],
        "output": [
          "functional_1/activation_3/Relu;functional_1/dense_3/BiasAdd"
        ],
        "name": "functional_1/activation_3/Relu;functional_1/dense_3/BiasAdd_quantize",
        "op_type": "QuantizeLinear"
      },
      {
        "input": [
          "functional_1/activation_3/Relu;functional_1/dense_3/BiasAdd",
          "scale__109",
          "zero_point__98"
        ],
        "output": [
          "functional_1/activation_3/Relu;functional_1/dense_3/BiasAdd_dequant"
        ],
        "name": "functional_1/activation_3/Relu;functional_1/dense_3/BiasAdd_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/activation_3/Relu;functional_1/dense_3/BiasAdd_dequant",
          "functional_1/dense_4/MatMul_dequant",
          "functional_1/dense_4/BiasAdd/ReadVariableOp/resource_dequant"
        ],
        "output": [
          "Add__28:0"
        ],
        "op_type": "Gemm",
        "attribute": [
          {
            "name": "alpha",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "beta",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "transA",
            "i": "0",
            "type": "INT"
          },
          {
            "name": "transB",
            "i": "0",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "Add__28:0"
        ],
        "output": [
          "Relu__25:0"
        ],
        "name": "Relu__25",
        "op_type": "Relu"
      },
      {
        "input": [
          "Relu__25:0",
          "scale__113",
          "zero_point__98"
        ],
        "output": [
          "functional_1/activation_4/Relu;functional_1/dense_4/BiasAdd"
        ],
        "name": "functional_1/activation_4/Relu;functional_1/dense_4/BiasAdd_quantize",
        "op_type": "QuantizeLinear"
      },
      {
        "input": [
          "functional_1/activation_4/Relu;functional_1/dense_4/BiasAdd",
          "scale__113",
          "zero_point__98"
        ],
        "output": [
          "functional_1/activation_4/Relu;functional_1/dense_4/BiasAdd_dequant"
        ],
        "name": "functional_1/activation_4/Relu;functional_1/dense_4/BiasAdd_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/activation_4/Relu;functional_1/dense_4/BiasAdd_dequant",
          "functional_1/dense_5/MatMul_dequant",
          "functional_1/dense_5/BiasAdd/ReadVariableOp/resource_dequant"
        ],
        "output": [
          "Add__33:0"
        ],
        "op_type": "Gemm",
        "attribute": [
          {
            "name": "alpha",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "beta",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "transA",
            "i": "0",
            "type": "INT"
          },
          {
            "name": "transB",
            "i": "0",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "Add__33:0"
        ],
        "output": [
          "Relu__30:0"
        ],
        "name": "Relu__30",
        "op_type": "Relu"
      },
      {
        "input": [
          "Relu__30:0",
          "scale__115",
          "zero_point__98"
        ],
        "output": [
          "functional_1/activation_5/Relu;functional_1/dense_5/BiasAdd"
        ],
        "name": "functional_1/activation_5/Relu;functional_1/dense_5/BiasAdd_quantize",
        "op_type": "QuantizeLinear"
      },
      {
        "input": [
          "functional_1/activation_5/Relu;functional_1/dense_5/BiasAdd",
          "scale__115",
          "zero_point__98"
        ],
        "output": [
          "functional_1/activation_5/Relu;functional_1/dense_5/BiasAdd_dequant"
        ],
        "name": "functional_1/activation_5/Relu;functional_1/dense_5/BiasAdd_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/activation_5/Relu;functional_1/dense_5/BiasAdd_dequant",
          "functional_1/dense_6/MatMul_dequant",
          "functional_1/dense_6/BiasAdd/ReadVariableOp/resource_dequant"
        ],
        "output": [
          "Add__38:0"
        ],
        "op_type": "Gemm",
        "attribute": [
          {
            "name": "alpha",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "beta",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "transA",
            "i": "0",
            "type": "INT"
          },
          {
            "name": "transB",
            "i": "0",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "Add__38:0"
        ],
        "output": [
          "Relu__35:0"
        ],
        "name": "Relu__35",
        "op_type": "Relu"
      },
      {
        "input": [
          "Relu__35:0",
          "scale__119",
          "zero_point__98"
        ],
        "output": [
          "functional_1/activation_6/Relu;functional_1/dense_6/BiasAdd"
        ],
        "name": "functional_1/activation_6/Relu;functional_1/dense_6/BiasAdd_quantize",
        "op_type": "QuantizeLinear"
      },
      {
        "input": [
          "functional_1/activation_6/Relu;functional_1/dense_6/BiasAdd",
          "scale__119",
          "zero_point__98"
        ],
        "output": [
          "functional_1/activation_6/Relu;functional_1/dense_6/BiasAdd_dequant"
        ],
        "name": "functional_1/activation_6/Relu;functional_1/dense_6/BiasAdd_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/activation_6/Relu;functional_1/dense_6/BiasAdd_dequant",
          "functional_1/dense_7/MatMul_dequant",
          "functional_1/dense_7/BiasAdd/ReadVariableOp/resource_dequant"
        ],
        "output": [
          "Add__43:0"
        ],
        "op_type": "Gemm",
        "attribute": [
          {
            "name": "alpha",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "beta",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "transA",
            "i": "0",
            "type": "INT"
          },
          {
            "name": "transB",
            "i": "0",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "Add__43:0"
        ],
        "output": [
          "Relu__40:0"
        ],
        "name": "Relu__40",
        "op_type": "Relu"
      },
      {
        "input": [
          "Relu__40:0",
          "scale__123",
          "zero_point__98"
        ],
        "output": [
          "functional_1/activation_7/Relu;functional_1/dense_7/BiasAdd"
        ],
        "name": "functional_1/activation_7/Relu;functional_1/dense_7/BiasAdd_quantize",
        "op_type": "QuantizeLinear"
      },
      {
        "input": [
          "functional_1/activation_7/Relu;functional_1/dense_7/BiasAdd",
          "scale__123",
          "zero_point__98"
        ],
        "output": [
          "functional_1/activation_7/Relu;functional_1/dense_7/BiasAdd_dequant"
        ],
        "name": "functional_1/activation_7/Relu;functional_1/dense_7/BiasAdd_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/activation_7/Relu;functional_1/dense_7/BiasAdd_dequant",
          "functional_1/dense_8/MatMul_dequant",
          "functional_1/dense_8/BiasAdd/ReadVariableOp/resource_dequant"
        ],
        "output": [
          "Add__48:0"
        ],
        "op_type": "Gemm",
        "attribute": [
          {
            "name": "alpha",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "beta",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "transA",
            "i": "0",
            "type": "INT"
          },
          {
            "name": "transB",
            "i": "0",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "Add__48:0"
        ],
        "output": [
          "Relu__45:0"
        ],
        "name": "Relu__45",
        "op_type": "Relu"
      },
      {
        "input": [
          "Relu__45:0",
          "scale__129",
          "zero_point__98"
        ],
        "output": [
          "functional_1/activation_8/Relu;functional_1/dense_8/BiasAdd"
        ],
        "name": "functional_1/activation_8/Relu;functional_1/dense_8/BiasAdd_quantize",
        "op_type": "QuantizeLinear"
      },
      {
        "input": [
          "functional_1/activation_8/Relu;functional_1/dense_8/BiasAdd",
          "scale__129",
          "zero_point__98"
        ],
        "output": [
          "functional_1/activation_8/Relu;functional_1/dense_8/BiasAdd_dequant"
        ],
        "name": "functional_1/activation_8/Relu;functional_1/dense_8/BiasAdd_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/activation_8/Relu;functional_1/dense_8/BiasAdd_dequant",
          "functional_1/dense_9/MatMul_dequant",
          "functional_1/dense_9/BiasAdd/ReadVariableOp/resource_dequant"
        ],
        "output": [
          "Add__51:0"
        ],
        "op_type": "Gemm",
        "attribute": [
          {
            "name": "alpha",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "beta",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "transA",
            "i": "0",
            "type": "INT"
          },
          {
            "name": "transB",
            "i": "0",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "Add__51:0",
          "scale__131",
          "zero_point__132"
        ],
        "output": [
          "Identity"
        ],
        "name": "Identity_quantize",
        "op_type": "QuantizeLinear",
        "domain": ""
      }
    ],
    "name": "tf2onnx",
    "initializer": [
      {
        "data_type": 3,
        "name": "zero_point__98",
        "raw_data": "gA=="
      },
      {
        "data_type": 3,
        "name": "zero_point__64",
        "raw_data": "AA=="
      },
      {
        "data_type": 6,
        "name": "zero_point__62",
        "raw_data": "AAAAAA=="
      },
      {
        "data_type": 3,
        "name": "zero_point__54",
        "raw_data": "WQ=="
      },
      {
        "data_type": 3,
        "name": "zero_point__132",
        "raw_data": "YA=="
      },
      {
        "data_type": 1,
        "name": "scale__99",
        "raw_data": "jQURPQ=="
      },
      {
        "data_type": 1,
        "name": "scale__97",
        "raw_data": "qJVKPQ=="
      },
      {
        "data_type": 1,
        "name": "scale__93",
        "raw_data": "r4UaOQ=="
      },
      {
        "data_type": 1,
        "name": "scale__91",
        "raw_data": "TpfFOQ=="
      },
      {
        "data_type": 1,
        "name": "scale__89",
        "raw_data": "NtlCOg=="
      },
      {
        "data_type": 1,
        "name": "scale__87",
        "raw_data": "Xzl2PA=="
      },
      {
        "data_type": 1,
        "name": "scale__85",
        "raw_data": "akf4Og=="
      },
      {
        "data_type": 1,
        "name": "scale__83",
        "raw_data": "OyNbPQ=="
      },
      {
        "data_type": 1,
        "name": "scale__81",
        "raw_data": "r6SBOg=="
      },
      {
        "data_type": 1,
        "name": "scale__79",
        "raw_data": "ToeTPQ=="
      },
      {
        "data_type": 1,
        "name": "scale__77",
        "raw_data": "ZohOOQ=="
      },
      {
        "data_type": 1,
        "name": "scale__75",
        "raw_data": "77cIPA=="
      },
      {
        "data_type": 1,
        "name": "scale__73",
        "raw_data": "grYuOg=="
      },
      {
        "data_type": 1,
        "name": "scale__71",
        "raw_data": "SQLbPA=="
      },
      {
        "data_type": 1,
        "name": "scale__69",
        "raw_data": "JPYgOg=="
      },
      {
        "data_type": 1,
        "name": "scale__67",
        "raw_data": "WGWePA=="
      },
      {
        "data_type": 1,
        "name": "scale__65",
        "raw_data": "o0XXOQ=="
      },
      {
        "data_type": 1,
        "name": "scale__63",
        "raw_data": "l8JRPA=="
      },
      {
        "data_type": 1,
        "name": "scale__61",
        "raw_data": "ZixROQ=="
      },
      {
        "data_type": 1,
        "name": "scale__59",
        "raw_data": "twLnOw=="
      },
      {
        "data_type": 1,
        "name": "scale__57",
        "raw_data": "dTD+OQ=="
      },
      {
        "data_type": 1,
        "name": "scale__55",
        "raw_data": "VjWgPA=="
      },
      {
        "data_type": 1,
        "name": "scale__53",
        "raw_data": "JjPIPg=="
      },
      {
        "data_type": 1,
        "name": "scale__131",
        "raw_data": "i5+6Pg=="
      },
      {
        "data_type": 1,
        "name": "scale__129",
        "raw_data": "RBbLPA=="
      },
      {
        "data_type": 1,
        "name": "scale__123",
        "raw_data": "9cznPA=="
      },
      {
        "data_type": 1,
        "name": "scale__119",
        "raw_data": "DV0DPQ=="
      },
      {
        "data_type": 1,
        "name": "scale__115",
        "raw_data": "whICPQ=="
      },
      {
        "data_type": 1,
        "name": "scale__113",
        "raw_data": "6TjMPA=="
      },
      {
        "data_type": 1,
        "name": "scale__109",
        "raw_data": "vlzBPA=="
      },
      {
        "data_type": 1,
        "name": "scale__105",
        "raw_data": "6fZgPA=="
      },
      {
        "dims": [
          "128",
          "640"
        ],
        "data_type": 3,
        "name": "functional_1/dense_9/MatMul",
        "raw_data": 