{
  "irVersion": 9,
  "opsetImport": [
    {
      "version": 17
    }
  ],
  "graph": {
    "name": "Graph",
    "initializer": [
      {
        "name": "init_carry",
        "dataType": 6,
        "dims": [
          4
        ],
        "int32Data": [
          0,
          0,
          0,
          0
        ]
      }
    ],
    "node": [
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "trip_count_0"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "trip_count_0",
              "dataType": 7,
              "dims": [],
              "int64Data": [
                4
              ]
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "cond_0"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "cond_0",
              "dataType": 9,
              "dims": [],
              "int32Data": [
                1
              ]
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "reshape_shape_0"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "reshape_shape_0",
              "dataType": 7,
              "dims": [
                2
              ],
              "int64Data": [
                2,
                2
              ]
            }
          }
        ]
      },
      {
        "opType": "Loop",
        "input": [
          "trip_count_0",
          "cond_0",
          "init_carry"
        ],
        "output": [
          "loop_out"
        ],
        "attribute": [
          {
            "name": "body",
            "type": 5,
            "g": {
              "name": "loop_body_0",
              "initializer": [],
              "node": [
                {
                  "opType": "Constant",
                  "input": [],
                  "output": [
                    "axes"
                  ],
                  "attribute": [
                    {
                      "name": "value",
                      "type": 4,
                      "t": {
                        "name": "axes",
                        "dataType": 7,
                        "dims": [
                          1
                        ],
                        "int64Data": [
                          0
                        ]
                      }
                    }
                  ]
                },
                {
                  "opType": "Constant",
                  "input": [],
                  "output": [
                    "flat_shape_X"
                  ],
                  "attribute": [
                    {
                      "name": "value",
                      "type": 4,
                      "t": {
                        "name": "flat_shape_X",
                        "dataType": 7,
                        "dims": [
                          1
                        ],
                        "int64Data": [
                          4
                        ]
                      }
                    }
                  ]
                },
                {
                  "opType": "Constant",
                  "input": [],
                  "output": [
                    "flat_shape_A"
                  ],
                  "attribute": [
                    {
                      "name": "value",
                      "type": 4,
                      "t": {
                        "name": "flat_shape_A",
                        "dataType": 7,
                        "dims": [
                          1
                        ],
                        "int64Data": [
                          4
                        ]
                      }
                    }
                  ]
                },
                {
                  "opType": "Unsqueeze",
                  "input": [
                    "iter",
                    "axes"
                  ],
                  "output": [
                    "unsq_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Reshape",
                  "input": [
                    "X",
                    "flat_shape_X"
                  ],
                  "output": [
                    "X_flat"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Gather",
                  "input": [
                    "X_flat",
                    "unsq_out"
                  ],
                  "output": [
                    "gather_X_0_out"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Reshape",
                  "input": [
                    "A",
                    "flat_shape_A"
                  ],
                  "output": [
                    "A_flat"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Gather",
                  "input": [
                    "A_flat",
                    "unsq_out"
                  ],
                  "output": [
                    "gather_A_0_out"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Add",
                  "input": [
                    "gather_X_0_out",
                    "gather_A_0_out"
                  ],
                  "output": [
                    "0_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "ScatterElements",
                  "input": [
                    "carry",
                    "unsq_out",
                    "0_out"
                  ],
                  "output": [
                    "carry_out"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Identity",
                  "input": [
                    "cond_in"
                  ],
                  "output": [
                    "cond_out"
                  ],
                  "attribute": []
                }
              ],
              "input": [
                {
                  "name": "iter",
                  "type": {
                    "tensorType": {
                      "elemType": 7,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "cond_in",
                  "type": {
                    "tensorType": {
                      "elemType": 9,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "carry",
                  "type": {
                    "tensorType": {
                      "elemType": 6,
                      "shape": {
                        "dim": [
                          {
                            "dimValue": 4
                          }
                        ]
                      }
                    }
                  }
                }
              ],
              "output": [
                {
                  "name": "cond_out",
                  "type": {
                    "tensorType": {
                      "elemType": 9,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "carry_out",
                  "type": {
                    "tensorType": {
                      "elemType": 6,
                      "shape": {
                        "dim": [
                          {
                            "dimValue": 4
                          }
                        ]
                      }
                    }
                  }
                }
              ],
              "valueInfo": [
                {
                  "name": "cond_out",
                  "type": {
                    "tensorType": {
                      "elemType": 9,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "carry_out",
                  "type": {
                    "tensorType": {
                      "elemType": 6,
                      "shape": {
                        "dim": [
                          {
                            "dimValue": 4
                          }
                        ]
                      }
                    }
                  }
                }
              ]
            }
          }
        ]
      },
      {
        "opType": "Reshape",
        "input": [
          "loop_out",
          "reshape_shape_0"
        ],
        "output": [
          "Y"
        ],
        "attribute": []
      }
    ],
    "input": [
      {
        "name": "X",
        "type": {
          "tensorType": {
            "elemType": 6,
            "shape": {
              "dim": [
                {
                  "dimValue": 2
                },
                {
                  "dimValue": 2
                }
              ]
            }
          }
        }
      },
      {
        "name": "A",
        "type": {
          "tensorType": {
            "elemType": 6,
            "shape": {
              "dim": [
                {
                  "dimValue": 2
                },
                {
                  "dimValue": 2
                }
              ]
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "Y",
        "type": {
          "tensorType": {
            "elemType": 6,
            "shape": {
              "dim": [
                {
                  "dimValue": 2
                },
                {
                  "dimValue": 2
                }
              ]
            }
          }
        }
      }
    ]
  }
}