{"irVersion":9,"opsetImport":[{"version":19}],"graph":{"name":"Graph","initializer":[],"node":[{"opType":"Add","input":["A","B"],"output":["AB"],"attribute":[]},{"opType":"Add","input":["C","D"],"output":["CD"],"attribute":[]},{"opType":"Add","input":["AB","CD"],"output":["Y"],"attribute":[]}],"input":[{"name":"A","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":4}]}}}},{"name":"B","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":4}]}}}},{"name":"C","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":4}]}}}},{"name":"D","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":4}]}}}}],"output":[{"name":"Y","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":4}]}}}}]}}