{
  "irVersion": 8,
  "opsetImport": [
    {
      "version": 17
    }
  ],
  "graph": {
    "name": "Graph",
    "input": [
      {
        "name": "A",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": 2
                },
                {
                  "dimValue": 2
                }
              ]
            }
          }
        }
      },
      {
        "name": "B",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": 2
                },
                {
                  "dimValue": 2
                }
              ]
            }
          }
        }
      },
      {
        "name": "C",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": 2
                },
                {
                  "dimValue": 2
                }
              ]
            }
          }
        }
      },
      {
        "name": "X",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": 2
                },
                {
                  "dimValue": 2
                }
              ]
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "Z",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": 2
                },
                {
                  "dimValue": 2
                }
              ]
            }
          }
        }
      }
    ],
    "initializer": [],
    "node": [
      {
        "opType": "Add",
        "input": [
          "X",
          "A"
        ],
        "output": [
          "XA"
        ],
        "attribute": []
      },
      {
        "opType": "Add",
        "input": [
          "B",
          "C"
        ],
        "output": [
          "BC"
        ],
        "attribute": []
      },
      {
        "opType": "Add",
        "input": [
          "XA",
          "BC"
        ],
        "output": [
          "Z"
        ],
        "attribute": []
      }
    ]
  }
}