{
  "irVersion": 9,
  "opsetImport": [
    {
      "version": 17
    }
  ],
  "graph": {
    "name": "Graph",
    "initializer": [],
    "node": [
      {
        "opType": "Loop",
        "input": [
          "trip_count",
          "cond",
          "carry"
        ],
        "output": [
          "AB"
        ],
        "attribute": [
          {
            "name": "v_initial"
          },
          {
            "name": "body",
            "type": 5,
            "g": {
              "name": "loop_body",
              "initializer": [],
              "node": [
                {
                  "opType": "Constant",
                  "input": [],
                  "output": [
                    "carry"
                  ],
                  "attribute": [
                    {
                      "name": "value",
                      "type": 4,
                      "t": {
                        "name": "carry",
                        "dataType": 1,
                        "dims": [
                          1
                        ],
                        "floatData": [
                          0
                        ]
                      }
                    }
                  ]
                },
                {
                  "opType": "Constant",
                  "input": [],
                  "output": [
                    "axes"
                  ],
                  "attribute": [
                    {
                      "name": "value",
                      "type": 4,
                      "t": {
                        "name": "axes",
                        "dataType": 7,
                        "dims": [
                          1
                        ],
                        "int64Data": [
                          0
                        ]
                      }
                    }
                  ]
                },
                {
                  "opType": "Unsqueeze",
                  "input": [
                    "iter_idx",
                    "axes"
                  ],
                  "output": [
                    "scatter"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Gather",
                  "input": [
                    "A",
                    "idx_unsq"
                  ],
                  "output": [],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Gather",
                  "input": [
                    "B",
                    "idx_unsq"
                  ],
                  "output": [],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Add",
                  "input": [
                    "g_A",
                    "g_B"
                  ],
                  "output": [
                    "scatter"
                  ],
                  "attribute": []
                },
                {
                  "opType": "ScatterElements",
                  "input": [
                    "carry",
                    "idx_unsq",
                    "Add_0"
                  ],
                  "output": [
                    "carry_out"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Identity",
                  "input": [
                    "cond_in"
                  ],
                  "output": [
                    "cond_out"
                  ],
                  "attribute": []
                }
              ],
              "input": [],
              "output": [],
              "valueInfo": []
            }
          }
        ]
      },
      {
        "opType": "Loop",
        "input": [
          "trip_count",
          "cond",
          "carry"
        ],
        "output": [
          "CD"
        ],
        "attribute": [
          {
            "name": "v_initial"
          },
          {
            "name": "body",
            "type": 5,
            "g": {
              "name": "loop_body",
              "initializer": [],
              "node": [
                {
                  "opType": "Constant",
                  "input": [],
                  "output": [
                    "carry"
                  ],
                  "attribute": [
                    {
                      "name": "value",
                      "type": 4,
                      "t": {
                        "name": "carry",
                        "dataType": 1,
                        "dims": [
                          1
                        ],
                        "floatData": [
                          0
                        ]
                      }
                    }
                  ]
                },
                {
                  "opType": "Constant",
                  "input": [],
                  "output": [
                    "axes"
                  ],
                  "attribute": [
                    {
                      "name": "value",
                      "type": 4,
                      "t": {
                        "name": "axes",
                        "dataType": 7,
                        "dims": [
                          1
                        ],
                        "int64Data": [
                          0
                        ]
                      }
                    }
                  ]
                },
                {
                  "opType": "Unsqueeze",
                  "input": [
                    "iter_idx",
                    "axes"
                  ],
                  "output": [
                    "scatter"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Gather",
                  "input": [
                    "C",
                    "idx_unsq"
                  ],
                  "output": [],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Gather",
                  "input": [
                    "D",
                    "idx_unsq"
                  ],
                  "output": [],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Add",
                  "input": [
                    "g_C",
                    "g_D"
                  ],
                  "output": [
                    "scatter"
                  ],
                  "attribute": []
                },
                {
                  "opType": "ScatterElements",
                  "input": [
                    "carry",
                    "idx_unsq",
                    "Add_1"
                  ],
                  "output": [
                    "carry_out"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Identity",
                  "input": [
                    "cond_in"
                  ],
                  "output": [
                    "cond_out"
                  ],
                  "attribute": []
                }
              ],
              "input": [],
              "output": [],
              "valueInfo": []
            }
          }
        ]
      },
      {
        "opType": "Loop",
        "input": [
          "trip_count",
          "cond",
          "carry"
        ],
        "output": [
          "Y"
        ],
        "attribute": [
          {
            "name": "v_initial"
          },
          {
            "name": "body",
            "type": 5,
            "g": {
              "name": "loop_body",
              "initializer": [],
              "node": [
                {
                  "opType": "Constant",
                  "input": [],
                  "output": [
                    "carry"
                  ],
                  "attribute": [
                    {
                      "name": "value",
                      "type": 4,
                      "t": {
                        "name": "carry",
                        "dataType": 1,
                        "dims": [
                          4
                        ],
                        "floatData": [
                          0,
                          0,
                          0,
                          0
                        ]
                      }
                    }
                  ]
                },
                {
                  "opType": "Constant",
                  "input": [],
                  "output": [
                    "axes"
                  ],
                  "attribute": [
                    {
                      "name": "value",
                      "type": 4,
                      "t": {
                        "name": "axes",
                        "dataType": 7,
                        "dims": [
                          1
                        ],
                        "int64Data": [
                          0
                        ]
                      }
                    }
                  ]
                },
                {
                  "opType": "Unsqueeze",
                  "input": [
                    "iter_idx",
                    "axes"
                  ],
                  "output": [
                    "scatter"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Gather",
                  "input": [
                    "AB",
                    "idx_unsq"
                  ],
                  "output": [],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Gather",
                  "input": [
                    "CD",
                    "idx_unsq"
                  ],
                  "output": [],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Add",
                  "input": [
                    "g_AB",
                    "g_CD"
                  ],
                  "output": [
                    "scatter"
                  ],
                  "attribute": []
                },
                {
                  "opType": "ScatterElements",
                  "input": [
                    "carry",
                    "idx_unsq",
                    "Add_2"
                  ],
                  "output": [
                    "carry_out"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Identity",
                  "input": [
                    "cond_in"
                  ],
                  "output": [
                    "cond_out"
                  ],
                  "attribute": []
                }
              ],
              "input": [],
              "output": [],
              "valueInfo": []
            }
          }
        ]
      }
    ],
    "input": [
      {
        "name": "A",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": 4
                }
              ]
            }
          }
        }
      },
      {
        "name": "B",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": 4
                }
              ]
            }
          }
        }
      },
      {
        "name": "C",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": 4
                }
              ]
            }
          }
        }
      },
      {
        "name": "D",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": 4
                }
              ]
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "Y",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": 4
                }
              ]
            }
          }
        }
      }
    ]
  }
}