{"irVersion":9,"opsetImport":[{"version":19}],"graph":{"name":"Graph","initializer":[{"name":"init_carry","dataType":1,"dims":[18],"floatData":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]},{"name":"init_carry_1","dataType":1,"dims":[60],"floatData":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]}],"node":[{"opType":"Constant","input":[],"output":["AvgPool_Wones_0"],"attribute":[{"name":"value","type":4,"t":{"name":"AvgPool_Wones_0","dataType":1,"dims":[2,1,3,3],"floatData":[1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1]}}]},{"opType":"Constant","input":[],"output":["conv_init_AvgPool_ConvMask_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_init_AvgPool_ConvMask_0","dataType":1,"dims":[18],"floatData":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]}}]},{"opType":"Constant","input":[],"output":["AvgPool_one_0"],"attribute":[{"name":"value","type":4,"t":{"name":"AvgPool_one_0","dataType":1,"dims":[],"floatData":[1]}}]},{"opType":"Constant","input":[],"output":["conv_init_AvgPool_ConvSum_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_init_AvgPool_ConvSum_0","dataType":1,"dims":[18],"floatData":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]}}]},{"opType":"Constant","input":[],"output":["trip_count_AvgPool_DivM_0"],"attribute":[{"name":"value","type":4,"t":{"name":"trip_count_AvgPool_DivM_0","dataType":7,"dims":[],"int64Data":[18]}}]},{"opType":"Constant","input":[],"output":["cond_AvgPool_DivM_0"],"attribute":[{"name":"value","type":4,"t":{"name":"cond_AvgPool_DivM_0","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["reshape_shape_AvgPool_DivM_0"],"attribute":[{"name":"value","type":4,"t":{"name":"reshape_shape_AvgPool_DivM_0","dataType":7,"dims":[4],"int64Data":[1,2,3,3]}}]},{"opType":"Constant","input":[],"output":["conv_trip_AvgPool_ConvSum_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_trip_AvgPool_ConvSum_0","dataType":7,"dims":[],"int64Data":[18]}}]},{"opType":"Constant","input":[],"output":["conv_cond_AvgPool_ConvSum_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_cond_AvgPool_ConvSum_0","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["reshape_shape_AvgPool_ConvSum_0"],"attribute":[{"name":"value","type":4,"t":{"name":"reshape_shape_AvgPool_ConvSum_0","dataType":7,"dims":[4],"int64Data":[1,2,3,3]}}]},{"opType":"Constant","input":[],"output":["trip_count_AvgPool_Expand_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"trip_count_AvgPool_Expand_0_expand_add","dataType":7,"dims":[],"int64Data":[60]}}]},{"opType":"Constant","input":[],"output":["cond_AvgPool_Expand_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"cond_AvgPool_Expand_0_expand_add","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["reshape_shape_AvgPool_Expand_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"reshape_shape_AvgPool_Expand_0_expand_add","dataType":7,"dims":[4],"int64Data":[1,2,5,6]}}]},{"opType":"Constant","input":[],"output":["conv_trip_AvgPool_ConvMask_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_trip_AvgPool_ConvMask_0","dataType":7,"dims":[],"int64Data":[18]}}]},{"opType":"Constant","input":[],"output":["conv_cond_AvgPool_ConvMask_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_cond_AvgPool_ConvMask_0","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["reshape_shape_AvgPool_ConvMask_0"],"attribute":[{"name":"value","type":4,"t":{"name":"reshape_shape_AvgPool_ConvMask_0","dataType":7,"dims":[4],"int64Data":[1,2,3,3]}}]},{"opType":"Shape","input":["X"],"output":["AvgPool_ShX_0"],"attribute":[]},{"opType":"ConstantOfShape","input":["AvgPool_ShX_0"],"output":["AvgPool_Expand_0_expand_fill_out"],"attribute":[]},{"opType":"Loop","input":["conv_trip_AvgPool_ConvSum_0","conv_cond_AvgPool_ConvSum_0","conv_init_AvgPool_ConvSum_0"],"output":["loop_out_1"],"attribute":[{"name":"body","type":5,"g":{"name":"loop_body_0","initializer":[],"node":[{"opType":"Constant","input":[],"output":["conv_axes_AvgPool_ConvSum_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_axes_AvgPool_ConvSum_0","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["conv_pads_AvgPool_ConvSum_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_pads_AvgPool_ConvSum_0","dataType":7,"dims":[8],"int64Data":[0,0,1,1,0,0,1,1]}}]},{"opType":"Constant","input":[],"output":["conv_x_flat_shape_AvgPool_ConvSum_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_x_flat_shape_AvgPool_ConvSum_0","dataType":7,"dims":[1],"int64Data":[-1]}}]},{"opType":"Constant","input":[],"output":["conv_w_flat_shape_AvgPool_ConvSum_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_w_flat_shape_AvgPool_ConvSum_0","dataType":7,"dims":[1],"int64Data":[-1]}}]},{"opType":"Constant","input":[],"output":["conv_Wout_AvgPool_ConvSum_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_Wout_AvgPool_ConvSum_0","dataType":7,"dims":[],"int64Data":[3]}}]},{"opType":"Constant","input":[],"output":["conv_Wpad_AvgPool_ConvSum_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_Wpad_AvgPool_ConvSum_0","dataType":7,"dims":[],"int64Data":[8]}}]},{"opType":"Constant","input":[],"output":["conv_Hpad_AvgPool_ConvSum_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_Hpad_AvgPool_ConvSum_0","dataType":7,"dims":[],"int64Data":[7]}}]},{"opType":"Constant","input":[],"output":["conv_C_AvgPool_ConvSum_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_C_AvgPool_ConvSum_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["conv_kW_AvgPool_ConvSum_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kW_AvgPool_ConvSum_0","dataType":7,"dims":[],"int64Data":[3]}}]},{"opType":"Constant","input":[],"output":["conv_kH_AvgPool_ConvSum_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kH_AvgPool_ConvSum_0","dataType":7,"dims":[],"int64Data":[3]}}]},{"opType":"Constant","input":[],"output":["conv_strideH_AvgPool_ConvSum_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_strideH_AvgPool_ConvSum_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["conv_strideW_AvgPool_ConvSum_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_strideW_AvgPool_ConvSum_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["conv_dilH_AvgPool_ConvSum_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_dilH_AvgPool_ConvSum_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["conv_dilW_AvgPool_ConvSum_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_dilW_AvgPool_ConvSum_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["mr_dim_conv_iter_AvgPool_ConvSum_0_3"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_conv_iter_AvgPool_ConvSum_0_3","dataType":7,"dims":[],"int64Data":[3]}}]},{"opType":"Constant","input":[],"output":["mr_dim_conv_iter_AvgPool_ConvSum_0_2"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_conv_iter_AvgPool_ConvSum_0_2","dataType":7,"dims":[],"int64Data":[3]}}]},{"opType":"Constant","input":[],"output":["mr_dim_conv_iter_AvgPool_ConvSum_0_1"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_conv_iter_AvgPool_ConvSum_0_1","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["mr_dim_conv_iter_AvgPool_ConvSum_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_conv_iter_AvgPool_ConvSum_0_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["conv_Cw_AvgPool_ConvSum_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_Cw_AvgPool_ConvSum_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["conv_MperG_AvgPool_ConvSum_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_MperG_AvgPool_ConvSum_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["conv_cRel_AvgPool_ConvSum_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_cRel_AvgPool_ConvSum_0_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["conv_kh_AvgPool_ConvSum_0_0_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kh_AvgPool_ConvSum_0_0_0_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["conv_kw_AvgPool_ConvSum_0_0_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kw_AvgPool_ConvSum_0_0_0_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["conv_kh_AvgPool_ConvSum_0_0_0_1"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kh_AvgPool_ConvSum_0_0_0_1","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["conv_kw_AvgPool_ConvSum_0_0_0_1"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kw_AvgPool_ConvSum_0_0_0_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["conv_kh_AvgPool_ConvSum_0_0_0_2"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kh_AvgPool_ConvSum_0_0_0_2","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["conv_kw_AvgPool_ConvSum_0_0_0_2"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kw_AvgPool_ConvSum_0_0_0_2","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["conv_kh_AvgPool_ConvSum_0_0_1_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kh_AvgPool_ConvSum_0_0_1_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["conv_kw_AvgPool_ConvSum_0_0_1_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kw_AvgPool_ConvSum_0_0_1_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["conv_kh_AvgPool_ConvSum_0_0_1_1"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kh_AvgPool_ConvSum_0_0_1_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["conv_kw_AvgPool_ConvSum_0_0_1_1"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kw_AvgPool_ConvSum_0_0_1_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["conv_kh_AvgPool_ConvSum_0_0_1_2"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kh_AvgPool_ConvSum_0_0_1_2","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["conv_kw_AvgPool_ConvSum_0_0_1_2"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kw_AvgPool_ConvSum_0_0_1_2","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["conv_kh_AvgPool_ConvSum_0_0_2_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kh_AvgPool_ConvSum_0_0_2_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["conv_kw_AvgPool_ConvSum_0_0_2_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kw_AvgPool_ConvSum_0_0_2_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["conv_kh_AvgPool_ConvSum_0_0_2_1"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kh_AvgPool_ConvSum_0_0_2_1","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["conv_kw_AvgPool_ConvSum_0_0_2_1"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kw_AvgPool_ConvSum_0_0_2_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["conv_kh_AvgPool_ConvSum_0_0_2_2"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kh_AvgPool_ConvSum_0_0_2_2","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["conv_kw_AvgPool_ConvSum_0_0_2_2"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kw_AvgPool_ConvSum_0_0_2_2","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Unsqueeze","input":["iter","conv_axes_AvgPool_ConvSum_0"],"output":["conv_unsq_iter_AvgPool_ConvSum_0_out"],"attribute":[]},{"opType":"Pad","input":["X","conv_pads_AvgPool_ConvSum_0"],"output":["conv_x_padded_AvgPool_ConvSum_0"],"attribute":[]},{"opType":"Reshape","input":["conv_x_padded_AvgPool_ConvSum_0","conv_x_flat_shape_AvgPool_ConvSum_0"],"output":["conv_x_flat_AvgPool_ConvSum_0"],"attribute":[]},{"opType":"Reshape","input":["AvgPool_Wones_0","conv_w_flat_shape_AvgPool_ConvSum_0"],"output":["conv_w_flat_AvgPool_ConvSum_0"],"attribute":[]},{"opType":"Mod","input":["iter","mr_dim_conv_iter_AvgPool_ConvSum_0_3"],"output":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_3"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_conv_iter_AvgPool_ConvSum_0_3"],"output":["mr_div_out_conv_iter_AvgPool_ConvSum_0_3"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_conv_iter_AvgPool_ConvSum_0_3","mr_dim_conv_iter_AvgPool_ConvSum_0_2"],"output":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_2"],"attribute":[]},{"opType":"Div","input":["mr_div_out_conv_iter_AvgPool_ConvSum_0_3","mr_dim_conv_iter_AvgPool_ConvSum_0_2"],"output":["mr_div_out_conv_iter_AvgPool_ConvSum_0_2"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_conv_iter_AvgPool_ConvSum_0_2","mr_dim_conv_iter_AvgPool_ConvSum_0_1"],"output":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_1"],"attribute":[]},{"opType":"Div","input":["mr_div_out_conv_iter_AvgPool_ConvSum_0_2","mr_dim_conv_iter_AvgPool_ConvSum_0_1"],"output":["mr_div_out_conv_iter_AvgPool_ConvSum_0_1"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_conv_iter_AvgPool_ConvSum_0_1","mr_dim_conv_iter_AvgPool_ConvSum_0_0"],"output":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_0"],"attribute":[]},{"opType":"Div","input":["mr_div_out_conv_iter_AvgPool_ConvSum_0_1","mr_dim_conv_iter_AvgPool_ConvSum_0_0"],"output":["mr_div_out_conv_iter_AvgPool_ConvSum_0_0"],"attribute":[]},{"opType":"Div","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_1","conv_MperG_AvgPool_ConvSum_0"],"output":["conv_g_AvgPool_ConvSum_0"],"attribute":[]},{"opType":"Mul","input":["conv_g_AvgPool_ConvSum_0","conv_Cw_AvgPool_ConvSum_0"],"output":["conv_gBase_AvgPool_ConvSum_0"],"attribute":[]},{"opType":"Add","input":["conv_gBase_AvgPool_ConvSum_0","conv_cRel_AvgPool_ConvSum_0_0"],"output":["conv_cAbs_AvgPool_ConvSum_0_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_2","conv_strideH_AvgPool_ConvSum_0"],"output":["conv_hoMulStr_out_AvgPool_ConvSum_0_0_0_0"],"attribute":[]},{"opType":"Mul","input":["conv_kh_AvgPool_ConvSum_0_0_0_0","conv_dilH_AvgPool_ConvSum_0"],"output":["conv_khMulDil_out_AvgPool_ConvSum_0_0_0_0"],"attribute":[]},{"opType":"Add","input":["conv_hoMulStr_out_AvgPool_ConvSum_0_0_0_0","conv_khMulDil_out_AvgPool_ConvSum_0_0_0_0"],"output":["conv_hPad_AvgPool_ConvSum_0_0_0_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_3","conv_strideW_AvgPool_ConvSum_0"],"output":["conv_woMulStr_out_AvgPool_ConvSum_0_0_0_0"],"attribute":[]},{"opType":"Mul","input":["conv_kw_AvgPool_ConvSum_0_0_0_0","conv_dilW_AvgPool_ConvSum_0"],"output":["conv_kwMulDil_out_AvgPool_ConvSum_0_0_0_0"],"attribute":[]},{"opType":"Add","input":["conv_woMulStr_out_AvgPool_ConvSum_0_0_0_0","conv_kwMulDil_out_AvgPool_ConvSum_0_0_0_0"],"output":["conv_wPad_AvgPool_ConvSum_0_0_0_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_0","conv_C_AvgPool_ConvSum_0"],"output":["conv_nMulC_out_AvgPool_ConvSum_0_0_0_0"],"attribute":[]},{"opType":"Add","input":["conv_nMulC_out_AvgPool_ConvSum_0_0_0_0","conv_cAbs_AvgPool_ConvSum_0_0"],"output":["conv_ncPlus_out_AvgPool_ConvSum_0_0_0_0"],"attribute":[]},{"opType":"Mul","input":["conv_ncPlus_out_AvgPool_ConvSum_0_0_0_0","conv_Hpad_AvgPool_ConvSum_0"],"output":["conv_mulHpad_out_AvgPool_ConvSum_0_0_0_0"],"attribute":[]},{"opType":"Add","input":["conv_mulHpad_out_AvgPool_ConvSum_0_0_0_0","conv_hPad_AvgPool_ConvSum_0_0_0_0"],"output":["conv_addHpad_out_AvgPool_ConvSum_0_0_0_0"],"attribute":[]},{"opType":"Mul","input":["conv_addHpad_out_AvgPool_ConvSum_0_0_0_0","conv_Wpad_AvgPool_ConvSum_0"],"output":["conv_mulWpad_out_AvgPool_ConvSum_0_0_0_0"],"attribute":[]},{"opType":"Add","input":["conv_mulWpad_out_AvgPool_ConvSum_0_0_0_0","conv_wPad_AvgPool_ConvSum_0_0_0_0"],"output":["conv_xIdx_AvgPool_ConvSum_0_0_0_0"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_xIdx_AvgPool_ConvSum_0_0_0_0","conv_axes_AvgPool_ConvSum_0"],"output":["conv_xIdx_unsq_AvgPool_ConvSum_0_0_0_0_out"],"attribute":[]},{"opType":"Gather","input":["conv_x_flat_AvgPool_ConvSum_0","conv_xIdx_unsq_AvgPool_ConvSum_0_0_0_0_out"],"output":["conv_xVec_AvgPool_ConvSum_0_0_0_0"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_1","conv_Cw_AvgPool_ConvSum_0"],"output":["conv_mMulCw_out_AvgPool_ConvSum_0_0_0_0"],"attribute":[]},{"opType":"Add","input":["conv_mMulCw_out_AvgPool_ConvSum_0_0_0_0","conv_cRel_AvgPool_ConvSum_0_0"],"output":["conv_mPlusCrel_out_AvgPool_ConvSum_0_0_0_0"],"attribute":[]},{"opType":"Mul","input":["conv_mPlusCrel_out_AvgPool_ConvSum_0_0_0_0","conv_kH_AvgPool_ConvSum_0"],"output":["conv_mulkH_out_AvgPool_ConvSum_0_0_0_0"],"attribute":[]},{"opType":"Add","input":["conv_mulkH_out_AvgPool_ConvSum_0_0_0_0","conv_kh_AvgPool_ConvSum_0_0_0_0"],"output":["conv_addKh_out_AvgPool_ConvSum_0_0_0_0"],"attribute":[]},{"opType":"Mul","input":["conv_addKh_out_AvgPool_ConvSum_0_0_0_0","conv_kW_AvgPool_ConvSum_0"],"output":["conv_mulkW_out_AvgPool_ConvSum_0_0_0_0"],"attribute":[]},{"opType":"Add","input":["conv_mulkW_out_AvgPool_ConvSum_0_0_0_0","conv_kw_AvgPool_ConvSum_0_0_0_0"],"output":["conv_wIdx_AvgPool_ConvSum_0_0_0_0"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_wIdx_AvgPool_ConvSum_0_0_0_0","conv_axes_AvgPool_ConvSum_0"],"output":["conv_wIdx_unsq_AvgPool_ConvSum_0_0_0_0_out"],"attribute":[]},{"opType":"Gather","input":["conv_w_flat_AvgPool_ConvSum_0","conv_wIdx_unsq_AvgPool_ConvSum_0_0_0_0_out"],"output":["conv_wVec_AvgPool_ConvSum_0_0_0_0"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["conv_xVec_AvgPool_ConvSum_0_0_0_0","conv_wVec_AvgPool_ConvSum_0_0_0_0"],"output":["conv_term_AvgPool_ConvSum_0_0_0_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_2","conv_strideH_AvgPool_ConvSum_0"],"output":["conv_hoMulStr_out_AvgPool_ConvSum_0_0_0_1"],"attribute":[]},{"opType":"Mul","input":["conv_kh_AvgPool_ConvSum_0_0_0_1","conv_dilH_AvgPool_ConvSum_0"],"output":["conv_khMulDil_out_AvgPool_ConvSum_0_0_0_1"],"attribute":[]},{"opType":"Add","input":["conv_hoMulStr_out_AvgPool_ConvSum_0_0_0_1","conv_khMulDil_out_AvgPool_ConvSum_0_0_0_1"],"output":["conv_hPad_AvgPool_ConvSum_0_0_0_1"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_3","conv_strideW_AvgPool_ConvSum_0"],"output":["conv_woMulStr_out_AvgPool_ConvSum_0_0_0_1"],"attribute":[]},{"opType":"Mul","input":["conv_kw_AvgPool_ConvSum_0_0_0_1","conv_dilW_AvgPool_ConvSum_0"],"output":["conv_kwMulDil_out_AvgPool_ConvSum_0_0_0_1"],"attribute":[]},{"opType":"Add","input":["conv_woMulStr_out_AvgPool_ConvSum_0_0_0_1","conv_kwMulDil_out_AvgPool_ConvSum_0_0_0_1"],"output":["conv_wPad_AvgPool_ConvSum_0_0_0_1"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_0","conv_C_AvgPool_ConvSum_0"],"output":["conv_nMulC_out_AvgPool_ConvSum_0_0_0_1"],"attribute":[]},{"opType":"Add","input":["conv_nMulC_out_AvgPool_ConvSum_0_0_0_1","conv_cAbs_AvgPool_ConvSum_0_0"],"output":["conv_ncPlus_out_AvgPool_ConvSum_0_0_0_1"],"attribute":[]},{"opType":"Mul","input":["conv_ncPlus_out_AvgPool_ConvSum_0_0_0_1","conv_Hpad_AvgPool_ConvSum_0"],"output":["conv_mulHpad_out_AvgPool_ConvSum_0_0_0_1"],"attribute":[]},{"opType":"Add","input":["conv_mulHpad_out_AvgPool_ConvSum_0_0_0_1","conv_hPad_AvgPool_ConvSum_0_0_0_1"],"output":["conv_addHpad_out_AvgPool_ConvSum_0_0_0_1"],"attribute":[]},{"opType":"Mul","input":["conv_addHpad_out_AvgPool_ConvSum_0_0_0_1","conv_Wpad_AvgPool_ConvSum_0"],"output":["conv_mulWpad_out_AvgPool_ConvSum_0_0_0_1"],"attribute":[]},{"opType":"Add","input":["conv_mulWpad_out_AvgPool_ConvSum_0_0_0_1","conv_wPad_AvgPool_ConvSum_0_0_0_1"],"output":["conv_xIdx_AvgPool_ConvSum_0_0_0_1"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_xIdx_AvgPool_ConvSum_0_0_0_1","conv_axes_AvgPool_ConvSum_0"],"output":["conv_xIdx_unsq_AvgPool_ConvSum_0_0_0_1_out"],"attribute":[]},{"opType":"Gather","input":["conv_x_flat_AvgPool_ConvSum_0","conv_xIdx_unsq_AvgPool_ConvSum_0_0_0_1_out"],"output":["conv_xVec_AvgPool_ConvSum_0_0_0_1"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_1","conv_Cw_AvgPool_ConvSum_0"],"output":["conv_mMulCw_out_AvgPool_ConvSum_0_0_0_1"],"attribute":[]},{"opType":"Add","input":["conv_mMulCw_out_AvgPool_ConvSum_0_0_0_1","conv_cRel_AvgPool_ConvSum_0_0"],"output":["conv_mPlusCrel_out_AvgPool_ConvSum_0_0_0_1"],"attribute":[]},{"opType":"Mul","input":["conv_mPlusCrel_out_AvgPool_ConvSum_0_0_0_1","conv_kH_AvgPool_ConvSum_0"],"output":["conv_mulkH_out_AvgPool_ConvSum_0_0_0_1"],"attribute":[]},{"opType":"Add","input":["conv_mulkH_out_AvgPool_ConvSum_0_0_0_1","conv_kh_AvgPool_ConvSum_0_0_0_1"],"output":["conv_addKh_out_AvgPool_ConvSum_0_0_0_1"],"attribute":[]},{"opType":"Mul","input":["conv_addKh_out_AvgPool_ConvSum_0_0_0_1","conv_kW_AvgPool_ConvSum_0"],"output":["conv_mulkW_out_AvgPool_ConvSum_0_0_0_1"],"attribute":[]},{"opType":"Add","input":["conv_mulkW_out_AvgPool_ConvSum_0_0_0_1","conv_kw_AvgPool_ConvSum_0_0_0_1"],"output":["conv_wIdx_AvgPool_ConvSum_0_0_0_1"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_wIdx_AvgPool_ConvSum_0_0_0_1","conv_axes_AvgPool_ConvSum_0"],"output":["conv_wIdx_unsq_AvgPool_ConvSum_0_0_0_1_out"],"attribute":[]},{"opType":"Gather","input":["conv_w_flat_AvgPool_ConvSum_0","conv_wIdx_unsq_AvgPool_ConvSum_0_0_0_1_out"],"output":["conv_wVec_AvgPool_ConvSum_0_0_0_1"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["conv_xVec_AvgPool_ConvSum_0_0_0_1","conv_wVec_AvgPool_ConvSum_0_0_0_1"],"output":["conv_term_AvgPool_ConvSum_0_0_0_1"],"attribute":[]},{"opType":"Add","input":["conv_term_AvgPool_ConvSum_0_0_0_0","conv_term_AvgPool_ConvSum_0_0_0_1"],"output":["conv_acc_AvgPool_ConvSum_0_0_0_1"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_2","conv_strideH_AvgPool_ConvSum_0"],"output":["conv_hoMulStr_out_AvgPool_ConvSum_0_0_0_2"],"attribute":[]},{"opType":"Mul","input":["conv_kh_AvgPool_ConvSum_0_0_0_2","conv_dilH_AvgPool_ConvSum_0"],"output":["conv_khMulDil_out_AvgPool_ConvSum_0_0_0_2"],"attribute":[]},{"opType":"Add","input":["conv_hoMulStr_out_AvgPool_ConvSum_0_0_0_2","conv_khMulDil_out_AvgPool_ConvSum_0_0_0_2"],"output":["conv_hPad_AvgPool_ConvSum_0_0_0_2"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_3","conv_strideW_AvgPool_ConvSum_0"],"output":["conv_woMulStr_out_AvgPool_ConvSum_0_0_0_2"],"attribute":[]},{"opType":"Mul","input":["conv_kw_AvgPool_ConvSum_0_0_0_2","conv_dilW_AvgPool_ConvSum_0"],"output":["conv_kwMulDil_out_AvgPool_ConvSum_0_0_0_2"],"attribute":[]},{"opType":"Add","input":["conv_woMulStr_out_AvgPool_ConvSum_0_0_0_2","conv_kwMulDil_out_AvgPool_ConvSum_0_0_0_2"],"output":["conv_wPad_AvgPool_ConvSum_0_0_0_2"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_0","conv_C_AvgPool_ConvSum_0"],"output":["conv_nMulC_out_AvgPool_ConvSum_0_0_0_2"],"attribute":[]},{"opType":"Add","input":["conv_nMulC_out_AvgPool_ConvSum_0_0_0_2","conv_cAbs_AvgPool_ConvSum_0_0"],"output":["conv_ncPlus_out_AvgPool_ConvSum_0_0_0_2"],"attribute":[]},{"opType":"Mul","input":["conv_ncPlus_out_AvgPool_ConvSum_0_0_0_2","conv_Hpad_AvgPool_ConvSum_0"],"output":["conv_mulHpad_out_AvgPool_ConvSum_0_0_0_2"],"attribute":[]},{"opType":"Add","input":["conv_mulHpad_out_AvgPool_ConvSum_0_0_0_2","conv_hPad_AvgPool_ConvSum_0_0_0_2"],"output":["conv_addHpad_out_AvgPool_ConvSum_0_0_0_2"],"attribute":[]},{"opType":"Mul","input":["conv_addHpad_out_AvgPool_ConvSum_0_0_0_2","conv_Wpad_AvgPool_ConvSum_0"],"output":["conv_mulWpad_out_AvgPool_ConvSum_0_0_0_2"],"attribute":[]},{"opType":"Add","input":["conv_mulWpad_out_AvgPool_ConvSum_0_0_0_2","conv_wPad_AvgPool_ConvSum_0_0_0_2"],"output":["conv_xIdx_AvgPool_ConvSum_0_0_0_2"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_xIdx_AvgPool_ConvSum_0_0_0_2","conv_axes_AvgPool_ConvSum_0"],"output":["conv_xIdx_unsq_AvgPool_ConvSum_0_0_0_2_out"],"attribute":[]},{"opType":"Gather","input":["conv_x_flat_AvgPool_ConvSum_0","conv_xIdx_unsq_AvgPool_ConvSum_0_0_0_2_out"],"output":["conv_xVec_AvgPool_ConvSum_0_0_0_2"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_1","conv_Cw_AvgPool_ConvSum_0"],"output":["conv_mMulCw_out_AvgPool_ConvSum_0_0_0_2"],"attribute":[]},{"opType":"Add","input":["conv_mMulCw_out_AvgPool_ConvSum_0_0_0_2","conv_cRel_AvgPool_ConvSum_0_0"],"output":["conv_mPlusCrel_out_AvgPool_ConvSum_0_0_0_2"],"attribute":[]},{"opType":"Mul","input":["conv_mPlusCrel_out_AvgPool_ConvSum_0_0_0_2","conv_kH_AvgPool_ConvSum_0"],"output":["conv_mulkH_out_AvgPool_ConvSum_0_0_0_2"],"attribute":[]},{"opType":"Add","input":["conv_mulkH_out_AvgPool_ConvSum_0_0_0_2","conv_kh_AvgPool_ConvSum_0_0_0_2"],"output":["conv_addKh_out_AvgPool_ConvSum_0_0_0_2"],"attribute":[]},{"opType":"Mul","input":["conv_addKh_out_AvgPool_ConvSum_0_0_0_2","conv_kW_AvgPool_ConvSum_0"],"output":["conv_mulkW_out_AvgPool_ConvSum_0_0_0_2"],"attribute":[]},{"opType":"Add","input":["conv_mulkW_out_AvgPool_ConvSum_0_0_0_2","conv_kw_AvgPool_ConvSum_0_0_0_2"],"output":["conv_wIdx_AvgPool_ConvSum_0_0_0_2"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_wIdx_AvgPool_ConvSum_0_0_0_2","conv_axes_AvgPool_ConvSum_0"],"output":["conv_wIdx_unsq_AvgPool_ConvSum_0_0_0_2_out"],"attribute":[]},{"opType":"Gather","input":["conv_w_flat_AvgPool_ConvSum_0","conv_wIdx_unsq_AvgPool_ConvSum_0_0_0_2_out"],"output":["conv_wVec_AvgPool_ConvSum_0_0_0_2"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["conv_xVec_AvgPool_ConvSum_0_0_0_2","conv_wVec_AvgPool_ConvSum_0_0_0_2"],"output":["conv_term_AvgPool_ConvSum_0_0_0_2"],"attribute":[]},{"opType":"Add","input":["conv_acc_AvgPool_ConvSum_0_0_0_1","conv_term_AvgPool_ConvSum_0_0_0_2"],"output":["conv_acc_AvgPool_ConvSum_0_0_0_2"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_2","conv_strideH_AvgPool_ConvSum_0"],"output":["conv_hoMulStr_out_AvgPool_ConvSum_0_0_1_0"],"attribute":[]},{"opType":"Mul","input":["conv_kh_AvgPool_ConvSum_0_0_1_0","conv_dilH_AvgPool_ConvSum_0"],"output":["conv_khMulDil_out_AvgPool_ConvSum_0_0_1_0"],"attribute":[]},{"opType":"Add","input":["conv_hoMulStr_out_AvgPool_ConvSum_0_0_1_0","conv_khMulDil_out_AvgPool_ConvSum_0_0_1_0"],"output":["conv_hPad_AvgPool_ConvSum_0_0_1_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_3","conv_strideW_AvgPool_ConvSum_0"],"output":["conv_woMulStr_out_AvgPool_ConvSum_0_0_1_0"],"attribute":[]},{"opType":"Mul","input":["conv_kw_AvgPool_ConvSum_0_0_1_0","conv_dilW_AvgPool_ConvSum_0"],"output":["conv_kwMulDil_out_AvgPool_ConvSum_0_0_1_0"],"attribute":[]},{"opType":"Add","input":["conv_woMulStr_out_AvgPool_ConvSum_0_0_1_0","conv_kwMulDil_out_AvgPool_ConvSum_0_0_1_0"],"output":["conv_wPad_AvgPool_ConvSum_0_0_1_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_0","conv_C_AvgPool_ConvSum_0"],"output":["conv_nMulC_out_AvgPool_ConvSum_0_0_1_0"],"attribute":[]},{"opType":"Add","input":["conv_nMulC_out_AvgPool_ConvSum_0_0_1_0","conv_cAbs_AvgPool_ConvSum_0_0"],"output":["conv_ncPlus_out_AvgPool_ConvSum_0_0_1_0"],"attribute":[]},{"opType":"Mul","input":["conv_ncPlus_out_AvgPool_ConvSum_0_0_1_0","conv_Hpad_AvgPool_ConvSum_0"],"output":["conv_mulHpad_out_AvgPool_ConvSum_0_0_1_0"],"attribute":[]},{"opType":"Add","input":["conv_mulHpad_out_AvgPool_ConvSum_0_0_1_0","conv_hPad_AvgPool_ConvSum_0_0_1_0"],"output":["conv_addHpad_out_AvgPool_ConvSum_0_0_1_0"],"attribute":[]},{"opType":"Mul","input":["conv_addHpad_out_AvgPool_ConvSum_0_0_1_0","conv_Wpad_AvgPool_ConvSum_0"],"output":["conv_mulWpad_out_AvgPool_ConvSum_0_0_1_0"],"attribute":[]},{"opType":"Add","input":["conv_mulWpad_out_AvgPool_ConvSum_0_0_1_0","conv_wPad_AvgPool_ConvSum_0_0_1_0"],"output":["conv_xIdx_AvgPool_ConvSum_0_0_1_0"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_xIdx_AvgPool_ConvSum_0_0_1_0","conv_axes_AvgPool_ConvSum_0"],"output":["conv_xIdx_unsq_AvgPool_ConvSum_0_0_1_0_out"],"attribute":[]},{"opType":"Gather","input":["conv_x_flat_AvgPool_ConvSum_0","conv_xIdx_unsq_AvgPool_ConvSum_0_0_1_0_out"],"output":["conv_xVec_AvgPool_ConvSum_0_0_1_0"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_1","conv_Cw_AvgPool_ConvSum_0"],"output":["conv_mMulCw_out_AvgPool_ConvSum_0_0_1_0"],"attribute":[]},{"opType":"Add","input":["conv_mMulCw_out_AvgPool_ConvSum_0_0_1_0","conv_cRel_AvgPool_ConvSum_0_0"],"output":["conv_mPlusCrel_out_AvgPool_ConvSum_0_0_1_0"],"attribute":[]},{"opType":"Mul","input":["conv_mPlusCrel_out_AvgPool_ConvSum_0_0_1_0","conv_kH_AvgPool_ConvSum_0"],"output":["conv_mulkH_out_AvgPool_ConvSum_0_0_1_0"],"attribute":[]},{"opType":"Add","input":["conv_mulkH_out_AvgPool_ConvSum_0_0_1_0","conv_kh_AvgPool_ConvSum_0_0_1_0"],"output":["conv_addKh_out_AvgPool_ConvSum_0_0_1_0"],"attribute":[]},{"opType":"Mul","input":["conv_addKh_out_AvgPool_ConvSum_0_0_1_0","conv_kW_AvgPool_ConvSum_0"],"output":["conv_mulkW_out_AvgPool_ConvSum_0_0_1_0"],"attribute":[]},{"opType":"Add","input":["conv_mulkW_out_AvgPool_ConvSum_0_0_1_0","conv_kw_AvgPool_ConvSum_0_0_1_0"],"output":["conv_wIdx_AvgPool_ConvSum_0_0_1_0"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_wIdx_AvgPool_ConvSum_0_0_1_0","conv_axes_AvgPool_ConvSum_0"],"output":["conv_wIdx_unsq_AvgPool_ConvSum_0_0_1_0_out"],"attribute":[]},{"opType":"Gather","input":["conv_w_flat_AvgPool_ConvSum_0","conv_wIdx_unsq_AvgPool_ConvSum_0_0_1_0_out"],"output":["conv_wVec_AvgPool_ConvSum_0_0_1_0"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["conv_xVec_AvgPool_ConvSum_0_0_1_0","conv_wVec_AvgPool_ConvSum_0_0_1_0"],"output":["conv_term_AvgPool_ConvSum_0_0_1_0"],"attribute":[]},{"opType":"Add","input":["conv_acc_AvgPool_ConvSum_0_0_0_2","conv_term_AvgPool_ConvSum_0_0_1_0"],"output":["conv_acc_AvgPool_ConvSum_0_0_1_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_2","conv_strideH_AvgPool_ConvSum_0"],"output":["conv_hoMulStr_out_AvgPool_ConvSum_0_0_1_1"],"attribute":[]},{"opType":"Mul","input":["conv_kh_AvgPool_ConvSum_0_0_1_1","conv_dilH_AvgPool_ConvSum_0"],"output":["conv_khMulDil_out_AvgPool_ConvSum_0_0_1_1"],"attribute":[]},{"opType":"Add","input":["conv_hoMulStr_out_AvgPool_ConvSum_0_0_1_1","conv_khMulDil_out_AvgPool_ConvSum_0_0_1_1"],"output":["conv_hPad_AvgPool_ConvSum_0_0_1_1"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_3","conv_strideW_AvgPool_ConvSum_0"],"output":["conv_woMulStr_out_AvgPool_ConvSum_0_0_1_1"],"attribute":[]},{"opType":"Mul","input":["conv_kw_AvgPool_ConvSum_0_0_1_1","conv_dilW_AvgPool_ConvSum_0"],"output":["conv_kwMulDil_out_AvgPool_ConvSum_0_0_1_1"],"attribute":[]},{"opType":"Add","input":["conv_woMulStr_out_AvgPool_ConvSum_0_0_1_1","conv_kwMulDil_out_AvgPool_ConvSum_0_0_1_1"],"output":["conv_wPad_AvgPool_ConvSum_0_0_1_1"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_0","conv_C_AvgPool_ConvSum_0"],"output":["conv_nMulC_out_AvgPool_ConvSum_0_0_1_1"],"attribute":[]},{"opType":"Add","input":["conv_nMulC_out_AvgPool_ConvSum_0_0_1_1","conv_cAbs_AvgPool_ConvSum_0_0"],"output":["conv_ncPlus_out_AvgPool_ConvSum_0_0_1_1"],"attribute":[]},{"opType":"Mul","input":["conv_ncPlus_out_AvgPool_ConvSum_0_0_1_1","conv_Hpad_AvgPool_ConvSum_0"],"output":["conv_mulHpad_out_AvgPool_ConvSum_0_0_1_1"],"attribute":[]},{"opType":"Add","input":["conv_mulHpad_out_AvgPool_ConvSum_0_0_1_1","conv_hPad_AvgPool_ConvSum_0_0_1_1"],"output":["conv_addHpad_out_AvgPool_ConvSum_0_0_1_1"],"attribute":[]},{"opType":"Mul","input":["conv_addHpad_out_AvgPool_ConvSum_0_0_1_1","conv_Wpad_AvgPool_ConvSum_0"],"output":["conv_mulWpad_out_AvgPool_ConvSum_0_0_1_1"],"attribute":[]},{"opType":"Add","input":["conv_mulWpad_out_AvgPool_ConvSum_0_0_1_1","conv_wPad_AvgPool_ConvSum_0_0_1_1"],"output":["conv_xIdx_AvgPool_ConvSum_0_0_1_1"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_xIdx_AvgPool_ConvSum_0_0_1_1","conv_axes_AvgPool_ConvSum_0"],"output":["conv_xIdx_unsq_AvgPool_ConvSum_0_0_1_1_out"],"attribute":[]},{"opType":"Gather","input":["conv_x_flat_AvgPool_ConvSum_0","conv_xIdx_unsq_AvgPool_ConvSum_0_0_1_1_out"],"output":["conv_xVec_AvgPool_ConvSum_0_0_1_1"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_1","conv_Cw_AvgPool_ConvSum_0"],"output":["conv_mMulCw_out_AvgPool_ConvSum_0_0_1_1"],"attribute":[]},{"opType":"Add","input":["conv_mMulCw_out_AvgPool_ConvSum_0_0_1_1","conv_cRel_AvgPool_ConvSum_0_0"],"output":["conv_mPlusCrel_out_AvgPool_ConvSum_0_0_1_1"],"attribute":[]},{"opType":"Mul","input":["conv_mPlusCrel_out_AvgPool_ConvSum_0_0_1_1","conv_kH_AvgPool_ConvSum_0"],"output":["conv_mulkH_out_AvgPool_ConvSum_0_0_1_1"],"attribute":[]},{"opType":"Add","input":["conv_mulkH_out_AvgPool_ConvSum_0_0_1_1","conv_kh_AvgPool_ConvSum_0_0_1_1"],"output":["conv_addKh_out_AvgPool_ConvSum_0_0_1_1"],"attribute":[]},{"opType":"Mul","input":["conv_addKh_out_AvgPool_ConvSum_0_0_1_1","conv_kW_AvgPool_ConvSum_0"],"output":["conv_mulkW_out_AvgPool_ConvSum_0_0_1_1"],"attribute":[]},{"opType":"Add","input":["conv_mulkW_out_AvgPool_ConvSum_0_0_1_1","conv_kw_AvgPool_ConvSum_0_0_1_1"],"output":["conv_wIdx_AvgPool_ConvSum_0_0_1_1"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_wIdx_AvgPool_ConvSum_0_0_1_1","conv_axes_AvgPool_ConvSum_0"],"output":["conv_wIdx_unsq_AvgPool_ConvSum_0_0_1_1_out"],"attribute":[]},{"opType":"Gather","input":["conv_w_flat_AvgPool_ConvSum_0","conv_wIdx_unsq_AvgPool_ConvSum_0_0_1_1_out"],"output":["conv_wVec_AvgPool_ConvSum_0_0_1_1"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["conv_xVec_AvgPool_ConvSum_0_0_1_1","conv_wVec_AvgPool_ConvSum_0_0_1_1"],"output":["conv_term_AvgPool_ConvSum_0_0_1_1"],"attribute":[]},{"opType":"Add","input":["conv_acc_AvgPool_ConvSum_0_0_1_0","conv_term_AvgPool_ConvSum_0_0_1_1"],"output":["conv_acc_AvgPool_ConvSum_0_0_1_1"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_2","conv_strideH_AvgPool_ConvSum_0"],"output":["conv_hoMulStr_out_AvgPool_ConvSum_0_0_1_2"],"attribute":[]},{"opType":"Mul","input":["conv_kh_AvgPool_ConvSum_0_0_1_2","conv_dilH_AvgPool_ConvSum_0"],"output":["conv_khMulDil_out_AvgPool_ConvSum_0_0_1_2"],"attribute":[]},{"opType":"Add","input":["conv_hoMulStr_out_AvgPool_ConvSum_0_0_1_2","conv_khMulDil_out_AvgPool_ConvSum_0_0_1_2"],"output":["conv_hPad_AvgPool_ConvSum_0_0_1_2"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_3","conv_strideW_AvgPool_ConvSum_0"],"output":["conv_woMulStr_out_AvgPool_ConvSum_0_0_1_2"],"attribute":[]},{"opType":"Mul","input":["conv_kw_AvgPool_ConvSum_0_0_1_2","conv_dilW_AvgPool_ConvSum_0"],"output":["conv_kwMulDil_out_AvgPool_ConvSum_0_0_1_2"],"attribute":[]},{"opType":"Add","input":["conv_woMulStr_out_AvgPool_ConvSum_0_0_1_2","conv_kwMulDil_out_AvgPool_ConvSum_0_0_1_2"],"output":["conv_wPad_AvgPool_ConvSum_0_0_1_2"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_0","conv_C_AvgPool_ConvSum_0"],"output":["conv_nMulC_out_AvgPool_ConvSum_0_0_1_2"],"attribute":[]},{"opType":"Add","input":["conv_nMulC_out_AvgPool_ConvSum_0_0_1_2","conv_cAbs_AvgPool_ConvSum_0_0"],"output":["conv_ncPlus_out_AvgPool_ConvSum_0_0_1_2"],"attribute":[]},{"opType":"Mul","input":["conv_ncPlus_out_AvgPool_ConvSum_0_0_1_2","conv_Hpad_AvgPool_ConvSum_0"],"output":["conv_mulHpad_out_AvgPool_ConvSum_0_0_1_2"],"attribute":[]},{"opType":"Add","input":["conv_mulHpad_out_AvgPool_ConvSum_0_0_1_2","conv_hPad_AvgPool_ConvSum_0_0_1_2"],"output":["conv_addHpad_out_AvgPool_ConvSum_0_0_1_2"],"attribute":[]},{"opType":"Mul","input":["conv_addHpad_out_AvgPool_ConvSum_0_0_1_2","conv_Wpad_AvgPool_ConvSum_0"],"output":["conv_mulWpad_out_AvgPool_ConvSum_0_0_1_2"],"attribute":[]},{"opType":"Add","input":["conv_mulWpad_out_AvgPool_ConvSum_0_0_1_2","conv_wPad_AvgPool_ConvSum_0_0_1_2"],"output":["conv_xIdx_AvgPool_ConvSum_0_0_1_2"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_xIdx_AvgPool_ConvSum_0_0_1_2","conv_axes_AvgPool_ConvSum_0"],"output":["conv_xIdx_unsq_AvgPool_ConvSum_0_0_1_2_out"],"attribute":[]},{"opType":"Gather","input":["conv_x_flat_AvgPool_ConvSum_0","conv_xIdx_unsq_AvgPool_ConvSum_0_0_1_2_out"],"output":["conv_xVec_AvgPool_ConvSum_0_0_1_2"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_1","conv_Cw_AvgPool_ConvSum_0"],"output":["conv_mMulCw_out_AvgPool_ConvSum_0_0_1_2"],"attribute":[]},{"opType":"Add","input":["conv_mMulCw_out_AvgPool_ConvSum_0_0_1_2","conv_cRel_AvgPool_ConvSum_0_0"],"output":["conv_mPlusCrel_out_AvgPool_ConvSum_0_0_1_2"],"attribute":[]},{"opType":"Mul","input":["conv_mPlusCrel_out_AvgPool_ConvSum_0_0_1_2","conv_kH_AvgPool_ConvSum_0"],"output":["conv_mulkH_out_AvgPool_ConvSum_0_0_1_2"],"attribute":[]},{"opType":"Add","input":["conv_mulkH_out_AvgPool_ConvSum_0_0_1_2","conv_kh_AvgPool_ConvSum_0_0_1_2"],"output":["conv_addKh_out_AvgPool_ConvSum_0_0_1_2"],"attribute":[]},{"opType":"Mul","input":["conv_addKh_out_AvgPool_ConvSum_0_0_1_2","conv_kW_AvgPool_ConvSum_0"],"output":["conv_mulkW_out_AvgPool_ConvSum_0_0_1_2"],"attribute":[]},{"opType":"Add","input":["conv_mulkW_out_AvgPool_ConvSum_0_0_1_2","conv_kw_AvgPool_ConvSum_0_0_1_2"],"output":["conv_wIdx_AvgPool_ConvSum_0_0_1_2"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_wIdx_AvgPool_ConvSum_0_0_1_2","conv_axes_AvgPool_ConvSum_0"],"output":["conv_wIdx_unsq_AvgPool_ConvSum_0_0_1_2_out"],"attribute":[]},{"opType":"Gather","input":["conv_w_flat_AvgPool_ConvSum_0","conv_wIdx_unsq_AvgPool_ConvSum_0_0_1_2_out"],"output":["conv_wVec_AvgPool_ConvSum_0_0_1_2"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["conv_xVec_AvgPool_ConvSum_0_0_1_2","conv_wVec_AvgPool_ConvSum_0_0_1_2"],"output":["conv_term_AvgPool_ConvSum_0_0_1_2"],"attribute":[]},{"opType":"Add","input":["conv_acc_AvgPool_ConvSum_0_0_1_1","conv_term_AvgPool_ConvSum_0_0_1_2"],"output":["conv_acc_AvgPool_ConvSum_0_0_1_2"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_2","conv_strideH_AvgPool_ConvSum_0"],"output":["conv_hoMulStr_out_AvgPool_ConvSum_0_0_2_0"],"attribute":[]},{"opType":"Mul","input":["conv_kh_AvgPool_ConvSum_0_0_2_0","conv_dilH_AvgPool_ConvSum_0"],"output":["conv_khMulDil_out_AvgPool_ConvSum_0_0_2_0"],"attribute":[]},{"opType":"Add","input":["conv_hoMulStr_out_AvgPool_ConvSum_0_0_2_0","conv_khMulDil_out_AvgPool_ConvSum_0_0_2_0"],"output":["conv_hPad_AvgPool_ConvSum_0_0_2_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_3","conv_strideW_AvgPool_ConvSum_0"],"output":["conv_woMulStr_out_AvgPool_ConvSum_0_0_2_0"],"attribute":[]},{"opType":"Mul","input":["conv_kw_AvgPool_ConvSum_0_0_2_0","conv_dilW_AvgPool_ConvSum_0"],"output":["conv_kwMulDil_out_AvgPool_ConvSum_0_0_2_0"],"attribute":[]},{"opType":"Add","input":["conv_woMulStr_out_AvgPool_ConvSum_0_0_2_0","conv_kwMulDil_out_AvgPool_ConvSum_0_0_2_0"],"output":["conv_wPad_AvgPool_ConvSum_0_0_2_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_0","conv_C_AvgPool_ConvSum_0"],"output":["conv_nMulC_out_AvgPool_ConvSum_0_0_2_0"],"attribute":[]},{"opType":"Add","input":["conv_nMulC_out_AvgPool_ConvSum_0_0_2_0","conv_cAbs_AvgPool_ConvSum_0_0"],"output":["conv_ncPlus_out_AvgPool_ConvSum_0_0_2_0"],"attribute":[]},{"opType":"Mul","input":["conv_ncPlus_out_AvgPool_ConvSum_0_0_2_0","conv_Hpad_AvgPool_ConvSum_0"],"output":["conv_mulHpad_out_AvgPool_ConvSum_0_0_2_0"],"attribute":[]},{"opType":"Add","input":["conv_mulHpad_out_AvgPool_ConvSum_0_0_2_0","conv_hPad_AvgPool_ConvSum_0_0_2_0"],"output":["conv_addHpad_out_AvgPool_ConvSum_0_0_2_0"],"attribute":[]},{"opType":"Mul","input":["conv_addHpad_out_AvgPool_ConvSum_0_0_2_0","conv_Wpad_AvgPool_ConvSum_0"],"output":["conv_mulWpad_out_AvgPool_ConvSum_0_0_2_0"],"attribute":[]},{"opType":"Add","input":["conv_mulWpad_out_AvgPool_ConvSum_0_0_2_0","conv_wPad_AvgPool_ConvSum_0_0_2_0"],"output":["conv_xIdx_AvgPool_ConvSum_0_0_2_0"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_xIdx_AvgPool_ConvSum_0_0_2_0","conv_axes_AvgPool_ConvSum_0"],"output":["conv_xIdx_unsq_AvgPool_ConvSum_0_0_2_0_out"],"attribute":[]},{"opType":"Gather","input":["conv_x_flat_AvgPool_ConvSum_0","conv_xIdx_unsq_AvgPool_ConvSum_0_0_2_0_out"],"output":["conv_xVec_AvgPool_ConvSum_0_0_2_0"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_1","conv_Cw_AvgPool_ConvSum_0"],"output":["conv_mMulCw_out_AvgPool_ConvSum_0_0_2_0"],"attribute":[]},{"opType":"Add","input":["conv_mMulCw_out_AvgPool_ConvSum_0_0_2_0","conv_cRel_AvgPool_ConvSum_0_0"],"output":["conv_mPlusCrel_out_AvgPool_ConvSum_0_0_2_0"],"attribute":[]},{"opType":"Mul","input":["conv_mPlusCrel_out_AvgPool_ConvSum_0_0_2_0","conv_kH_AvgPool_ConvSum_0"],"output":["conv_mulkH_out_AvgPool_ConvSum_0_0_2_0"],"attribute":[]},{"opType":"Add","input":["conv_mulkH_out_AvgPool_ConvSum_0_0_2_0","conv_kh_AvgPool_ConvSum_0_0_2_0"],"output":["conv_addKh_out_AvgPool_ConvSum_0_0_2_0"],"attribute":[]},{"opType":"Mul","input":["conv_addKh_out_AvgPool_ConvSum_0_0_2_0","conv_kW_AvgPool_ConvSum_0"],"output":["conv_mulkW_out_AvgPool_ConvSum_0_0_2_0"],"attribute":[]},{"opType":"Add","input":["conv_mulkW_out_AvgPool_ConvSum_0_0_2_0","conv_kw_AvgPool_ConvSum_0_0_2_0"],"output":["conv_wIdx_AvgPool_ConvSum_0_0_2_0"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_wIdx_AvgPool_ConvSum_0_0_2_0","conv_axes_AvgPool_ConvSum_0"],"output":["conv_wIdx_unsq_AvgPool_ConvSum_0_0_2_0_out"],"attribute":[]},{"opType":"Gather","input":["conv_w_flat_AvgPool_ConvSum_0","conv_wIdx_unsq_AvgPool_ConvSum_0_0_2_0_out"],"output":["conv_wVec_AvgPool_ConvSum_0_0_2_0"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["conv_xVec_AvgPool_ConvSum_0_0_2_0","conv_wVec_AvgPool_ConvSum_0_0_2_0"],"output":["conv_term_AvgPool_ConvSum_0_0_2_0"],"attribute":[]},{"opType":"Add","input":["conv_acc_AvgPool_ConvSum_0_0_1_2","conv_term_AvgPool_ConvSum_0_0_2_0"],"output":["conv_acc_AvgPool_ConvSum_0_0_2_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_2","conv_strideH_AvgPool_ConvSum_0"],"output":["conv_hoMulStr_out_AvgPool_ConvSum_0_0_2_1"],"attribute":[]},{"opType":"Mul","input":["conv_kh_AvgPool_ConvSum_0_0_2_1","conv_dilH_AvgPool_ConvSum_0"],"output":["conv_khMulDil_out_AvgPool_ConvSum_0_0_2_1"],"attribute":[]},{"opType":"Add","input":["conv_hoMulStr_out_AvgPool_ConvSum_0_0_2_1","conv_khMulDil_out_AvgPool_ConvSum_0_0_2_1"],"output":["conv_hPad_AvgPool_ConvSum_0_0_2_1"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_3","conv_strideW_AvgPool_ConvSum_0"],"output":["conv_woMulStr_out_AvgPool_ConvSum_0_0_2_1"],"attribute":[]},{"opType":"Mul","input":["conv_kw_AvgPool_ConvSum_0_0_2_1","conv_dilW_AvgPool_ConvSum_0"],"output":["conv_kwMulDil_out_AvgPool_ConvSum_0_0_2_1"],"attribute":[]},{"opType":"Add","input":["conv_woMulStr_out_AvgPool_ConvSum_0_0_2_1","conv_kwMulDil_out_AvgPool_ConvSum_0_0_2_1"],"output":["conv_wPad_AvgPool_ConvSum_0_0_2_1"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_0","conv_C_AvgPool_ConvSum_0"],"output":["conv_nMulC_out_AvgPool_ConvSum_0_0_2_1"],"attribute":[]},{"opType":"Add","input":["conv_nMulC_out_AvgPool_ConvSum_0_0_2_1","conv_cAbs_AvgPool_ConvSum_0_0"],"output":["conv_ncPlus_out_AvgPool_ConvSum_0_0_2_1"],"attribute":[]},{"opType":"Mul","input":["conv_ncPlus_out_AvgPool_ConvSum_0_0_2_1","conv_Hpad_AvgPool_ConvSum_0"],"output":["conv_mulHpad_out_AvgPool_ConvSum_0_0_2_1"],"attribute":[]},{"opType":"Add","input":["conv_mulHpad_out_AvgPool_ConvSum_0_0_2_1","conv_hPad_AvgPool_ConvSum_0_0_2_1"],"output":["conv_addHpad_out_AvgPool_ConvSum_0_0_2_1"],"attribute":[]},{"opType":"Mul","input":["conv_addHpad_out_AvgPool_ConvSum_0_0_2_1","conv_Wpad_AvgPool_ConvSum_0"],"output":["conv_mulWpad_out_AvgPool_ConvSum_0_0_2_1"],"attribute":[]},{"opType":"Add","input":["conv_mulWpad_out_AvgPool_ConvSum_0_0_2_1","conv_wPad_AvgPool_ConvSum_0_0_2_1"],"output":["conv_xIdx_AvgPool_ConvSum_0_0_2_1"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_xIdx_AvgPool_ConvSum_0_0_2_1","conv_axes_AvgPool_ConvSum_0"],"output":["conv_xIdx_unsq_AvgPool_ConvSum_0_0_2_1_out"],"attribute":[]},{"opType":"Gather","input":["conv_x_flat_AvgPool_ConvSum_0","conv_xIdx_unsq_AvgPool_ConvSum_0_0_2_1_out"],"output":["conv_xVec_AvgPool_ConvSum_0_0_2_1"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_1","conv_Cw_AvgPool_ConvSum_0"],"output":["conv_mMulCw_out_AvgPool_ConvSum_0_0_2_1"],"attribute":[]},{"opType":"Add","input":["conv_mMulCw_out_AvgPool_ConvSum_0_0_2_1","conv_cRel_AvgPool_ConvSum_0_0"],"output":["conv_mPlusCrel_out_AvgPool_ConvSum_0_0_2_1"],"attribute":[]},{"opType":"Mul","input":["conv_mPlusCrel_out_AvgPool_ConvSum_0_0_2_1","conv_kH_AvgPool_ConvSum_0"],"output":["conv_mulkH_out_AvgPool_ConvSum_0_0_2_1"],"attribute":[]},{"opType":"Add","input":["conv_mulkH_out_AvgPool_ConvSum_0_0_2_1","conv_kh_AvgPool_ConvSum_0_0_2_1"],"output":["conv_addKh_out_AvgPool_ConvSum_0_0_2_1"],"attribute":[]},{"opType":"Mul","input":["conv_addKh_out_AvgPool_ConvSum_0_0_2_1","conv_kW_AvgPool_ConvSum_0"],"output":["conv_mulkW_out_AvgPool_ConvSum_0_0_2_1"],"attribute":[]},{"opType":"Add","input":["conv_mulkW_out_AvgPool_ConvSum_0_0_2_1","conv_kw_AvgPool_ConvSum_0_0_2_1"],"output":["conv_wIdx_AvgPool_ConvSum_0_0_2_1"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_wIdx_AvgPool_ConvSum_0_0_2_1","conv_axes_AvgPool_ConvSum_0"],"output":["conv_wIdx_unsq_AvgPool_ConvSum_0_0_2_1_out"],"attribute":[]},{"opType":"Gather","input":["conv_w_flat_AvgPool_ConvSum_0","conv_wIdx_unsq_AvgPool_ConvSum_0_0_2_1_out"],"output":["conv_wVec_AvgPool_ConvSum_0_0_2_1"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["conv_xVec_AvgPool_ConvSum_0_0_2_1","conv_wVec_AvgPool_ConvSum_0_0_2_1"],"output":["conv_term_AvgPool_ConvSum_0_0_2_1"],"attribute":[]},{"opType":"Add","input":["conv_acc_AvgPool_ConvSum_0_0_2_0","conv_term_AvgPool_ConvSum_0_0_2_1"],"output":["conv_acc_AvgPool_ConvSum_0_0_2_1"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_2","conv_strideH_AvgPool_ConvSum_0"],"output":["conv_hoMulStr_out_AvgPool_ConvSum_0_0_2_2"],"attribute":[]},{"opType":"Mul","input":["conv_kh_AvgPool_ConvSum_0_0_2_2","conv_dilH_AvgPool_ConvSum_0"],"output":["conv_khMulDil_out_AvgPool_ConvSum_0_0_2_2"],"attribute":[]},{"opType":"Add","input":["conv_hoMulStr_out_AvgPool_ConvSum_0_0_2_2","conv_khMulDil_out_AvgPool_ConvSum_0_0_2_2"],"output":["conv_hPad_AvgPool_ConvSum_0_0_2_2"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_3","conv_strideW_AvgPool_ConvSum_0"],"output":["conv_woMulStr_out_AvgPool_ConvSum_0_0_2_2"],"attribute":[]},{"opType":"Mul","input":["conv_kw_AvgPool_ConvSum_0_0_2_2","conv_dilW_AvgPool_ConvSum_0"],"output":["conv_kwMulDil_out_AvgPool_ConvSum_0_0_2_2"],"attribute":[]},{"opType":"Add","input":["conv_woMulStr_out_AvgPool_ConvSum_0_0_2_2","conv_kwMulDil_out_AvgPool_ConvSum_0_0_2_2"],"output":["conv_wPad_AvgPool_ConvSum_0_0_2_2"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_0","conv_C_AvgPool_ConvSum_0"],"output":["conv_nMulC_out_AvgPool_ConvSum_0_0_2_2"],"attribute":[]},{"opType":"Add","input":["conv_nMulC_out_AvgPool_ConvSum_0_0_2_2","conv_cAbs_AvgPool_ConvSum_0_0"],"output":["conv_ncPlus_out_AvgPool_ConvSum_0_0_2_2"],"attribute":[]},{"opType":"Mul","input":["conv_ncPlus_out_AvgPool_ConvSum_0_0_2_2","conv_Hpad_AvgPool_ConvSum_0"],"output":["conv_mulHpad_out_AvgPool_ConvSum_0_0_2_2"],"attribute":[]},{"opType":"Add","input":["conv_mulHpad_out_AvgPool_ConvSum_0_0_2_2","conv_hPad_AvgPool_ConvSum_0_0_2_2"],"output":["conv_addHpad_out_AvgPool_ConvSum_0_0_2_2"],"attribute":[]},{"opType":"Mul","input":["conv_addHpad_out_AvgPool_ConvSum_0_0_2_2","conv_Wpad_AvgPool_ConvSum_0"],"output":["conv_mulWpad_out_AvgPool_ConvSum_0_0_2_2"],"attribute":[]},{"opType":"Add","input":["conv_mulWpad_out_AvgPool_ConvSum_0_0_2_2","conv_wPad_AvgPool_ConvSum_0_0_2_2"],"output":["conv_xIdx_AvgPool_ConvSum_0_0_2_2"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_xIdx_AvgPool_ConvSum_0_0_2_2","conv_axes_AvgPool_ConvSum_0"],"output":["conv_xIdx_unsq_AvgPool_ConvSum_0_0_2_2_out"],"attribute":[]},{"opType":"Gather","input":["conv_x_flat_AvgPool_ConvSum_0","conv_xIdx_unsq_AvgPool_ConvSum_0_0_2_2_out"],"output":["conv_xVec_AvgPool_ConvSum_0_0_2_2"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["mr_mod_out_conv_iter_AvgPool_ConvSum_0_1","conv_Cw_AvgPool_ConvSum_0"],"output":["conv_mMulCw_out_AvgPool_ConvSum_0_0_2_2"],"attribute":[]},{"opType":"Add","input":["conv_mMulCw_out_AvgPool_ConvSum_0_0_2_2","conv_cRel_AvgPool_ConvSum_0_0"],"output":["conv_mPlusCrel_out_AvgPool_ConvSum_0_0_2_2"],"attribute":[]},{"opType":"Mul","input":["conv_mPlusCrel_out_AvgPool_ConvSum_0_0_2_2","conv_kH_AvgPool_ConvSum_0"],"output":["conv_mulkH_out_AvgPool_ConvSum_0_0_2_2"],"attribute":[]},{"opType":"Add","input":["conv_mulkH_out_AvgPool_ConvSum_0_0_2_2","conv_kh_AvgPool_ConvSum_0_0_2_2"],