{"irVersion":9,"opsetImport":[{"version":19}],"graph":{"name":"Graph","initializer":[{"name":"init_carry","dataType":1,"dims":[18],"floatData":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]},{"name":"init_carry_2","dataType":7,"dims":[8],"int64Data":[0,0,0,0,0,0,0,0]},{"name":"init_carry_1","dataType":7,"dims":[6],"int64Data":[0,0,0,0,0,0]},{"name":"init_carry_3","dataType":7,"dims":[4],"int64Data":[0,0,0,0]}],"node":[{"opType":"Constant","input":[],"output":["Concat_dim_0_idx_0"],"attribute":[{"name":"value","type":4,"t":{"name":"Concat_dim_0_idx_0","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["Concat_axis_idx_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"Concat_axis_idx_0_0","dataType":7,"dims":[1],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["Concat_Squeeze_sz_0_0_axes"],"attribute":[{"name":"value","type":4,"t":{"name":"Concat_Squeeze_sz_0_0_axes","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["Concat_axis_idx_1_0"],"attribute":[{"name":"value","type":4,"t":{"name":"Concat_axis_idx_1_0","dataType":7,"dims":[1],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["Concat_Squeeze_sz_1_0_axes"],"attribute":[{"name":"value","type":4,"t":{"name":"Concat_Squeeze_sz_1_0_axes","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["Concat_axis_idx_2_0"],"attribute":[{"name":"value","type":4,"t":{"name":"Concat_axis_idx_2_0","dataType":7,"dims":[1],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["Concat_Squeeze_sz_2_0_axes"],"attribute":[{"name":"value","type":4,"t":{"name":"Concat_Squeeze_sz_2_0_axes","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["Concat_sum_init_0"],"attribute":[{"name":"value","type":4,"t":{"name":"Concat_sum_init_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["cond_Concat_range_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"cond_Concat_range_0_0","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["Concat_shape_axis_0"],"attribute":[{"name":"value","type":4,"t":{"name":"Concat_shape_axis_0","dataType":7,"dims":[1],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["Concat_unsq_sum_update_0_axes"],"attribute":[{"name":"value","type":4,"t":{"name":"Concat_unsq_sum_update_0_axes","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["Concat_zero_0"],"attribute":[{"name":"value","type":4,"t":{"name":"Concat_zero_0","dataType":1,"dims":[],"floatData":[0]}}]},{"opType":"Constant","input":[],"output":["Concat_off_init_0"],"attribute":[{"name":"value","type":4,"t":{"name":"Concat_off_init_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["Concat_one_0"],"attribute":[{"name":"value","type":4,"t":{"name":"Concat_one_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["Concat_unsq_idx_0_0_axes"],"attribute":[{"name":"value","type":4,"t":{"name":"Concat_unsq_idx_0_0_axes","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["cond_Concat_range_1_0"],"attribute":[{"name":"value","type":4,"t":{"name":"cond_Concat_range_1_0","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["Concat_unsq_idx_1_0_axes"],"attribute":[{"name":"value","type":4,"t":{"name":"Concat_unsq_idx_1_0_axes","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["cond_Concat_range_2_0"],"attribute":[{"name":"value","type":4,"t":{"name":"cond_Concat_range_2_0","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["Concat_unsq_idx_2_0_axes"],"attribute":[{"name":"value","type":4,"t":{"name":"Concat_unsq_idx_2_0_axes","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["trip_count_Concat_InitY_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"trip_count_Concat_InitY_0_expand_add","dataType":7,"dims":[],"int64Data":[18]}}]},{"opType":"Constant","input":[],"output":["cond_Concat_InitY_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"cond_Concat_InitY_0_expand_add","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["reshape_shape_Concat_InitY_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"reshape_shape_Concat_InitY_0_expand_add","dataType":7,"dims":[2],"int64Data":[2,9]}}]},{"opType":"Constant","input":[],"output":["range_zeroF_Concat_range_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"range_zeroF_Concat_range_0_0","dataType":1,"dims":[],"floatData":[0]}}]},{"opType":"Constant","input":[],"output":["axes0_Concat_range_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"axes0_Concat_range_0_0","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["trip_count_Concat_expand_idx_0_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"trip_count_Concat_expand_idx_0_0_expand_add","dataType":7,"dims":[],"int64Data":[6]}}]},{"opType":"Constant","input":[],"output":["cond_Concat_expand_idx_0_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"cond_Concat_expand_idx_0_0_expand_add","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["reshape_shape_Concat_expand_idx_0_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"reshape_shape_Concat_expand_idx_0_0_expand_add","dataType":7,"dims":[2],"int64Data":[2,3]}}]},{"opType":"Constant","input":[],"output":["range_zeroF_Concat_range_1_0"],"attribute":[{"name":"value","type":4,"t":{"name":"range_zeroF_Concat_range_1_0","dataType":1,"dims":[],"floatData":[0]}}]},{"opType":"Constant","input":[],"output":["axes0_Concat_range_1_0"],"attribute":[{"name":"value","type":4,"t":{"name":"axes0_Concat_range_1_0","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["trip_count_Concat_expand_idx_1_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"trip_count_Concat_expand_idx_1_0_expand_add","dataType":7,"dims":[],"int64Data":[8]}}]},{"opType":"Constant","input":[],"output":["cond_Concat_expand_idx_1_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"cond_Concat_expand_idx_1_0_expand_add","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["reshape_shape_Concat_expand_idx_1_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"reshape_shape_Concat_expand_idx_1_0_expand_add","dataType":7,"dims":[2],"int64Data":[2,4]}}]},{"opType":"Constant","input":[],"output":["range_zeroF_Concat_range_2_0"],"attribute":[{"name":"value","type":4,"t":{"name":"range_zeroF_Concat_range_2_0","dataType":1,"dims":[],"floatData":[0]}}]},{"opType":"Constant","input":[],"output":["axes0_Concat_range_2_0"],"attribute":[{"name":"value","type":4,"t":{"name":"axes0_Concat_range_2_0","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["trip_count_Concat_expand_idx_2_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"trip_count_Concat_expand_idx_2_0_expand_add","dataType":7,"dims":[],"int64Data":[4]}}]},{"opType":"Constant","input":[],"output":["cond_Concat_expand_idx_2_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"cond_Concat_expand_idx_2_0_expand_add","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["reshape_shape_Concat_expand_idx_2_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"reshape_shape_Concat_expand_idx_2_0_expand_add","dataType":7,"dims":[2],"int64Data":[2,2]}}]},{"opType":"Shape","input":["X0"],"output":["Concat_shape0_0"],"attribute":[]},{"opType":"Shape","input":["X0"],"output":["Concat_shape_in0_0"],"attribute":[]},{"opType":"Gather","input":["Concat_shape_in0_0","Concat_axis_idx_0_0"],"output":["Concat_size1D_0_0"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Squeeze","input":["Concat_size1D_0_0","Concat_Squeeze_sz_0_0_axes"],"output":["Concat_Squeeze_sz_0_0_out"],"attribute":[]},{"opType":"Add","input":["Concat_sum_init_0","Concat_Squeeze_sz_0_0_out"],"output":["Concat_sum_out_0_0"],"attribute":[]},{"opType":"Shape","input":["X1"],"output":["Concat_shape_in1_0"],"attribute":[]},{"opType":"Gather","input":["Concat_shape_in1_0","Concat_axis_idx_1_0"],"output":["Concat_size1D_1_0"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Squeeze","input":["Concat_size1D_1_0","Concat_Squeeze_sz_1_0_axes"],"output":["Concat_Squeeze_sz_1_0_out"],"attribute":[]},{"opType":"Add","input":["Concat_sum_out_0_0","Concat_Squeeze_sz_1_0_out"],"output":["Concat_sum_out_1_0"],"attribute":[]},{"opType":"Shape","input":["X2"],"output":["Concat_shape_in2_0"],"attribute":[]},{"opType":"Gather","input":["Concat_shape_in2_0","Concat_axis_idx_2_0"],"output":["Concat_size1D_2_0"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Squeeze","input":["Concat_size1D_2_0","Concat_Squeeze_sz_2_0_axes"],"output":["Concat_Squeeze_sz_2_0_out"],"attribute":[]},{"opType":"Add","input":["Concat_sum_out_1_0","Concat_Squeeze_sz_2_0_out"],"output":["Concat_sum_out_2_0"],"attribute":[]},{"opType":"Unsqueeze","input":["Concat_sum_out_2_0","Concat_unsq_sum_update_0_axes"],"output":["Concat_unsq_sum_update_0_out"],"attribute":[]},{"opType":"ScatterElements","input":["Concat_shape0_0","Concat_shape_axis_0","Concat_unsq_sum_update_0_out"],"output":["Concat_OutShape_0"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"ConstantOfShape","input":["Concat_OutShape_0"],"output":["Concat_InitY_0_expand_fill_out"],"attribute":[]},{"opType":"Loop","input":["trip_count_Concat_InitY_0_expand_add","cond_Concat_InitY_0_expand_add","init_carry"],"output":["loop_out"],"attribute":[{"name":"body","type":5,"g":{"name":"loop_body_0","initializer":[],"node":[{"opType":"Constant","input":[],"output":["axes"],"attribute":[{"name":"value","type":4,"t":{"name":"axes","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_1"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_1","dataType":7,"dims":[],"int64Data":[9]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["lin_zero_gb_lin_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_gb_lin_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_0","dataType":7,"dims":[],"int64Data":[9]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_1"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["flat_shape_Concat_InitY_0_expand_fill_out"],"attribute":[{"name":"value","type":4,"t":{"name":"flat_shape_Concat_InitY_0_expand_fill_out","dataType":7,"dims":[1],"int64Data":[-1]}}]},{"opType":"Constant","input":[],"output":["sg_len_idx_gb_lin_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"sg_len_idx_gb_lin_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Unsqueeze","input":["iter","axes"],"output":["unsq_out"],"attribute":[]},{"opType":"Mod","input":["iter","mr_dim_gb_out_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_1"],"output":["mr_mod_out_gb_out_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_1"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_gb_out_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_1"],"output":["mr_div_out_gb_out_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_1"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_1","mr_dim_gb_out_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_0"],"output":["mr_mod_out_gb_out_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_0"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_1","mr_dim_gb_out_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_0"],"output":["mr_div_out_gb_out_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_0","lin_stride_gb_lin_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_0"],"output":["lin_mul_out_gb_lin_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_0"],"attribute":[]},{"opType":"Add","input":["lin_zero_gb_lin_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add","lin_mul_out_gb_lin_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_0"],"output":["lin_add_out_gb_lin_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_1","lin_stride_gb_lin_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_1"],"output":["lin_mul_out_gb_lin_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_1"],"attribute":[]},{"opType":"Add","input":["lin_add_out_gb_lin_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_0","lin_mul_out_gb_lin_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_1"],"output":["lin_add_out_gb_lin_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_1"],"attribute":[]},{"opType":"Reshape","input":["Concat_InitY_0_expand_fill_out","flat_shape_Concat_InitY_0_expand_fill_out"],"output":["Concat_InitY_0_expand_fill_out_flat"],"attribute":[]},{"opType":"Shape","input":["Concat_InitY_0_expand_fill_out_flat"],"output":["sg_shape_out_gb_lin_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add"],"attribute":[]},{"opType":"Gather","input":["sg_shape_out_gb_lin_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add","sg_len_idx_gb_lin_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add"],"output":["sg_len_gb_lin_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["lin_add_out_gb_lin_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_1","sg_len_gb_lin_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_out"],"output":["Mod_sg_mod_gb_lin_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_out"],"attribute":[]},{"opType":"Unsqueeze","input":["Mod_sg_mod_gb_lin_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_out","axes"],"output":["sg_idx_unsq_gb_lin_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_out"],"attribute":[]},{"opType":"Gather","input":["Concat_InitY_0_expand_fill_out_flat","sg_idx_unsq_gb_lin_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_out"],"output":["sg_g_gb_lin_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Squeeze","input":["sg_g_gb_lin_Concat_InitY_0_expand_fill_out_Concat_InitY_0_expand_add_out","axes"],"output":["sq_Concat_InitY_0_expand_add_in1_scalar_out"],"attribute":[]},{"opType":"Add","input":["Concat_zero_0","sq_Concat_InitY_0_expand_add_in1_scalar_out"],"output":["Concat_InitY_0_expand_add_out"],"attribute":[]},{"opType":"Unsqueeze","input":["Concat_InitY_0_expand_add_out","axes"],"output":["updateUnsq_out"],"attribute":[]},{"opType":"Identity","input":["cond_in"],"output":["cond_out"],"attribute":[]},{"opType":"ScatterElements","input":["carry","unsq_out","updateUnsq_out"],"output":["carry_out"],"attribute":[{"name":"axis","i":0,"type":2}]}],"input":[{"name":"iter","type":{"tensorType":{"elemType":7,"shape":{"dim":[]}}}},{"name":"cond_in","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":18}]}}}}],"output":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":18}]}}}}],"valueInfo":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":18}]}}}},{"name":"Concat_InitY_0_expand_fill_out","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}},{"name":"Concat_zero_0","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}}]}}]},{"opType":"Reshape","input":["loop_out","reshape_shape_Concat_InitY_0_expand_add"],"output":["Concat_Y0_0"],"attribute":[]},{"opType":"Add","input":["Concat_off_init_0","Concat_Squeeze_sz_0_0_out"],"output":["Concat_off_end_0_0"],"attribute":[]},{"opType":"Sub","input":["Concat_off_end_0_0","Concat_off_init_0"],"output":["range_sub_out_Concat_range_0_0"],"attribute":[]},{"opType":"Cast","input":["range_sub_out_Concat_range_0_0"],"output":["range_subF_out_Concat_range_0_0"],"attribute":[{"name":"to","i":1,"type":2}]},{"opType":"Cast","input":["Concat_one_0"],"output":["range_deltaF_out_Concat_range_0_0"],"attribute":[{"name":"to","i":1,"type":2}]},{"opType":"Div","input":["range_subF_out_Concat_range_0_0","range_deltaF_out_Concat_range_0_0"],"output":["range_divF_out_Concat_range_0_0"],"attribute":[]},{"opType":"Ceil","input":["range_divF_out_Concat_range_0_0"],"output":["range_ceilF_out_Concat_range_0_0"],"attribute":[]},{"opType":"Max","input":["range_ceilF_out_Concat_range_0_0","range_zeroF_Concat_range_0_0"],"output":["range_maxF_out_Concat_range_0_0"],"attribute":[]},{"opType":"Cast","input":["range_maxF_out_Concat_range_0_0"],"output":["range_trip_out_Concat_range_0_0"],"attribute":[{"name":"to","i":7,"type":2}]},{"opType":"Unsqueeze","input":["range_trip_out_Concat_range_0_0","axes0_Concat_range_0_0"],"output":["range_trip_vec_Concat_range_0_0"],"attribute":[]},{"opType":"ConstantOfShape","input":["range_trip_vec_Concat_range_0_0"],"output":["range_initF_out_Concat_range_0_0"],"attribute":[]},{"opType":"Cast","input":["range_initF_out_Concat_range_0_0"],"output":["range_init_out_Concat_range_0_0"],"attribute":[{"name":"to","i":7,"type":2}]},{"opType":"Loop","input":["range_trip_out_Concat_range_0_0","cond_Concat_range_0_0","range_init_out_Concat_range_0_0"],"output":["Concat_range1D_0_0"],"attribute":[{"name":"body","type":5,"g":{"name":"loop_body_0","initializer":[],"node":[{"opType":"Constant","input":[],"output":["axes"],"attribute":[{"name":"value","type":4,"t":{"name":"axes","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Unsqueeze","input":["iter","axes"],"output":["unsq_out"],"attribute":[]},{"opType":"Cast","input":["iter"],"output":["range_iter_cast_out_Concat_range_0_0"],"attribute":[{"name":"to","i":7,"type":2}]},{"opType":"Mul","input":["range_iter_cast_out_Concat_range_0_0","Concat_one_0"],"output":["range_mul_out_Concat_range_0_0"],"attribute":[]},{"opType":"Add","input":["Concat_off_init_0","range_mul_out_Concat_range_0_0"],"output":["range_y_Concat_range_0_0"],"attribute":[]},{"opType":"Unsqueeze","input":["range_y_Concat_range_0_0","axes"],"output":["updateUnsq_out"],"attribute":[]},{"opType":"Identity","input":["cond_in"],"output":["cond_out"],"attribute":[]},{"opType":"ScatterElements","input":["carry","unsq_out","updateUnsq_out"],"output":["carry_out"],"attribute":[{"name":"axis","i":0,"type":2}]}],"input":[{"name":"iter","type":{"tensorType":{"elemType":7,"shape":{"dim":[]}}}},{"name":"cond_in","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry","type":{"tensorType":{"elemType":7,"shape":{"dim":[{"dimValue":-1}]}}}}],"output":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":7,"shape":{"dim":[{"dimValue":-1}]}}}}],"valueInfo":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":7,"shape":{"dim":[{"dimValue":-1}]}}}},{"name":"Concat_one_0","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}},{"name":"Concat_off_init_0","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}}]}}]},{"opType":"Unsqueeze","input":["Concat_range1D_0_0","Concat_unsq_idx_0_0_axes"],"output":["Concat_unsq_idx_0_0_out"],"attribute":[]},{"opType":"Shape","input":["X0"],"output":["Concat_shape_idx_0_0"],"attribute":[]},{"opType":"ConstantOfShape","input":["Concat_shape_idx_0_0"],"output":["Concat_expand_idx_0_0_expand_fill_out"],"attribute":[]},{"opType":"Cast","input":["Concat_expand_idx_0_0_expand_fill_out"],"output":["Concat_expand_idx_0_0_expand_cast_out"],"attribute":[{"name":"to","i":7,"type":2}]},{"opType":"Loop","input":["trip_count_Concat_expand_idx_0_0_expand_add","cond_Concat_expand_idx_0_0_expand_add","init_carry_1"],"output":["loop_out_1"],"attribute":[{"name":"body","type":5,"g":{"name":"loop_body_0","initializer":[],"node":[{"opType":"Constant","input":[],"output":["axes"],"attribute":[{"name":"value","type":4,"t":{"name":"axes","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_1"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_1","dataType":7,"dims":[],"int64Data":[3]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["gb_zero_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_0"],"attribute":[{"name":"value","type":4,"t":{"name":"gb_zero_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_zero_gb_lin_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_gb_lin_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_0","dataType":7,"dims":[],"int64Data":[3]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_1"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["flat_shape_Concat_unsq_idx_0_0_out"],"attribute":[{"name":"value","type":4,"t":{"name":"flat_shape_Concat_unsq_idx_0_0_out","dataType":7,"dims":[1],"int64Data":[-1]}}]},{"opType":"Constant","input":[],"output":["sg_len_idx_gb_lin_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"sg_len_idx_gb_lin_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_1"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_1","dataType":7,"dims":[],"int64Data":[3]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["lin_zero_gb_lin_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_gb_lin_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_0","dataType":7,"dims":[],"int64Data":[3]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_1"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["flat_shape_Concat_expand_idx_0_0_expand_cast_out"],"attribute":[{"name":"value","type":4,"t":{"name":"flat_shape_Concat_expand_idx_0_0_expand_cast_out","dataType":7,"dims":[1],"int64Data":[-1]}}]},{"opType":"Constant","input":[],"output":["sg_len_idx_gb_lin_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"sg_len_idx_gb_lin_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Unsqueeze","input":["iter","axes"],"output":["unsq_out"],"attribute":[]},{"opType":"Mod","input":["iter","mr_dim_gb_out_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_1"],"output":["mr_mod_out_gb_out_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_1"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_gb_out_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_1"],"output":["mr_div_out_gb_out_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_1"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_1","mr_dim_gb_out_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_0"],"output":["mr_mod_out_gb_out_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_0"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_1","mr_dim_gb_out_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_0"],"output":["mr_div_out_gb_out_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_0"],"attribute":[]},{"opType":"Mul","input":["gb_zero_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_0","lin_stride_gb_lin_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_0"],"output":["lin_mul_out_gb_lin_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_0"],"attribute":[]},{"opType":"Add","input":["lin_zero_gb_lin_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add","lin_mul_out_gb_lin_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_0"],"output":["lin_add_out_gb_lin_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_1","lin_stride_gb_lin_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_1"],"output":["lin_mul_out_gb_lin_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_1"],"attribute":[]},{"opType":"Add","input":["lin_add_out_gb_lin_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_0","lin_mul_out_gb_lin_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_1"],"output":["lin_add_out_gb_lin_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_1"],"attribute":[]},{"opType":"Reshape","input":["Concat_unsq_idx_0_0_out","flat_shape_Concat_unsq_idx_0_0_out"],"output":["Concat_unsq_idx_0_0_out_flat"],"attribute":[]},{"opType":"Shape","input":["Concat_unsq_idx_0_0_out_flat"],"output":["sg_shape_out_gb_lin_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add"],"attribute":[]},{"opType":"Gather","input":["sg_shape_out_gb_lin_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add","sg_len_idx_gb_lin_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add"],"output":["sg_len_gb_lin_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["lin_add_out_gb_lin_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_1","sg_len_gb_lin_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_out"],"output":["Mod_sg_mod_gb_lin_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_out"],"attribute":[]},{"opType":"Unsqueeze","input":["Mod_sg_mod_gb_lin_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_out","axes"],"output":["sg_idx_unsq_gb_lin_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_out"],"attribute":[]},{"opType":"Gather","input":["Concat_unsq_idx_0_0_out_flat","sg_idx_unsq_gb_lin_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_out"],"output":["sg_g_gb_lin_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["iter","mr_dim_gb_out_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_1"],"output":["mr_mod_out_gb_out_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_1"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_gb_out_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_1"],"output":["mr_div_out_gb_out_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_1"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_1","mr_dim_gb_out_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_0"],"output":["mr_mod_out_gb_out_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_0"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_1","mr_dim_gb_out_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_0"],"output":["mr_div_out_gb_out_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_0","lin_stride_gb_lin_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_0"],"output":["lin_mul_out_gb_lin_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_0"],"attribute":[]},{"opType":"Add","input":["lin_zero_gb_lin_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add","lin_mul_out_gb_lin_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_0"],"output":["lin_add_out_gb_lin_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_1","lin_stride_gb_lin_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_1"],"output":["lin_mul_out_gb_lin_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_1"],"attribute":[]},{"opType":"Add","input":["lin_add_out_gb_lin_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_0","lin_mul_out_gb_lin_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_1"],"output":["lin_add_out_gb_lin_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_1"],"attribute":[]},{"opType":"Reshape","input":["Concat_expand_idx_0_0_expand_cast_out","flat_shape_Concat_expand_idx_0_0_expand_cast_out"],"output":["Concat_expand_idx_0_0_expand_cast_out_flat"],"attribute":[]},{"opType":"Shape","input":["Concat_expand_idx_0_0_expand_cast_out_flat"],"output":["sg_shape_out_gb_lin_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add"],"attribute":[]},{"opType":"Gather","input":["sg_shape_out_gb_lin_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add","sg_len_idx_gb_lin_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add"],"output":["sg_len_gb_lin_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["lin_add_out_gb_lin_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_1","sg_len_gb_lin_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_out"],"output":["Mod_sg_mod_gb_lin_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_out"],"attribute":[]},{"opType":"Unsqueeze","input":["Mod_sg_mod_gb_lin_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_out","axes"],"output":["sg_idx_unsq_gb_lin_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_out"],"attribute":[]},{"opType":"Gather","input":["Concat_expand_idx_0_0_expand_cast_out_flat","sg_idx_unsq_gb_lin_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_out"],"output":["sg_g_gb_lin_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Squeeze","input":["sg_g_gb_lin_Concat_unsq_idx_0_0_out_Concat_expand_idx_0_0_expand_add_out","axes"],"output":["sq_Concat_expand_idx_0_0_expand_add_in0_scalar_out"],"attribute":[]},{"opType":"Squeeze","input":["sg_g_gb_lin_Concat_expand_idx_0_0_expand_cast_out_Concat_expand_idx_0_0_expand_add_out","axes"],"output":["sq_Concat_expand_idx_0_0_expand_add_in1_scalar_out"],"attribute":[]},{"opType":"Add","input":["sq_Concat_expand_idx_0_0_expand_add_in0_scalar_out","sq_Concat_expand_idx_0_0_expand_add_in1_scalar_out"],"output":["Concat_expand_idx_0_0_expand_add_out"],"attribute":[]},{"opType":"Unsqueeze","input":["Concat_expand_idx_0_0_expand_add_out","axes"],"output":["updateUnsq_out"],"attribute":[]},{"opType":"Identity","input":["cond_in"],"output":["cond_out"],"attribute":[]},{"opType":"ScatterElements","input":["carry","unsq_out","updateUnsq_out"],"output":["carry_out"],"attribute":[{"name":"axis","i":0,"type":2}]}],"input":[{"name":"iter","type":{"tensorType":{"elemType":7,"shape":{"dim":[]}}}},{"name":"cond_in","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry","type":{"tensorType":{"elemType":7,"shape":{"dim":[{"dimValue":6}]}}}}],"output":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":7,"shape":{"dim":[{"dimValue":6}]}}}}],"valueInfo":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":7,"shape":{"dim":[{"dimValue":6}]}}}},{"name":"Concat_unsq_idx_0_0_out","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}},{"name":"Concat_expand_idx_0_0_expand_cast_out","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}}]}}]},{"opType":"Reshape","input":["loop_out_1","reshape_shape_Concat_expand_idx_0_0_expand_add"],"output":["Concat_idx_full_0_0"],"attribute":[]},{"opType":"ScatterElements","input":["Concat_Y0_0","Concat_idx_full_0_0","X0"],"output":["Concat_Y1_0"],"attribute":[{"name":"axis","i":1,"type":2}]},{"opType":"Add","input":["Concat_off_end_0_0","Concat_Squeeze_sz_1_0_out"],"output":["Concat_off_end_1_0"],"attribute":[]},{"opType":"Sub","input":["Concat_off_end_1_0","Concat_off_end_0_0"],"output":["range_sub_out_Concat_range_1_0"],"attribute":[]},{"opType":"Cast","input":["range_sub_out_Concat_range_1_0"],"output":["range_subF_out_Concat_range_1_0"],"attribute":[{"name":"to","i":1,"type":2}]},{"opType":"Cast","input":["Concat_one_0"],"output":["range_deltaF_out_Concat_range_1_0"],"attribute":[{"name":"to","i":1,"type":2}]},{"opType":"Div","input":["range_subF_out_Concat_range_1_0","range_deltaF_out_Concat_range_1_0"],"output":["range_divF_out_Concat_range_1_0"],"attribute":[]},{"opType":"Ceil","input":["range_divF_out_Concat_range_1_0"],"output":["range_ceilF_out_Concat_range_1_0"],"attribute":[]},{"opType":"Max","input":["range_ceilF_out_Concat_range_1_0","range_zeroF_Concat_range_1_0"],"output":["range_maxF_out_Concat_range_1_0"],"attribute":[]},{"opType":"Cast","input":["range_maxF_out_Concat_range_1_0"],"output":["range_trip_out_Concat_range_1_0"],"attribute":[{"name":"to","i":7,"type":2}]},{"opType":"Unsqueeze","input":["range_trip_out_Concat_range_1_0","axes0_Concat_range_1_0"],"output":["range_trip_vec_Concat_range_1_0"],"attribute":[]},{"opType":"ConstantOfShape","input":["range_trip_vec_Concat_range_1_0"],"output":["range_initF_out_Concat_range_1_0"],"attribute":[]},{"opType":"Cast","input":["range_initF_out_Concat_range_1_0"],"output":["range_init_out_Concat_range_1_0"],"attribute":[{"name":"to","i":7,"type":2}]},{"opType":"Loop","input":["range_trip_out_Concat_range_1_0","cond_Concat_range_1_0","range_init_out_Concat_range_1_0"],"output":["Concat_range1D_1_0"],"attribute":[{"name":"body","type":5,"g":{"name":"loop_body_0","initializer":[],"node":[{"opType":"Constant","input":[],"output":["axes"],"attribute":[{"name":"value","type":4,"t":{"name":"axes","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Unsqueeze","input":["iter","axes"],"output":["unsq_out"],"attribute":[]},{"opType":"Cast","input":["iter"],"output":["range_iter_cast_out_Concat_range_1_0"],"attribute":[{"name":"to","i":7,"type":2}]},{"opType":"Mul","input":["range_iter_cast_out_Concat_range_1_0","Concat_one_0"],"output":["range_mul_out_Concat_range_1_0"],"attribute":[]},{"opType":"Add","input":["Concat_off_end_0_0","range_mul_out_Concat_range_1_0"],"output":["range_y_Concat_range_1_0"],"attribute":[]},{"opType":"Unsqueeze","input":["range_y_Concat_range_1_0","axes"],"output":["updateUnsq_out"],"attribute":[]},{"opType":"Identity","input":["cond_in"],"output":["cond_out"],"attribute":[]},{"opType":"ScatterElements","input":["carry","unsq_out","updateUnsq_out"],"output":["carry_out"],"attribute":[{"name":"axis","i":0,"type":2}]}],"input":[{"name":"iter","type":{"tensorType":{"elemType":7,"shape":{"dim":[]}}}},{"name":"cond_in","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry","type":{"tensorType":{"elemType":7,"shape":{"dim":[{"dimValue":-1}]}}}}],"output":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":7,"shape":{"dim":[{"dimValue":-1}]}}}}],"valueInfo":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":7,"shape":{"dim":[{"dimValue":-1}]}}}},{"name":"Concat_one_0","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}},{"name":"Concat_off_end_0_0","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}}]}}]},{"opType":"Unsqueeze","input":["Concat_range1D_1_0","Concat_unsq_idx_1_0_axes"],"output":["Concat_unsq_idx_1_0_out"],"attribute":[]},{"opType":"Shape","input":["X1"],"output":["Concat_shape_idx_1_0"],"attribute":[]},{"opType":"ConstantOfShape","input":["Concat_shape_idx_1_0"],"output":["Concat_expand_idx_1_0_expand_fill_out"],"attribute":[]},{"opType":"Cast","input":["Concat_expand_idx_1_0_expand_fill_out"],"output":["Concat_expand_idx_1_0_expand_cast_out"],"attribute":[{"name":"to","i":7,"type":2}]},{"opType":"Loop","input":["trip_count_Concat_expand_idx_1_0_expand_add","cond_Concat_expand_idx_1_0_expand_add","init_carry_2"],"output":["loop_out_2"],"attribute":[{"name":"body","type":5,"g":{"name":"loop_body_0","initializer":[],"node":[{"opType":"Constant","input":[],"output":["axes"],"attribute":[{"name":"value","type":4,"t":{"name":"axes","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_1"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_1","dataType":7,"dims":[],"int64Data":[4]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["gb_zero_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_0"],"attribute":[{"name":"value","type":4,"t":{"name":"gb_zero_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_zero_gb_lin_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_gb_lin_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_0","dataType":7,"dims":[],"int64Data":[4]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_1"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["flat_shape_Concat_unsq_idx_1_0_out"],"attribute":[{"name":"value","type":4,"t":{"name":"flat_shape_Concat_unsq_idx_1_0_out","dataType":7,"dims":[1],"int64Data":[-1]}}]},{"opType":"Constant","input":[],"output":["sg_len_idx_gb_lin_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"sg_len_idx_gb_lin_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_Concat_expand_idx_1_0_expand_cast_out_Concat_expand_idx_1_0_expand_add_1"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_Concat_expand_idx_1_0_expand_cast_out_Concat_expand_idx_1_0_expand_add_1","dataType":7,"dims":[],"int64Data":[4]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_Concat_expand_idx_1_0_expand_cast_out_Concat_expand_idx_1_0_expand_add_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_Concat_expand_idx_1_0_expand_cast_out_Concat_expand_idx_1_0_expand_add_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["lin_zero_gb_lin_Concat_expand_idx_1_0_expand_cast_out_Concat_expand_idx_1_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_gb_lin_Concat_expand_idx_1_0_expand_cast_out_Concat_expand_idx_1_0_expand_add","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_Concat_expand_idx_1_0_expand_cast_out_Concat_expand_idx_1_0_expand_add_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_Concat_expand_idx_1_0_expand_cast_out_Concat_expand_idx_1_0_expand_add_0","dataType":7,"dims":[],"int64Data":[4]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_Concat_expand_idx_1_0_expand_cast_out_Concat_expand_idx_1_0_expand_add_1"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_Concat_expand_idx_1_0_expand_cast_out_Concat_expand_idx_1_0_expand_add_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["flat_shape_Concat_expand_idx_1_0_expand_cast_out"],"attribute":[{"name":"value","type":4,"t":{"name":"flat_shape_Concat_expand_idx_1_0_expand_cast_out","dataType":7,"dims":[1],"int64Data":[-1]}}]},{"opType":"Constant","input":[],"output":["sg_len_idx_gb_lin_Concat_expand_idx_1_0_expand_cast_out_Concat_expand_idx_1_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"sg_len_idx_gb_lin_Concat_expand_idx_1_0_expand_cast_out_Concat_expand_idx_1_0_expand_add","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Unsqueeze","input":["iter","axes"],"output":["unsq_out"],"attribute":[]},{"opType":"Mod","input":["iter","mr_dim_gb_out_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_1"],"output":["mr_mod_out_gb_out_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_1"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_gb_out_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_1"],"output":["mr_div_out_gb_out_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_1"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_1","mr_dim_gb_out_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_0"],"output":["mr_mod_out_gb_out_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_0"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_1","mr_dim_gb_out_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_0"],"output":["mr_div_out_gb_out_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_0"],"attribute":[]},{"opType":"Mul","input":["gb_zero_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_0","lin_stride_gb_lin_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_0"],"output":["lin_mul_out_gb_lin_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_0"],"attribute":[]},{"opType":"Add","input":["lin_zero_gb_lin_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add","lin_mul_out_gb_lin_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_0"],"output":["lin_add_out_gb_lin_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_1","lin_stride_gb_lin_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_1"],"output":["lin_mul_out_gb_lin_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_1"],"attribute":[]},{"opType":"Add","input":["lin_add_out_gb_lin_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_0","lin_mul_out_gb_lin_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_1"],"output":["lin_add_out_gb_lin_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_1"],"attribute":[]},{"opType":"Reshape","input":["Concat_unsq_idx_1_0_out","flat_shape_Concat_unsq_idx_1_0_out"],"output":["Concat_unsq_idx_1_0_out_flat"],"attribute":[]},{"opType":"Shape","input":["Concat_unsq_idx_1_0_out_flat"],"output":["sg_shape_out_gb_lin_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add"],"attribute":[]},{"opType":"Gather","input":["sg_shape_out_gb_lin_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add","sg_len_idx_gb_lin_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add"],"output":["sg_len_gb_lin_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["lin_add_out_gb_lin_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_1","sg_len_gb_lin_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_out"],"output":["Mod_sg_mod_gb_lin_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_out"],"attribute":[]},{"opType":"Unsqueeze","input":["Mod_sg_mod_gb_lin_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_out","axes"],"output":["sg_idx_unsq_gb_lin_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_out"],"attribute":[]},{"opType":"Gather","input":["Concat_unsq_idx_1_0_out_flat","sg_idx_unsq_gb_lin_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_out"],"output":["sg_g_gb_lin_Concat_unsq_idx_1_0_out_Concat_expand_idx_1_0_expand_add_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["iter","mr_dim_gb_out_Concat_expand_idx_1_0_expand_cast_out_Concat_expand_idx_1_0_expand_add_1"],"output":["mr_mod_out_gb_out_Concat_expand_idx_1_0_expand_cast_out_Concat_expand_idx_1_0_expand_add_1"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_gb_out_Concat_expand_idx_1_0_expand_cast_out_Concat_expand_idx_1_0_expand_add_1"],"output":["mr_div_out_gb_out_Concat_expand_idx_1_0_expand_cast_out_Concat_expand_idx_1_0_expand_add_1"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_Concat_expand_idx_1_0_expand_cast_out_Concat_expand_idx_1_0_expand_add_1","mr_dim_gb_out_Concat_expand_idx_1_0_expand_cast_out_Concat_expand_idx_1_0_expand_add_0"],"output":["mr_mod_out_gb_out_Concat_expand_idx_1_0_expand_cast_out_Concat_expand_idx_1_0_expand_add_0"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_Concat_expand_idx_1_0_expand_cast_out_Concat_expand_idx_1_0_expand_add_1","mr_dim_gb_out_Concat_expand_idx_1_0_expand_cast_out_Concat_expand_idx_1_0_expand_add_0"],"output":["mr_div_out_gb_out_Concat_expand_idx_1_0_expand_cast_out_Concat_expand_idx_1_0_expand_add_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_Concat_expand_idx_1_0_expand_cast_out_Concat_expand_idx_1_0_expand_add_0","lin_stride_gb_lin_Concat_expand_idx_1_0_expand_cast_out_Concat_expand_idx_1_0_expand_add_0"],"output":["lin_mul_out_gb_lin_Concat_expand_idx_1_0_expand_cast_out_Concat_expand_idx_1_0_expand_add_0"],"attribute":[]},{"opType":"Add",