{
  "ir_version": 9,
  "opsets": [
    {
      "domain": "",
      "version": 17
    }
  ],
  "graph": {
    "name": "conv_simple_graph",
    "inputs": [
      {
        "name": "X",
        "type": 1,
        "shape": [
          1,
          1,
          4,
          4
        ]
      },
      {
        "name": "W",
        "type": 1,
        "shape": [
          1,
          1,
          3,
          3
        ]
      },
      {
        "name": "B",
        "type": 1,
        "shape": [
          1
        ]
      }
    ],
    "outputs": [
      {
        "name": "Y",
        "type": 1,
        "shape": [
          1,
          1,
          2,
          2
        ]
      }
    ],
    "initializers": [],
    "nodes": [
      {
        "name": "Conv_simple",
        "opType": "Conv",
        "inputs": [
          "X",
          "W",
          "B"
        ],
        "outputs": [
          "Y"
        ],
        "attributes": {
          "dilations": [
            1,
            1
          ],
          "group": 1,
          "pads": [
            0,
            0,
            0,
            0
          ],
          "strides": [
            1,
            1
          ]
        }
      }
    ]
  }
}