{"irVersion":9,"opsetImport":[{"version":19}],"graph":{"name":"Graph","initializer":[],"node":[{"opType":"Constant","input":[],"output":["conv_init_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_init_0","dataType":1,"dims":[4],"floatData":[0,0,0,0]}}]},{"opType":"Constant","input":[],"output":["conv_trip_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_trip_0","dataType":7,"dims":[],"int64Data":[4]}}]},{"opType":"Constant","input":[],"output":["conv_cond_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_cond_0","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["reshape_shape_0"],"attribute":[{"name":"value","type":4,"t":{"name":"reshape_shape_0","dataType":7,"dims":[4],"int64Data":[1,1,2,2]}}]},{"opType":"Loop","input":["conv_trip_0","conv_cond_0","conv_init_0"],"output":["loop_out"],"attribute":[{"name":"body","type":5,"g":{"name":"loop_body_0","initializer":[],"node":[{"opType":"Constant","input":[],"output":["conv_axes_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_axes_0","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["conv_x_flat_shape_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_x_flat_shape_0","dataType":7,"dims":[1],"int64Data":[-1]}}]},{"opType":"Constant","input":[],"output":["conv_w_flat_shape_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_w_flat_shape_0","dataType":7,"dims":[1],"int64Data":[-1]}}]},{"opType":"Constant","input":[],"output":["conv_Wout_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_Wout_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["conv_Wpad_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_Wpad_0","dataType":7,"dims":[],"int64Data":[4]}}]},{"opType":"Constant","input":[],"output":["conv_Hpad_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_Hpad_0","dataType":7,"dims":[],"int64Data":[4]}}]},{"opType":"Constant","input":[],"output":["conv_C_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_C_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["conv_kW_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kW_0","dataType":7,"dims":[],"int64Data":[3]}}]},{"opType":"Constant","input":[],"output":["conv_kH_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kH_0","dataType":7,"dims":[],"int64Data":[3]}}]},{"opType":"Constant","input":[],"output":["conv_strideH_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_strideH_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["conv_strideW_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_strideW_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["conv_dilH_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_dilH_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["conv_dilW_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_dilW_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["mr_dim_conv_iter_0_3"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_conv_iter_0_3","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["mr_dim_conv_iter_0_2"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_conv_iter_0_2","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["mr_dim_conv_iter_0_1"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_conv_iter_0_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["mr_dim_conv_iter_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_conv_iter_0_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["conv_Cw_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_Cw_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["conv_MperG_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_MperG_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["conv_cRel_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_cRel_0_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["conv_kh_0_0_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kh_0_0_0_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["conv_kw_0_0_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kw_0_0_0_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["conv_kh_0_0_0_1"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kh_0_0_0_1","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["conv_kw_0_0_0_1"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kw_0_0_0_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["conv_kh_0_0_0_2"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kh_0_0_0_2","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["conv_kw_0_0_0_2"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kw_0_0_0_2","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["conv_kh_0_0_1_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kh_0_0_1_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["conv_kw_0_0_1_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kw_0_0_1_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["conv_kh_0_0_1_1"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kh_0_0_1_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["conv_kw_0_0_1_1"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kw_0_0_1_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["conv_kh_0_0_1_2"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kh_0_0_1_2","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["conv_kw_0_0_1_2"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kw_0_0_1_2","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["conv_kh_0_0_2_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kh_0_0_2_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["conv_kw_0_0_2_0"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kw_0_0_2_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["conv_kh_0_0_2_1"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kh_0_0_2_1","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["conv_kw_0_0_2_1"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kw_0_0_2_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["conv_kh_0_0_2_2"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kh_0_0_2_2","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["conv_kw_0_0_2_2"],"attribute":[{"name":"value","type":4,"t":{"name":"conv_kw_0_0_2_2","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Unsqueeze","input":["iter","conv_axes_0"],"output":["conv_unsq_iter_0_out"],"attribute":[]},{"opType":"Reshape","input":["X","conv_x_flat_shape_0"],"output":["conv_x_flat_0"],"attribute":[]},{"opType":"Reshape","input":["W","conv_w_flat_shape_0"],"output":["conv_w_flat_0"],"attribute":[]},{"opType":"Mod","input":["iter","mr_dim_conv_iter_0_3"],"output":["mr_mod_out_conv_iter_0_3"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_conv_iter_0_3"],"output":["mr_div_out_conv_iter_0_3"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_conv_iter_0_3","mr_dim_conv_iter_0_2"],"output":["mr_mod_out_conv_iter_0_2"],"attribute":[]},{"opType":"Div","input":["mr_div_out_conv_iter_0_3","mr_dim_conv_iter_0_2"],"output":["mr_div_out_conv_iter_0_2"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_conv_iter_0_2","mr_dim_conv_iter_0_1"],"output":["mr_mod_out_conv_iter_0_1"],"attribute":[]},{"opType":"Div","input":["mr_div_out_conv_iter_0_2","mr_dim_conv_iter_0_1"],"output":["mr_div_out_conv_iter_0_1"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_conv_iter_0_1","mr_dim_conv_iter_0_0"],"output":["mr_mod_out_conv_iter_0_0"],"attribute":[]},{"opType":"Div","input":["mr_div_out_conv_iter_0_1","mr_dim_conv_iter_0_0"],"output":["mr_div_out_conv_iter_0_0"],"attribute":[]},{"opType":"Div","input":["mr_mod_out_conv_iter_0_1","conv_MperG_0"],"output":["conv_g_0"],"attribute":[]},{"opType":"Mul","input":["conv_g_0","conv_Cw_0"],"output":["conv_gBase_0"],"attribute":[]},{"opType":"Add","input":["conv_gBase_0","conv_cRel_0_0"],"output":["conv_cAbs_0_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_2","conv_strideH_0"],"output":["conv_hoMulStr_out_0_0_0_0"],"attribute":[]},{"opType":"Mul","input":["conv_kh_0_0_0_0","conv_dilH_0"],"output":["conv_khMulDil_out_0_0_0_0"],"attribute":[]},{"opType":"Add","input":["conv_hoMulStr_out_0_0_0_0","conv_khMulDil_out_0_0_0_0"],"output":["conv_hPad_0_0_0_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_3","conv_strideW_0"],"output":["conv_woMulStr_out_0_0_0_0"],"attribute":[]},{"opType":"Mul","input":["conv_kw_0_0_0_0","conv_dilW_0"],"output":["conv_kwMulDil_out_0_0_0_0"],"attribute":[]},{"opType":"Add","input":["conv_woMulStr_out_0_0_0_0","conv_kwMulDil_out_0_0_0_0"],"output":["conv_wPad_0_0_0_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_0","conv_C_0"],"output":["conv_nMulC_out_0_0_0_0"],"attribute":[]},{"opType":"Add","input":["conv_nMulC_out_0_0_0_0","conv_cAbs_0_0"],"output":["conv_ncPlus_out_0_0_0_0"],"attribute":[]},{"opType":"Mul","input":["conv_ncPlus_out_0_0_0_0","conv_Hpad_0"],"output":["conv_mulHpad_out_0_0_0_0"],"attribute":[]},{"opType":"Add","input":["conv_mulHpad_out_0_0_0_0","conv_hPad_0_0_0_0"],"output":["conv_addHpad_out_0_0_0_0"],"attribute":[]},{"opType":"Mul","input":["conv_addHpad_out_0_0_0_0","conv_Wpad_0"],"output":["conv_mulWpad_out_0_0_0_0"],"attribute":[]},{"opType":"Add","input":["conv_mulWpad_out_0_0_0_0","conv_wPad_0_0_0_0"],"output":["conv_xIdx_0_0_0_0"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_xIdx_0_0_0_0","conv_axes_0"],"output":["conv_xIdx_unsq_0_0_0_0_out"],"attribute":[]},{"opType":"Gather","input":["conv_x_flat_0","conv_xIdx_unsq_0_0_0_0_out"],"output":["conv_xVec_0_0_0_0"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_1","conv_Cw_0"],"output":["conv_mMulCw_out_0_0_0_0"],"attribute":[]},{"opType":"Add","input":["conv_mMulCw_out_0_0_0_0","conv_cRel_0_0"],"output":["conv_mPlusCrel_out_0_0_0_0"],"attribute":[]},{"opType":"Mul","input":["conv_mPlusCrel_out_0_0_0_0","conv_kH_0"],"output":["conv_mulkH_out_0_0_0_0"],"attribute":[]},{"opType":"Add","input":["conv_mulkH_out_0_0_0_0","conv_kh_0_0_0_0"],"output":["conv_addKh_out_0_0_0_0"],"attribute":[]},{"opType":"Mul","input":["conv_addKh_out_0_0_0_0","conv_kW_0"],"output":["conv_mulkW_out_0_0_0_0"],"attribute":[]},{"opType":"Add","input":["conv_mulkW_out_0_0_0_0","conv_kw_0_0_0_0"],"output":["conv_wIdx_0_0_0_0"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_wIdx_0_0_0_0","conv_axes_0"],"output":["conv_wIdx_unsq_0_0_0_0_out"],"attribute":[]},{"opType":"Gather","input":["conv_w_flat_0","conv_wIdx_unsq_0_0_0_0_out"],"output":["conv_wVec_0_0_0_0"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["conv_xVec_0_0_0_0","conv_wVec_0_0_0_0"],"output":["conv_term_0_0_0_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_2","conv_strideH_0"],"output":["conv_hoMulStr_out_0_0_0_1"],"attribute":[]},{"opType":"Mul","input":["conv_kh_0_0_0_1","conv_dilH_0"],"output":["conv_khMulDil_out_0_0_0_1"],"attribute":[]},{"opType":"Add","input":["conv_hoMulStr_out_0_0_0_1","conv_khMulDil_out_0_0_0_1"],"output":["conv_hPad_0_0_0_1"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_3","conv_strideW_0"],"output":["conv_woMulStr_out_0_0_0_1"],"attribute":[]},{"opType":"Mul","input":["conv_kw_0_0_0_1","conv_dilW_0"],"output":["conv_kwMulDil_out_0_0_0_1"],"attribute":[]},{"opType":"Add","input":["conv_woMulStr_out_0_0_0_1","conv_kwMulDil_out_0_0_0_1"],"output":["conv_wPad_0_0_0_1"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_0","conv_C_0"],"output":["conv_nMulC_out_0_0_0_1"],"attribute":[]},{"opType":"Add","input":["conv_nMulC_out_0_0_0_1","conv_cAbs_0_0"],"output":["conv_ncPlus_out_0_0_0_1"],"attribute":[]},{"opType":"Mul","input":["conv_ncPlus_out_0_0_0_1","conv_Hpad_0"],"output":["conv_mulHpad_out_0_0_0_1"],"attribute":[]},{"opType":"Add","input":["conv_mulHpad_out_0_0_0_1","conv_hPad_0_0_0_1"],"output":["conv_addHpad_out_0_0_0_1"],"attribute":[]},{"opType":"Mul","input":["conv_addHpad_out_0_0_0_1","conv_Wpad_0"],"output":["conv_mulWpad_out_0_0_0_1"],"attribute":[]},{"opType":"Add","input":["conv_mulWpad_out_0_0_0_1","conv_wPad_0_0_0_1"],"output":["conv_xIdx_0_0_0_1"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_xIdx_0_0_0_1","conv_axes_0"],"output":["conv_xIdx_unsq_0_0_0_1_out"],"attribute":[]},{"opType":"Gather","input":["conv_x_flat_0","conv_xIdx_unsq_0_0_0_1_out"],"output":["conv_xVec_0_0_0_1"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_1","conv_Cw_0"],"output":["conv_mMulCw_out_0_0_0_1"],"attribute":[]},{"opType":"Add","input":["conv_mMulCw_out_0_0_0_1","conv_cRel_0_0"],"output":["conv_mPlusCrel_out_0_0_0_1"],"attribute":[]},{"opType":"Mul","input":["conv_mPlusCrel_out_0_0_0_1","conv_kH_0"],"output":["conv_mulkH_out_0_0_0_1"],"attribute":[]},{"opType":"Add","input":["conv_mulkH_out_0_0_0_1","conv_kh_0_0_0_1"],"output":["conv_addKh_out_0_0_0_1"],"attribute":[]},{"opType":"Mul","input":["conv_addKh_out_0_0_0_1","conv_kW_0"],"output":["conv_mulkW_out_0_0_0_1"],"attribute":[]},{"opType":"Add","input":["conv_mulkW_out_0_0_0_1","conv_kw_0_0_0_1"],"output":["conv_wIdx_0_0_0_1"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_wIdx_0_0_0_1","conv_axes_0"],"output":["conv_wIdx_unsq_0_0_0_1_out"],"attribute":[]},{"opType":"Gather","input":["conv_w_flat_0","conv_wIdx_unsq_0_0_0_1_out"],"output":["conv_wVec_0_0_0_1"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["conv_xVec_0_0_0_1","conv_wVec_0_0_0_1"],"output":["conv_term_0_0_0_1"],"attribute":[]},{"opType":"Add","input":["conv_term_0_0_0_0","conv_term_0_0_0_1"],"output":["conv_acc_0_0_0_1"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_2","conv_strideH_0"],"output":["conv_hoMulStr_out_0_0_0_2"],"attribute":[]},{"opType":"Mul","input":["conv_kh_0_0_0_2","conv_dilH_0"],"output":["conv_khMulDil_out_0_0_0_2"],"attribute":[]},{"opType":"Add","input":["conv_hoMulStr_out_0_0_0_2","conv_khMulDil_out_0_0_0_2"],"output":["conv_hPad_0_0_0_2"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_3","conv_strideW_0"],"output":["conv_woMulStr_out_0_0_0_2"],"attribute":[]},{"opType":"Mul","input":["conv_kw_0_0_0_2","conv_dilW_0"],"output":["conv_kwMulDil_out_0_0_0_2"],"attribute":[]},{"opType":"Add","input":["conv_woMulStr_out_0_0_0_2","conv_kwMulDil_out_0_0_0_2"],"output":["conv_wPad_0_0_0_2"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_0","conv_C_0"],"output":["conv_nMulC_out_0_0_0_2"],"attribute":[]},{"opType":"Add","input":["conv_nMulC_out_0_0_0_2","conv_cAbs_0_0"],"output":["conv_ncPlus_out_0_0_0_2"],"attribute":[]},{"opType":"Mul","input":["conv_ncPlus_out_0_0_0_2","conv_Hpad_0"],"output":["conv_mulHpad_out_0_0_0_2"],"attribute":[]},{"opType":"Add","input":["conv_mulHpad_out_0_0_0_2","conv_hPad_0_0_0_2"],"output":["conv_addHpad_out_0_0_0_2"],"attribute":[]},{"opType":"Mul","input":["conv_addHpad_out_0_0_0_2","conv_Wpad_0"],"output":["conv_mulWpad_out_0_0_0_2"],"attribute":[]},{"opType":"Add","input":["conv_mulWpad_out_0_0_0_2","conv_wPad_0_0_0_2"],"output":["conv_xIdx_0_0_0_2"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_xIdx_0_0_0_2","conv_axes_0"],"output":["conv_xIdx_unsq_0_0_0_2_out"],"attribute":[]},{"opType":"Gather","input":["conv_x_flat_0","conv_xIdx_unsq_0_0_0_2_out"],"output":["conv_xVec_0_0_0_2"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_1","conv_Cw_0"],"output":["conv_mMulCw_out_0_0_0_2"],"attribute":[]},{"opType":"Add","input":["conv_mMulCw_out_0_0_0_2","conv_cRel_0_0"],"output":["conv_mPlusCrel_out_0_0_0_2"],"attribute":[]},{"opType":"Mul","input":["conv_mPlusCrel_out_0_0_0_2","conv_kH_0"],"output":["conv_mulkH_out_0_0_0_2"],"attribute":[]},{"opType":"Add","input":["conv_mulkH_out_0_0_0_2","conv_kh_0_0_0_2"],"output":["conv_addKh_out_0_0_0_2"],"attribute":[]},{"opType":"Mul","input":["conv_addKh_out_0_0_0_2","conv_kW_0"],"output":["conv_mulkW_out_0_0_0_2"],"attribute":[]},{"opType":"Add","input":["conv_mulkW_out_0_0_0_2","conv_kw_0_0_0_2"],"output":["conv_wIdx_0_0_0_2"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_wIdx_0_0_0_2","conv_axes_0"],"output":["conv_wIdx_unsq_0_0_0_2_out"],"attribute":[]},{"opType":"Gather","input":["conv_w_flat_0","conv_wIdx_unsq_0_0_0_2_out"],"output":["conv_wVec_0_0_0_2"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["conv_xVec_0_0_0_2","conv_wVec_0_0_0_2"],"output":["conv_term_0_0_0_2"],"attribute":[]},{"opType":"Add","input":["conv_acc_0_0_0_1","conv_term_0_0_0_2"],"output":["conv_acc_0_0_0_2"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_2","conv_strideH_0"],"output":["conv_hoMulStr_out_0_0_1_0"],"attribute":[]},{"opType":"Mul","input":["conv_kh_0_0_1_0","conv_dilH_0"],"output":["conv_khMulDil_out_0_0_1_0"],"attribute":[]},{"opType":"Add","input":["conv_hoMulStr_out_0_0_1_0","conv_khMulDil_out_0_0_1_0"],"output":["conv_hPad_0_0_1_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_3","conv_strideW_0"],"output":["conv_woMulStr_out_0_0_1_0"],"attribute":[]},{"opType":"Mul","input":["conv_kw_0_0_1_0","conv_dilW_0"],"output":["conv_kwMulDil_out_0_0_1_0"],"attribute":[]},{"opType":"Add","input":["conv_woMulStr_out_0_0_1_0","conv_kwMulDil_out_0_0_1_0"],"output":["conv_wPad_0_0_1_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_0","conv_C_0"],"output":["conv_nMulC_out_0_0_1_0"],"attribute":[]},{"opType":"Add","input":["conv_nMulC_out_0_0_1_0","conv_cAbs_0_0"],"output":["conv_ncPlus_out_0_0_1_0"],"attribute":[]},{"opType":"Mul","input":["conv_ncPlus_out_0_0_1_0","conv_Hpad_0"],"output":["conv_mulHpad_out_0_0_1_0"],"attribute":[]},{"opType":"Add","input":["conv_mulHpad_out_0_0_1_0","conv_hPad_0_0_1_0"],"output":["conv_addHpad_out_0_0_1_0"],"attribute":[]},{"opType":"Mul","input":["conv_addHpad_out_0_0_1_0","conv_Wpad_0"],"output":["conv_mulWpad_out_0_0_1_0"],"attribute":[]},{"opType":"Add","input":["conv_mulWpad_out_0_0_1_0","conv_wPad_0_0_1_0"],"output":["conv_xIdx_0_0_1_0"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_xIdx_0_0_1_0","conv_axes_0"],"output":["conv_xIdx_unsq_0_0_1_0_out"],"attribute":[]},{"opType":"Gather","input":["conv_x_flat_0","conv_xIdx_unsq_0_0_1_0_out"],"output":["conv_xVec_0_0_1_0"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_1","conv_Cw_0"],"output":["conv_mMulCw_out_0_0_1_0"],"attribute":[]},{"opType":"Add","input":["conv_mMulCw_out_0_0_1_0","conv_cRel_0_0"],"output":["conv_mPlusCrel_out_0_0_1_0"],"attribute":[]},{"opType":"Mul","input":["conv_mPlusCrel_out_0_0_1_0","conv_kH_0"],"output":["conv_mulkH_out_0_0_1_0"],"attribute":[]},{"opType":"Add","input":["conv_mulkH_out_0_0_1_0","conv_kh_0_0_1_0"],"output":["conv_addKh_out_0_0_1_0"],"attribute":[]},{"opType":"Mul","input":["conv_addKh_out_0_0_1_0","conv_kW_0"],"output":["conv_mulkW_out_0_0_1_0"],"attribute":[]},{"opType":"Add","input":["conv_mulkW_out_0_0_1_0","conv_kw_0_0_1_0"],"output":["conv_wIdx_0_0_1_0"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_wIdx_0_0_1_0","conv_axes_0"],"output":["conv_wIdx_unsq_0_0_1_0_out"],"attribute":[]},{"opType":"Gather","input":["conv_w_flat_0","conv_wIdx_unsq_0_0_1_0_out"],"output":["conv_wVec_0_0_1_0"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["conv_xVec_0_0_1_0","conv_wVec_0_0_1_0"],"output":["conv_term_0_0_1_0"],"attribute":[]},{"opType":"Add","input":["conv_acc_0_0_0_2","conv_term_0_0_1_0"],"output":["conv_acc_0_0_1_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_2","conv_strideH_0"],"output":["conv_hoMulStr_out_0_0_1_1"],"attribute":[]},{"opType":"Mul","input":["conv_kh_0_0_1_1","conv_dilH_0"],"output":["conv_khMulDil_out_0_0_1_1"],"attribute":[]},{"opType":"Add","input":["conv_hoMulStr_out_0_0_1_1","conv_khMulDil_out_0_0_1_1"],"output":["conv_hPad_0_0_1_1"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_3","conv_strideW_0"],"output":["conv_woMulStr_out_0_0_1_1"],"attribute":[]},{"opType":"Mul","input":["conv_kw_0_0_1_1","conv_dilW_0"],"output":["conv_kwMulDil_out_0_0_1_1"],"attribute":[]},{"opType":"Add","input":["conv_woMulStr_out_0_0_1_1","conv_kwMulDil_out_0_0_1_1"],"output":["conv_wPad_0_0_1_1"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_0","conv_C_0"],"output":["conv_nMulC_out_0_0_1_1"],"attribute":[]},{"opType":"Add","input":["conv_nMulC_out_0_0_1_1","conv_cAbs_0_0"],"output":["conv_ncPlus_out_0_0_1_1"],"attribute":[]},{"opType":"Mul","input":["conv_ncPlus_out_0_0_1_1","conv_Hpad_0"],"output":["conv_mulHpad_out_0_0_1_1"],"attribute":[]},{"opType":"Add","input":["conv_mulHpad_out_0_0_1_1","conv_hPad_0_0_1_1"],"output":["conv_addHpad_out_0_0_1_1"],"attribute":[]},{"opType":"Mul","input":["conv_addHpad_out_0_0_1_1","conv_Wpad_0"],"output":["conv_mulWpad_out_0_0_1_1"],"attribute":[]},{"opType":"Add","input":["conv_mulWpad_out_0_0_1_1","conv_wPad_0_0_1_1"],"output":["conv_xIdx_0_0_1_1"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_xIdx_0_0_1_1","conv_axes_0"],"output":["conv_xIdx_unsq_0_0_1_1_out"],"attribute":[]},{"opType":"Gather","input":["conv_x_flat_0","conv_xIdx_unsq_0_0_1_1_out"],"output":["conv_xVec_0_0_1_1"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_1","conv_Cw_0"],"output":["conv_mMulCw_out_0_0_1_1"],"attribute":[]},{"opType":"Add","input":["conv_mMulCw_out_0_0_1_1","conv_cRel_0_0"],"output":["conv_mPlusCrel_out_0_0_1_1"],"attribute":[]},{"opType":"Mul","input":["conv_mPlusCrel_out_0_0_1_1","conv_kH_0"],"output":["conv_mulkH_out_0_0_1_1"],"attribute":[]},{"opType":"Add","input":["conv_mulkH_out_0_0_1_1","conv_kh_0_0_1_1"],"output":["conv_addKh_out_0_0_1_1"],"attribute":[]},{"opType":"Mul","input":["conv_addKh_out_0_0_1_1","conv_kW_0"],"output":["conv_mulkW_out_0_0_1_1"],"attribute":[]},{"opType":"Add","input":["conv_mulkW_out_0_0_1_1","conv_kw_0_0_1_1"],"output":["conv_wIdx_0_0_1_1"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_wIdx_0_0_1_1","conv_axes_0"],"output":["conv_wIdx_unsq_0_0_1_1_out"],"attribute":[]},{"opType":"Gather","input":["conv_w_flat_0","conv_wIdx_unsq_0_0_1_1_out"],"output":["conv_wVec_0_0_1_1"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["conv_xVec_0_0_1_1","conv_wVec_0_0_1_1"],"output":["conv_term_0_0_1_1"],"attribute":[]},{"opType":"Add","input":["conv_acc_0_0_1_0","conv_term_0_0_1_1"],"output":["conv_acc_0_0_1_1"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_2","conv_strideH_0"],"output":["conv_hoMulStr_out_0_0_1_2"],"attribute":[]},{"opType":"Mul","input":["conv_kh_0_0_1_2","conv_dilH_0"],"output":["conv_khMulDil_out_0_0_1_2"],"attribute":[]},{"opType":"Add","input":["conv_hoMulStr_out_0_0_1_2","conv_khMulDil_out_0_0_1_2"],"output":["conv_hPad_0_0_1_2"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_3","conv_strideW_0"],"output":["conv_woMulStr_out_0_0_1_2"],"attribute":[]},{"opType":"Mul","input":["conv_kw_0_0_1_2","conv_dilW_0"],"output":["conv_kwMulDil_out_0_0_1_2"],"attribute":[]},{"opType":"Add","input":["conv_woMulStr_out_0_0_1_2","conv_kwMulDil_out_0_0_1_2"],"output":["conv_wPad_0_0_1_2"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_0","conv_C_0"],"output":["conv_nMulC_out_0_0_1_2"],"attribute":[]},{"opType":"Add","input":["conv_nMulC_out_0_0_1_2","conv_cAbs_0_0"],"output":["conv_ncPlus_out_0_0_1_2"],"attribute":[]},{"opType":"Mul","input":["conv_ncPlus_out_0_0_1_2","conv_Hpad_0"],"output":["conv_mulHpad_out_0_0_1_2"],"attribute":[]},{"opType":"Add","input":["conv_mulHpad_out_0_0_1_2","conv_hPad_0_0_1_2"],"output":["conv_addHpad_out_0_0_1_2"],"attribute":[]},{"opType":"Mul","input":["conv_addHpad_out_0_0_1_2","conv_Wpad_0"],"output":["conv_mulWpad_out_0_0_1_2"],"attribute":[]},{"opType":"Add","input":["conv_mulWpad_out_0_0_1_2","conv_wPad_0_0_1_2"],"output":["conv_xIdx_0_0_1_2"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_xIdx_0_0_1_2","conv_axes_0"],"output":["conv_xIdx_unsq_0_0_1_2_out"],"attribute":[]},{"opType":"Gather","input":["conv_x_flat_0","conv_xIdx_unsq_0_0_1_2_out"],"output":["conv_xVec_0_0_1_2"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_1","conv_Cw_0"],"output":["conv_mMulCw_out_0_0_1_2"],"attribute":[]},{"opType":"Add","input":["conv_mMulCw_out_0_0_1_2","conv_cRel_0_0"],"output":["conv_mPlusCrel_out_0_0_1_2"],"attribute":[]},{"opType":"Mul","input":["conv_mPlusCrel_out_0_0_1_2","conv_kH_0"],"output":["conv_mulkH_out_0_0_1_2"],"attribute":[]},{"opType":"Add","input":["conv_mulkH_out_0_0_1_2","conv_kh_0_0_1_2"],"output":["conv_addKh_out_0_0_1_2"],"attribute":[]},{"opType":"Mul","input":["conv_addKh_out_0_0_1_2","conv_kW_0"],"output":["conv_mulkW_out_0_0_1_2"],"attribute":[]},{"opType":"Add","input":["conv_mulkW_out_0_0_1_2","conv_kw_0_0_1_2"],"output":["conv_wIdx_0_0_1_2"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_wIdx_0_0_1_2","conv_axes_0"],"output":["conv_wIdx_unsq_0_0_1_2_out"],"attribute":[]},{"opType":"Gather","input":["conv_w_flat_0","conv_wIdx_unsq_0_0_1_2_out"],"output":["conv_wVec_0_0_1_2"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["conv_xVec_0_0_1_2","conv_wVec_0_0_1_2"],"output":["conv_term_0_0_1_2"],"attribute":[]},{"opType":"Add","input":["conv_acc_0_0_1_1","conv_term_0_0_1_2"],"output":["conv_acc_0_0_1_2"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_2","conv_strideH_0"],"output":["conv_hoMulStr_out_0_0_2_0"],"attribute":[]},{"opType":"Mul","input":["conv_kh_0_0_2_0","conv_dilH_0"],"output":["conv_khMulDil_out_0_0_2_0"],"attribute":[]},{"opType":"Add","input":["conv_hoMulStr_out_0_0_2_0","conv_khMulDil_out_0_0_2_0"],"output":["conv_hPad_0_0_2_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_3","conv_strideW_0"],"output":["conv_woMulStr_out_0_0_2_0"],"attribute":[]},{"opType":"Mul","input":["conv_kw_0_0_2_0","conv_dilW_0"],"output":["conv_kwMulDil_out_0_0_2_0"],"attribute":[]},{"opType":"Add","input":["conv_woMulStr_out_0_0_2_0","conv_kwMulDil_out_0_0_2_0"],"output":["conv_wPad_0_0_2_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_0","conv_C_0"],"output":["conv_nMulC_out_0_0_2_0"],"attribute":[]},{"opType":"Add","input":["conv_nMulC_out_0_0_2_0","conv_cAbs_0_0"],"output":["conv_ncPlus_out_0_0_2_0"],"attribute":[]},{"opType":"Mul","input":["conv_ncPlus_out_0_0_2_0","conv_Hpad_0"],"output":["conv_mulHpad_out_0_0_2_0"],"attribute":[]},{"opType":"Add","input":["conv_mulHpad_out_0_0_2_0","conv_hPad_0_0_2_0"],"output":["conv_addHpad_out_0_0_2_0"],"attribute":[]},{"opType":"Mul","input":["conv_addHpad_out_0_0_2_0","conv_Wpad_0"],"output":["conv_mulWpad_out_0_0_2_0"],"attribute":[]},{"opType":"Add","input":["conv_mulWpad_out_0_0_2_0","conv_wPad_0_0_2_0"],"output":["conv_xIdx_0_0_2_0"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_xIdx_0_0_2_0","conv_axes_0"],"output":["conv_xIdx_unsq_0_0_2_0_out"],"attribute":[]},{"opType":"Gather","input":["conv_x_flat_0","conv_xIdx_unsq_0_0_2_0_out"],"output":["conv_xVec_0_0_2_0"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_1","conv_Cw_0"],"output":["conv_mMulCw_out_0_0_2_0"],"attribute":[]},{"opType":"Add","input":["conv_mMulCw_out_0_0_2_0","conv_cRel_0_0"],"output":["conv_mPlusCrel_out_0_0_2_0"],"attribute":[]},{"opType":"Mul","input":["conv_mPlusCrel_out_0_0_2_0","conv_kH_0"],"output":["conv_mulkH_out_0_0_2_0"],"attribute":[]},{"opType":"Add","input":["conv_mulkH_out_0_0_2_0","conv_kh_0_0_2_0"],"output":["conv_addKh_out_0_0_2_0"],"attribute":[]},{"opType":"Mul","input":["conv_addKh_out_0_0_2_0","conv_kW_0"],"output":["conv_mulkW_out_0_0_2_0"],"attribute":[]},{"opType":"Add","input":["conv_mulkW_out_0_0_2_0","conv_kw_0_0_2_0"],"output":["conv_wIdx_0_0_2_0"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_wIdx_0_0_2_0","conv_axes_0"],"output":["conv_wIdx_unsq_0_0_2_0_out"],"attribute":[]},{"opType":"Gather","input":["conv_w_flat_0","conv_wIdx_unsq_0_0_2_0_out"],"output":["conv_wVec_0_0_2_0"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["conv_xVec_0_0_2_0","conv_wVec_0_0_2_0"],"output":["conv_term_0_0_2_0"],"attribute":[]},{"opType":"Add","input":["conv_acc_0_0_1_2","conv_term_0_0_2_0"],"output":["conv_acc_0_0_2_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_2","conv_strideH_0"],"output":["conv_hoMulStr_out_0_0_2_1"],"attribute":[]},{"opType":"Mul","input":["conv_kh_0_0_2_1","conv_dilH_0"],"output":["conv_khMulDil_out_0_0_2_1"],"attribute":[]},{"opType":"Add","input":["conv_hoMulStr_out_0_0_2_1","conv_khMulDil_out_0_0_2_1"],"output":["conv_hPad_0_0_2_1"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_3","conv_strideW_0"],"output":["conv_woMulStr_out_0_0_2_1"],"attribute":[]},{"opType":"Mul","input":["conv_kw_0_0_2_1","conv_dilW_0"],"output":["conv_kwMulDil_out_0_0_2_1"],"attribute":[]},{"opType":"Add","input":["conv_woMulStr_out_0_0_2_1","conv_kwMulDil_out_0_0_2_1"],"output":["conv_wPad_0_0_2_1"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_0","conv_C_0"],"output":["conv_nMulC_out_0_0_2_1"],"attribute":[]},{"opType":"Add","input":["conv_nMulC_out_0_0_2_1","conv_cAbs_0_0"],"output":["conv_ncPlus_out_0_0_2_1"],"attribute":[]},{"opType":"Mul","input":["conv_ncPlus_out_0_0_2_1","conv_Hpad_0"],"output":["conv_mulHpad_out_0_0_2_1"],"attribute":[]},{"opType":"Add","input":["conv_mulHpad_out_0_0_2_1","conv_hPad_0_0_2_1"],"output":["conv_addHpad_out_0_0_2_1"],"attribute":[]},{"opType":"Mul","input":["conv_addHpad_out_0_0_2_1","conv_Wpad_0"],"output":["conv_mulWpad_out_0_0_2_1"],"attribute":[]},{"opType":"Add","input":["conv_mulWpad_out_0_0_2_1","conv_wPad_0_0_2_1"],"output":["conv_xIdx_0_0_2_1"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_xIdx_0_0_2_1","conv_axes_0"],"output":["conv_xIdx_unsq_0_0_2_1_out"],"attribute":[]},{"opType":"Gather","input":["conv_x_flat_0","conv_xIdx_unsq_0_0_2_1_out"],"output":["conv_xVec_0_0_2_1"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_1","conv_Cw_0"],"output":["conv_mMulCw_out_0_0_2_1"],"attribute":[]},{"opType":"Add","input":["conv_mMulCw_out_0_0_2_1","conv_cRel_0_0"],"output":["conv_mPlusCrel_out_0_0_2_1"],"attribute":[]},{"opType":"Mul","input":["conv_mPlusCrel_out_0_0_2_1","conv_kH_0"],"output":["conv_mulkH_out_0_0_2_1"],"attribute":[]},{"opType":"Add","input":["conv_mulkH_out_0_0_2_1","conv_kh_0_0_2_1"],"output":["conv_addKh_out_0_0_2_1"],"attribute":[]},{"opType":"Mul","input":["conv_addKh_out_0_0_2_1","conv_kW_0"],"output":["conv_mulkW_out_0_0_2_1"],"attribute":[]},{"opType":"Add","input":["conv_mulkW_out_0_0_2_1","conv_kw_0_0_2_1"],"output":["conv_wIdx_0_0_2_1"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_wIdx_0_0_2_1","conv_axes_0"],"output":["conv_wIdx_unsq_0_0_2_1_out"],"attribute":[]},{"opType":"Gather","input":["conv_w_flat_0","conv_wIdx_unsq_0_0_2_1_out"],"output":["conv_wVec_0_0_2_1"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["conv_xVec_0_0_2_1","conv_wVec_0_0_2_1"],"output":["conv_term_0_0_2_1"],"attribute":[]},{"opType":"Add","input":["conv_acc_0_0_2_0","conv_term_0_0_2_1"],"output":["conv_acc_0_0_2_1"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_2","conv_strideH_0"],"output":["conv_hoMulStr_out_0_0_2_2"],"attribute":[]},{"opType":"Mul","input":["conv_kh_0_0_2_2","conv_dilH_0"],"output":["conv_khMulDil_out_0_0_2_2"],"attribute":[]},{"opType":"Add","input":["conv_hoMulStr_out_0_0_2_2","conv_khMulDil_out_0_0_2_2"],"output":["conv_hPad_0_0_2_2"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_3","conv_strideW_0"],"output":["conv_woMulStr_out_0_0_2_2"],"attribute":[]},{"opType":"Mul","input":["conv_kw_0_0_2_2","conv_dilW_0"],"output":["conv_kwMulDil_out_0_0_2_2"],"attribute":[]},{"opType":"Add","input":["conv_woMulStr_out_0_0_2_2","conv_kwMulDil_out_0_0_2_2"],"output":["conv_wPad_0_0_2_2"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_0","conv_C_0"],"output":["conv_nMulC_out_0_0_2_2"],"attribute":[]},{"opType":"Add","input":["conv_nMulC_out_0_0_2_2","conv_cAbs_0_0"],"output":["conv_ncPlus_out_0_0_2_2"],"attribute":[]},{"opType":"Mul","input":["conv_ncPlus_out_0_0_2_2","conv_Hpad_0"],"output":["conv_mulHpad_out_0_0_2_2"],"attribute":[]},{"opType":"Add","input":["conv_mulHpad_out_0_0_2_2","conv_hPad_0_0_2_2"],"output":["conv_addHpad_out_0_0_2_2"],"attribute":[]},{"opType":"Mul","input":["conv_addHpad_out_0_0_2_2","conv_Wpad_0"],"output":["conv_mulWpad_out_0_0_2_2"],"attribute":[]},{"opType":"Add","input":["conv_mulWpad_out_0_0_2_2","conv_wPad_0_0_2_2"],"output":["conv_xIdx_0_0_2_2"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_xIdx_0_0_2_2","conv_axes_0"],"output":["conv_xIdx_unsq_0_0_2_2_out"],"attribute":[]},{"opType":"Gather","input":["conv_x_flat_0","conv_xIdx_unsq_0_0_2_2_out"],"output":["conv_xVec_0_0_2_2"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["mr_mod_out_conv_iter_0_1","conv_Cw_0"],"output":["conv_mMulCw_out_0_0_2_2"],"attribute":[]},{"opType":"Add","input":["conv_mMulCw_out_0_0_2_2","conv_cRel_0_0"],"output":["conv_mPlusCrel_out_0_0_2_2"],"attribute":[]},{"opType":"Mul","input":["conv_mPlusCrel_out_0_0_2_2","conv_kH_0"],"output":["conv_mulkH_out_0_0_2_2"],"attribute":[]},{"opType":"Add","input":["conv_mulkH_out_0_0_2_2","conv_kh_0_0_2_2"],"output":["conv_addKh_out_0_0_2_2"],"attribute":[]},{"opType":"Mul","input":["conv_addKh_out_0_0_2_2","conv_kW_0"],"output":["conv_mulkW_out_0_0_2_2"],"attribute":[]},{"opType":"Add","input":["conv_mulkW_out_0_0_2_2","conv_kw_0_0_2_2"],"output":["conv_wIdx_0_0_2_2"],"attribute":[]},{"opType":"Unsqueeze","input":["conv_wIdx_0_0_2_2","conv_axes_0"],"output":["conv_wIdx_unsq_0_0_2_2_out"],"attribute":[]},{"opType":"Gather","input":["conv_w_flat_0","conv_wIdx_unsq_0_0_2_2_out"],"output":["conv_wVec_0_0_2_2"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mul","input":["conv_xVec_0_0_2_2","conv_wVec_0_0_2_2"],"output":["conv_term_0_0_2_2"],"attribute":[]},{"opType":"Add","input":["conv_acc_0_0_2_1","conv_term_0_0_2_2"],"output":["conv_acc_0_0_2_2"],"attribute":[]},{"opType":"Add","input":["conv_acc_0_0_2_2","B"],"output":["conv_y_bias_0"],"attribute":[]},{"opType":"Identity","input":["cond_in"],"output":["cond_out"],"attribute":[]},{"opType":"ScatterElements","input":["carry","conv_unsq_iter_0_out","conv_y_bias_0"],"output":["carry_out"],"attribute":[{"name":"axis","i":0,"type":2}]}],"input":[{"name":"iter","type":{"tensorType":{"elemType":7,"shape":{"dim":[]}}}},{"name":"cond_in","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":4}]}}}}],"output":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":4}]}}}}],"valueInfo":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":4}]}}}},{"name":"X","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}},{"name":"W","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}},{"name":"B","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}}]}}]},{"opType":"Reshape","input":["loop_out","reshape_shape_0"],"output":["Y"],"attribute":[]}],"input":[{"name":"X","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":1},{"dimValue":1},{"dimValue":4},{"dimValue":4}]}}}},{"name":"W","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":1},{"dimValue":1},{"dimValue":3},{"dimValue":3}]}}}},{"name":"B","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":1}]}}}}],"output":[{"name":"Y","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":1},{"dimValue":1},{"dimValue":2},{"dimValue":2}]}}}}]}}