{
  "irVersion": 9,
  "opsetImport": [
    {
      "version": 13
    }
  ],
  "graph": {
    "name": "Graph",
    "initializer": [],
    "node": [
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "pads_pad"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "pads_pad",
              "dataType": 7,
              "dims": [
                8
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  1,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  2,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  2,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  1,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "pad_val"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "pad_val",
              "dataType": 1,
              "dims": [
                1
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "ax0"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "ax0",
              "dataType": 7,
              "dims": [
                1
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "ax1"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "ax1",
              "dataType": 7,
              "dims": [
                1
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  1,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "ax2"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "ax2",
              "dataType": 7,
              "dims": [
                1
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  2,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "ax3"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "ax3",
              "dataType": 7,
              "dims": [
                1
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  3,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "oneI"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "oneI",
              "dataType": 7,
              "dims": [
                1
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  1,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "dHc"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "dHc",
              "dataType": 7,
              "dims": [
                1
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  1,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "dWc"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "dWc",
              "dataType": 7,
              "dims": [
                1
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  1,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "oneF"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "oneF",
              "dataType": 1,
              "dims": [
                1
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  0,
                  0,
                  128,
                  63
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "sHc"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "sHc",
              "dataType": 7,
              "dims": [
                1
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  2,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "sWc"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "sWc",
              "dataType": 7,
              "dims": [
                1
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  1,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "axes_nchw"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "axes_nchw",
              "dataType": 7,
              "dims": [
                4
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  1,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  2,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  3,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "steps"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "steps",
              "dataType": 7,
              "dims": [
                4
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  1,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  1,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  2,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  1,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "Nc_0"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "Nc_0",
              "dataType": 7,
              "dims": [
                1
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  1,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "Cgc_0"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "Cgc_0",
              "dataType": 7,
              "dims": [
                1
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  3,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "wend_M_0"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "wend_M_0",
              "dataType": 7,
              "dims": [
                1
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  4,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "wend_C_0"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "wend_C_0",
              "dataType": 7,
              "dims": [
                1
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  3,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "cstart_g0"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "cstart_g0",
              "dataType": 7,
              "dims": [
                4
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "cend_g0"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "cend_g0",
              "dataType": 7,
              "dims": [
                4
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  1,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  3,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  11,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  10,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "wst_g0"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "wst_g0",
              "dataType": 7,
              "dims": [
                4
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "wen_g0"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "wen_g0",
              "dataType": 7,
              "dims": [
                4
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  4,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  3,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  3,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  3,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "st_0_0_0"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "st_0_0_0",
              "dataType": 7,
              "dims": [
                4
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "Hoff_0_0_0"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "Hoff_0_0_0",
              "dataType": 7,
              "dims": [
                1
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "Woff_0_0_0"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "Woff_0_0_0",
              "dataType": 7,
              "dims": [
                1
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "wst_tap_0_0_0"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "wst_tap_0_0_0",
              "dataType": 7,
              "dims": [
                4
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "wen_tail_0_0_0"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "wen_tail_0_0_0",
              "dataType": 7,
              "dims": [
                2
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  1,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  1,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "axes1_0_0_0"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "axes1_0_0_0",
              "dataType": 7,
              "dims": [
                1
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  1,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "axes0_0_0_0"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "axes0_0_0_0",
              "dataType": 7,
              "dims": [
                1
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "axesC_0_0_0"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "axesC_0_0_0",
              "dataType": 7,
              "dims": [
                1
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  2,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "st_0_0_1"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "st_0_0_1",
              "dataType": 7,
              "dims": [
                4
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  1,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "Hoff_0_0_1"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "Hoff_0_0_1",
              "dataType": 7,
              "dims": [
                1
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "Woff_0_0_1"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "Woff_0_0_1",
              "dataType": 7,
              "dims": [
                1
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  1,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "wst_tap_0_0_1"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "wst_tap_0_0_1",
              "dataType": 7,
              "dims": [
                4
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  1,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "wen_tail_0_0_1"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "wen_tail_0_0_1",
              "dataType": 7,
              "dims": [
                2
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  1,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  2,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "axes1_0_0_1"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "axes1_0_0_1",
              "dataType": 7,
              "dims": [
                1
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  1,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "axes0_0_0_1"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "axes0_0_0_1",
              "dataType": 7,
              "dims": [
                1
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "axesC_0_0_1"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "axesC_0_0_1",
              "dataType": 7,
              "dims": [
                1
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  2,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "st_0_0_2"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "st_0_0_2",
              "dataType": 7,
              "dims": [
                4
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  2,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "Hoff_0_0_2"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "Hoff_0_0_2",
              "dataType": 7,
              "dims": [
                1
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "Woff_0_0_2"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "Woff_0_0_2",
              "dataType": 7,
              "dims": [
                1
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  2,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "wst_tap_0_0_2"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "wst_tap_0_0_2",
              "dataType": 7,
              "dims": [
                4
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  2,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "wen_tail_0_0_2"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "wen_tail_0_0_2",
              "dataType": 7,
              "dims": [
                2
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  1,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  3,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "axes1_0_0_2"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "axes1_0_0_2",
              "dataType": 7,
              "dims": [
                1
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  1,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "axes0_0_0_2"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "axes0_0_0_2",
              "dataType": 7,
              "dims": [
                1
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "axesC_0_0_2"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "axesC_0_0_2",
              "dataType": 7,
              "dims": [
                1
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  2,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0
                ]
              }
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "st_0_1_0"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "st_0_1_0",
              "dataType": 7,
              "dims": [
                4
              ],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": [],
              "rawData": {
                "type": "Buffer",
                "data": [
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  0,
                  1,
                  0,
                  0,
                  0,
                  0,
