{"irVersion":9,"opsetImport":[{"version":19}],"graph":{"name":"Graph","initializer":[{"name":"init_carry","dataType":1,"dims":[24],"floatData":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]}],"node":[{"opType":"Constant","input":[],"output":["DQL_axes_0"],"attribute":[{"name":"value","type":4,"t":{"name":"DQL_axes_0","dataType":7,"dims":[2],"int64Data":[0,2]}}]},{"opType":"Constant","input":[],"output":["reshape_shape_DQL_ExpandS_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"reshape_shape_DQL_ExpandS_0_expand_add","dataType":7,"dims":[3],"int64Data":[2,3,4]}}]},{"opType":"Constant","input":[],"output":["trip_count_DQL_ExpandS_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"trip_count_DQL_ExpandS_0_expand_add","dataType":7,"dims":[],"int64Data":[24]}}]},{"opType":"Constant","input":[],"output":["cond_DQL_ExpandS_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"cond_DQL_ExpandS_0_expand_add","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Cast","input":["X"],"output":["DQL_Xf_0"],"attribute":[{"name":"to","i":1,"type":2}]},{"opType":"Cast","input":["S"],"output":["DQL_Sf_0"],"attribute":[{"name":"to","i":1,"type":2}]},{"opType":"Cast","input":["Z"],"output":["DQL_Zf_0"],"attribute":[{"name":"to","i":1,"type":2}]},{"opType":"Shape","input":["DQL_Xf_0"],"output":["DQL_shapeX_0"],"attribute":[]},{"opType":"Unsqueeze","input":["DQL_Sf_0","DQL_axes_0"],"output":["DQL_Srank_0"],"attribute":[]},{"opType":"Unsqueeze","input":["DQL_Zf_0","DQL_axes_0"],"output":["DQL_Zrank_0"],"attribute":[]},{"opType":"ConstantOfShape","input":["DQL_shapeX_0"],"output":["DQL_ExpandS_0_expand_fill_out"],"attribute":[]},{"opType":"ConstantOfShape","input":["DQL_shapeX_0"],"output":["DQL_ExpandZ_0_expand_fill_out"],"attribute":[]},{"opType":"Loop","input":["trip_count_DQL_ExpandS_0_expand_add","cond_DQL_ExpandS_0_expand_add","init_carry"],"output":["loop_out"],"attribute":[{"name":"body","type":5,"g":{"name":"loop_body_0","initializer":[],"node":[{"opType":"Constant","input":[],"output":["axes"],"attribute":[{"name":"value","type":4,"t":{"name":"axes","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_DQL_Srank_0_DQL_ExpandS_0_expand_add_2"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_DQL_Srank_0_DQL_ExpandS_0_expand_add_2","dataType":7,"dims":[],"int64Data":[4]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_DQL_Srank_0_DQL_ExpandS_0_expand_add_1"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_DQL_Srank_0_DQL_ExpandS_0_expand_add_1","dataType":7,"dims":[],"int64Data":[3]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_DQL_Srank_0_DQL_ExpandS_0_expand_add_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_DQL_Srank_0_DQL_ExpandS_0_expand_add_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["gb_zero_DQL_Srank_0_DQL_ExpandS_0_expand_add_0"],"attribute":[{"name":"value","type":4,"t":{"name":"gb_zero_DQL_Srank_0_DQL_ExpandS_0_expand_add_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["gb_zero_DQL_Srank_0_DQL_ExpandS_0_expand_add_2"],"attribute":[{"name":"value","type":4,"t":{"name":"gb_zero_DQL_Srank_0_DQL_ExpandS_0_expand_add_2","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_zero_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add_0","dataType":7,"dims":[],"int64Data":[3]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add_1"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add_2"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add_2","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["flat_shape_DQL_Srank_0"],"attribute":[{"name":"value","type":4,"t":{"name":"flat_shape_DQL_Srank_0","dataType":7,"dims":[1],"int64Data":[-1]}}]},{"opType":"Constant","input":[],"output":["sg_len_idx_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"sg_len_idx_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_2"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_2","dataType":7,"dims":[],"int64Data":[4]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_1"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_1","dataType":7,"dims":[],"int64Data":[3]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["lin_zero_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_0","dataType":7,"dims":[],"int64Data":[12]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_1"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_1","dataType":7,"dims":[],"int64Data":[4]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_2"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_2","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["flat_shape_DQL_ExpandS_0_expand_fill_out"],"attribute":[{"name":"value","type":4,"t":{"name":"flat_shape_DQL_ExpandS_0_expand_fill_out","dataType":7,"dims":[1],"int64Data":[-1]}}]},{"opType":"Constant","input":[],"output":["sg_len_idx_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"sg_len_idx_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_2"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_2","dataType":7,"dims":[],"int64Data":[4]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_1"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_1","dataType":7,"dims":[],"int64Data":[3]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["gb_zero_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_0"],"attribute":[{"name":"value","type":4,"t":{"name":"gb_zero_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["gb_zero_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_2"],"attribute":[{"name":"value","type":4,"t":{"name":"gb_zero_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_2","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_zero_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_0","dataType":7,"dims":[],"int64Data":[3]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_1"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_2"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_2","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["flat_shape_DQL_Zrank_0"],"attribute":[{"name":"value","type":4,"t":{"name":"flat_shape_DQL_Zrank_0","dataType":7,"dims":[1],"int64Data":[-1]}}]},{"opType":"Constant","input":[],"output":["sg_len_idx_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"sg_len_idx_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_2"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_2","dataType":7,"dims":[],"int64Data":[4]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_1"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_1","dataType":7,"dims":[],"int64Data":[3]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["lin_zero_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_0","dataType":7,"dims":[],"int64Data":[12]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_1"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_1","dataType":7,"dims":[],"int64Data":[4]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_2"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_2","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["flat_shape_DQL_ExpandZ_0_expand_fill_out"],"attribute":[{"name":"value","type":4,"t":{"name":"flat_shape_DQL_ExpandZ_0_expand_fill_out","dataType":7,"dims":[1],"int64Data":[-1]}}]},{"opType":"Constant","input":[],"output":["sg_len_idx_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add"],"attribute":[{"name":"value","type":4,"t":{"name":"sg_len_idx_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_DQL_Xf_0_DQL_Sub_0_2"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_DQL_Xf_0_DQL_Sub_0_2","dataType":7,"dims":[],"int64Data":[4]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_DQL_Xf_0_DQL_Sub_0_1"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_DQL_Xf_0_DQL_Sub_0_1","dataType":7,"dims":[],"int64Data":[3]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_DQL_Xf_0_DQL_Sub_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_DQL_Xf_0_DQL_Sub_0_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["lin_zero_gb_lin_DQL_Xf_0_DQL_Sub_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_gb_lin_DQL_Xf_0_DQL_Sub_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_DQL_Xf_0_DQL_Sub_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_DQL_Xf_0_DQL_Sub_0_0","dataType":7,"dims":[],"int64Data":[12]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_DQL_Xf_0_DQL_Sub_0_1"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_DQL_Xf_0_DQL_Sub_0_1","dataType":7,"dims":[],"int64Data":[4]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_DQL_Xf_0_DQL_Sub_0_2"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_DQL_Xf_0_DQL_Sub_0_2","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["flat_shape_DQL_Xf_0"],"attribute":[{"name":"value","type":4,"t":{"name":"flat_shape_DQL_Xf_0","dataType":7,"dims":[1],"int64Data":[-1]}}]},{"opType":"Constant","input":[],"output":["sg_len_idx_gb_lin_DQL_Xf_0_DQL_Sub_0"],"attribute":[{"name":"value","type":4,"t":{"name":"sg_len_idx_gb_lin_DQL_Xf_0_DQL_Sub_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Unsqueeze","input":["iter","axes"],"output":["unsq_out"],"attribute":[]},{"opType":"Mod","input":["iter","mr_dim_gb_out_DQL_Srank_0_DQL_ExpandS_0_expand_add_2"],"output":["mr_mod_out_gb_out_DQL_Srank_0_DQL_ExpandS_0_expand_add_2"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_gb_out_DQL_Srank_0_DQL_ExpandS_0_expand_add_2"],"output":["mr_div_out_gb_out_DQL_Srank_0_DQL_ExpandS_0_expand_add_2"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_DQL_Srank_0_DQL_ExpandS_0_expand_add_2","mr_dim_gb_out_DQL_Srank_0_DQL_ExpandS_0_expand_add_1"],"output":["mr_mod_out_gb_out_DQL_Srank_0_DQL_ExpandS_0_expand_add_1"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_DQL_Srank_0_DQL_ExpandS_0_expand_add_2","mr_dim_gb_out_DQL_Srank_0_DQL_ExpandS_0_expand_add_1"],"output":["mr_div_out_gb_out_DQL_Srank_0_DQL_ExpandS_0_expand_add_1"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_DQL_Srank_0_DQL_ExpandS_0_expand_add_1","mr_dim_gb_out_DQL_Srank_0_DQL_ExpandS_0_expand_add_0"],"output":["mr_mod_out_gb_out_DQL_Srank_0_DQL_ExpandS_0_expand_add_0"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_DQL_Srank_0_DQL_ExpandS_0_expand_add_1","mr_dim_gb_out_DQL_Srank_0_DQL_ExpandS_0_expand_add_0"],"output":["mr_div_out_gb_out_DQL_Srank_0_DQL_ExpandS_0_expand_add_0"],"attribute":[]},{"opType":"Mul","input":["gb_zero_DQL_Srank_0_DQL_ExpandS_0_expand_add_0","lin_stride_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add_0"],"output":["lin_mul_out_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add_0"],"attribute":[]},{"opType":"Add","input":["lin_zero_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add","lin_mul_out_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add_0"],"output":["lin_add_out_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_DQL_Srank_0_DQL_ExpandS_0_expand_add_1","lin_stride_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add_1"],"output":["lin_mul_out_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add_1"],"attribute":[]},{"opType":"Add","input":["lin_add_out_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add_0","lin_mul_out_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add_1"],"output":["lin_add_out_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add_1"],"attribute":[]},{"opType":"Mul","input":["gb_zero_DQL_Srank_0_DQL_ExpandS_0_expand_add_2","lin_stride_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add_2"],"output":["lin_mul_out_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add_2"],"attribute":[]},{"opType":"Add","input":["lin_add_out_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add_1","lin_mul_out_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add_2"],"output":["lin_add_out_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add_2"],"attribute":[]},{"opType":"Reshape","input":["DQL_Srank_0","flat_shape_DQL_Srank_0"],"output":["DQL_Srank_0_flat"],"attribute":[]},{"opType":"Shape","input":["DQL_Srank_0_flat"],"output":["sg_shape_out_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add"],"attribute":[]},{"opType":"Gather","input":["sg_shape_out_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add","sg_len_idx_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add"],"output":["sg_len_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["lin_add_out_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add_2","sg_len_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add_out"],"output":["Mod_sg_mod_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add_out"],"attribute":[]},{"opType":"Unsqueeze","input":["Mod_sg_mod_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add_out","axes"],"output":["sg_idx_unsq_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add_out"],"attribute":[]},{"opType":"Gather","input":["DQL_Srank_0_flat","sg_idx_unsq_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add_out"],"output":["sg_g_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["iter","mr_dim_gb_out_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_2"],"output":["mr_mod_out_gb_out_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_2"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_gb_out_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_2"],"output":["mr_div_out_gb_out_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_2"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_2","mr_dim_gb_out_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_1"],"output":["mr_mod_out_gb_out_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_1"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_2","mr_dim_gb_out_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_1"],"output":["mr_div_out_gb_out_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_1"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_1","mr_dim_gb_out_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_0"],"output":["mr_mod_out_gb_out_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_0"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_1","mr_dim_gb_out_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_0"],"output":["mr_div_out_gb_out_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_0","lin_stride_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_0"],"output":["lin_mul_out_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_0"],"attribute":[]},{"opType":"Add","input":["lin_zero_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add","lin_mul_out_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_0"],"output":["lin_add_out_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_1","lin_stride_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_1"],"output":["lin_mul_out_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_1"],"attribute":[]},{"opType":"Add","input":["lin_add_out_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_0","lin_mul_out_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_1"],"output":["lin_add_out_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_1"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_2","lin_stride_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_2"],"output":["lin_mul_out_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_2"],"attribute":[]},{"opType":"Add","input":["lin_add_out_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_1","lin_mul_out_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_2"],"output":["lin_add_out_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_2"],"attribute":[]},{"opType":"Reshape","input":["DQL_ExpandS_0_expand_fill_out","flat_shape_DQL_ExpandS_0_expand_fill_out"],"output":["DQL_ExpandS_0_expand_fill_out_flat"],"attribute":[]},{"opType":"Shape","input":["DQL_ExpandS_0_expand_fill_out_flat"],"output":["sg_shape_out_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add"],"attribute":[]},{"opType":"Gather","input":["sg_shape_out_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add","sg_len_idx_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add"],"output":["sg_len_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["lin_add_out_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_2","sg_len_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_out"],"output":["Mod_sg_mod_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_out"],"attribute":[]},{"opType":"Unsqueeze","input":["Mod_sg_mod_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_out","axes"],"output":["sg_idx_unsq_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_out"],"attribute":[]},{"opType":"Gather","input":["DQL_ExpandS_0_expand_fill_out_flat","sg_idx_unsq_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_out"],"output":["sg_g_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Squeeze","input":["sg_g_gb_lin_DQL_Srank_0_DQL_ExpandS_0_expand_add_out","axes"],"output":["sq_DQL_ExpandS_0_expand_add_in0_scalar_out"],"attribute":[]},{"opType":"Squeeze","input":["sg_g_gb_lin_DQL_ExpandS_0_expand_fill_out_DQL_ExpandS_0_expand_add_out","axes"],"output":["sq_DQL_ExpandS_0_expand_add_in1_scalar_out"],"attribute":[]},{"opType":"Add","input":["sq_DQL_ExpandS_0_expand_add_in0_scalar_out","sq_DQL_ExpandS_0_expand_add_in1_scalar_out"],"output":["DQL_ExpandS_0_expand_add_out"],"attribute":[]},{"opType":"Mod","input":["iter","mr_dim_gb_out_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_2"],"output":["mr_mod_out_gb_out_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_2"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_gb_out_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_2"],"output":["mr_div_out_gb_out_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_2"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_2","mr_dim_gb_out_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_1"],"output":["mr_mod_out_gb_out_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_1"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_2","mr_dim_gb_out_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_1"],"output":["mr_div_out_gb_out_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_1"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_1","mr_dim_gb_out_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_0"],"output":["mr_mod_out_gb_out_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_0"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_1","mr_dim_gb_out_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_0"],"output":["mr_div_out_gb_out_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_0"],"attribute":[]},{"opType":"Mul","input":["gb_zero_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_0","lin_stride_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_0"],"output":["lin_mul_out_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_0"],"attribute":[]},{"opType":"Add","input":["lin_zero_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add","lin_mul_out_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_0"],"output":["lin_add_out_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_1","lin_stride_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_1"],"output":["lin_mul_out_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_1"],"attribute":[]},{"opType":"Add","input":["lin_add_out_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_0","lin_mul_out_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_1"],"output":["lin_add_out_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_1"],"attribute":[]},{"opType":"Mul","input":["gb_zero_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_2","lin_stride_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_2"],"output":["lin_mul_out_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_2"],"attribute":[]},{"opType":"Add","input":["lin_add_out_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_1","lin_mul_out_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_2"],"output":["lin_add_out_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_2"],"attribute":[]},{"opType":"Reshape","input":["DQL_Zrank_0","flat_shape_DQL_Zrank_0"],"output":["DQL_Zrank_0_flat"],"attribute":[]},{"opType":"Shape","input":["DQL_Zrank_0_flat"],"output":["sg_shape_out_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add"],"attribute":[]},{"opType":"Gather","input":["sg_shape_out_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add","sg_len_idx_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add"],"output":["sg_len_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["lin_add_out_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_2","sg_len_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_out"],"output":["Mod_sg_mod_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_out"],"attribute":[]},{"opType":"Unsqueeze","input":["Mod_sg_mod_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_out","axes"],"output":["sg_idx_unsq_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_out"],"attribute":[]},{"opType":"Gather","input":["DQL_Zrank_0_flat","sg_idx_unsq_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_out"],"output":["sg_g_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["iter","mr_dim_gb_out_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_2"],"output":["mr_mod_out_gb_out_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_2"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_gb_out_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_2"],"output":["mr_div_out_gb_out_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_2"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_2","mr_dim_gb_out_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_1"],"output":["mr_mod_out_gb_out_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_1"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_2","mr_dim_gb_out_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_1"],"output":["mr_div_out_gb_out_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_1"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_1","mr_dim_gb_out_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_0"],"output":["mr_mod_out_gb_out_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_0"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_1","mr_dim_gb_out_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_0"],"output":["mr_div_out_gb_out_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_0","lin_stride_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_0"],"output":["lin_mul_out_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_0"],"attribute":[]},{"opType":"Add","input":["lin_zero_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add","lin_mul_out_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_0"],"output":["lin_add_out_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_1","lin_stride_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_1"],"output":["lin_mul_out_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_1"],"attribute":[]},{"opType":"Add","input":["lin_add_out_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_0","lin_mul_out_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_1"],"output":["lin_add_out_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_1"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_2","lin_stride_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_2"],"output":["lin_mul_out_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_2"],"attribute":[]},{"opType":"Add","input":["lin_add_out_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_1","lin_mul_out_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_2"],"output":["lin_add_out_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_2"],"attribute":[]},{"opType":"Reshape","input":["DQL_ExpandZ_0_expand_fill_out","flat_shape_DQL_ExpandZ_0_expand_fill_out"],"output":["DQL_ExpandZ_0_expand_fill_out_flat"],"attribute":[]},{"opType":"Shape","input":["DQL_ExpandZ_0_expand_fill_out_flat"],"output":["sg_shape_out_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add"],"attribute":[]},{"opType":"Gather","input":["sg_shape_out_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add","sg_len_idx_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add"],"output":["sg_len_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["lin_add_out_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_2","sg_len_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_out"],"output":["Mod_sg_mod_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_out"],"attribute":[]},{"opType":"Unsqueeze","input":["Mod_sg_mod_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_out","axes"],"output":["sg_idx_unsq_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_out"],"attribute":[]},{"opType":"Gather","input":["DQL_ExpandZ_0_expand_fill_out_flat","sg_idx_unsq_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_out"],"output":["sg_g_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Squeeze","input":["sg_g_gb_lin_DQL_Zrank_0_DQL_ExpandZ_0_expand_add_out","axes"],"output":["sq_DQL_ExpandZ_0_expand_add_in0_scalar_out"],"attribute":[]},{"opType":"Squeeze","input":["sg_g_gb_lin_DQL_ExpandZ_0_expand_fill_out_DQL_ExpandZ_0_expand_add_out","axes"],"output":["sq_DQL_ExpandZ_0_expand_add_in1_scalar_out"],"attribute":[]},{"opType":"Add","input":["sq_DQL_ExpandZ_0_expand_add_in0_scalar_out","sq_DQL_ExpandZ_0_expand_add_in1_scalar_out"],"output":["DQL_ExpandZ_0_expand_add_out"],"attribute":[]},{"opType":"Mod","input":["iter","mr_dim_gb_out_DQL_Xf_0_DQL_Sub_0_2"],"output":["mr_mod_out_gb_out_DQL_Xf_0_DQL_Sub_0_2"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_gb_out_DQL_Xf_0_DQL_Sub_0_2"],"output":["mr_div_out_gb_out_DQL_Xf_0_DQL_Sub_0_2"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_DQL_Xf_0_DQL_Sub_0_2","mr_dim_gb_out_DQL_Xf_0_DQL_Sub_0_1"],"output":["mr_mod_out_gb_out_DQL_Xf_0_DQL_Sub_0_1"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_DQL_Xf_0_DQL_Sub_0_2","mr_dim_gb_out_DQL_Xf_0_DQL_Sub_0_1"],"output":["mr_div_out_gb_out_DQL_Xf_0_DQL_Sub_0_1"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_DQL_Xf_0_DQL_Sub_0_1","mr_dim_gb_out_DQL_Xf_0_DQL_Sub_0_0"],"output":["mr_mod_out_gb_out_DQL_Xf_0_DQL_Sub_0_0"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_DQL_Xf_0_DQL_Sub_0_1","mr_dim_gb_out_DQL_Xf_0_DQL_Sub_0_0"],"output":["mr_div_out_gb_out_DQL_Xf_0_DQL_Sub_0_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_DQL_Xf_0_DQL_Sub_0_0","lin_stride_gb_lin_DQL_Xf_0_DQL_Sub_0_0"],"output":["lin_mul_out_gb_lin_DQL_Xf_0_DQL_Sub_0_0"],"attribute":[]},{"opType":"Add","input":["lin_zero_gb_lin_DQL_Xf_0_DQL_Sub_0","lin_mul_out_gb_lin_DQL_Xf_0_DQL_Sub_0_0"],"output":["lin_add_out_gb_lin_DQL_Xf_0_DQL_Sub_0_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_DQL_Xf_0_DQL_Sub_0_1","lin_stride_gb_lin_DQL_Xf_0_DQL_Sub_0_1"],"output":["lin_mul_out_gb_lin_DQL_Xf_0_DQL_Sub_0_1"],"attribute":[]},{"opType":"Add","input":["lin_add_out_gb_lin_DQL_Xf_0_DQL_Sub_0_0","lin_mul_out_gb_lin_DQL_Xf_0_DQL_Sub_0_1"],"output":["lin_add_out_gb_lin_DQL_Xf_0_DQL_Sub_0_1"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_DQL_Xf_0_DQL_Sub_0_2","lin_stride_gb_lin_DQL_Xf_0_DQL_Sub_0_2"],"output":["lin_mul_out_gb_lin_DQL_Xf_0_DQL_Sub_0_2"],"attribute":[]},{"opType":"Add","input":["lin_add_out_gb_lin_DQL_Xf_0_DQL_Sub_0_1","lin_mul_out_gb_lin_DQL_Xf_0_DQL_Sub_0_2"],"output":["lin_add_out_gb_lin_DQL_Xf_0_DQL_Sub_0_2"],"attribute":[]},{"opType":"Reshape","input":["DQL_Xf_0","flat_shape_DQL_Xf_0"],"output":["DQL_Xf_0_flat"],"attribute":[]},{"opType":"Shape","input":["DQL_Xf_0_flat"],"output":["sg_shape_out_gb_lin_DQL_Xf_0_DQL_Sub_0"],"attribute":[]},{"opType":"Gather","input":["sg_shape_out_gb_lin_DQL_Xf_0_DQL_Sub_0","sg_len_idx_gb_lin_DQL_Xf_0_DQL_Sub_0"],"output":["sg_len_gb_lin_DQL_Xf_0_DQL_Sub_0_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["lin_add_out_gb_lin_DQL_Xf_0_DQL_Sub_0_2","sg_len_gb_lin_DQL_Xf_0_DQL_Sub_0_out"],"output":["Mod_sg_mod_gb_lin_DQL_Xf_0_DQL_Sub_0_out"],"attribute":[]},{"opType":"Unsqueeze","input":["Mod_sg_mod_gb_lin_DQL_Xf_0_DQL_Sub_0_out","axes"],"output":["sg_idx_unsq_gb_lin_DQL_Xf_0_DQL_Sub_0_out"],"attribute":[]},{"opType":"Gather","input":["DQL_Xf_0_flat","sg_idx_unsq_gb_lin_DQL_Xf_0_DQL_Sub_0_out"],"output":["sg_g_gb_lin_DQL_Xf_0_DQL_Sub_0_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Squeeze","input":["sg_g_gb_lin_DQL_Xf_0_DQL_Sub_0_out","axes"],"output":["sq_DQL_Sub_0_in0_scalar_out"],"attribute":[]},{"opType":"Sub","input":["sq_DQL_Sub_0_in0_scalar_out","DQL_ExpandZ_0_expand_add_out"],"output":["DQL_Sub_0_out"],"attribute":[]},{"opType":"Mul","input":["DQL_Sub_0_out","DQL_ExpandS_0_expand_add_out"],"output":["DQL_Mul_0_out"],"attribute":[]},{"opType":"Unsqueeze","input":["DQL_Mul_0_out","axes"],"output":["updateUnsq_out"],"attribute":[]},{"opType":"Identity","input":["cond_in"],"output":["cond_out"],"attribute":[]},{"opType":"ScatterElements","input":["carry","unsq_out","updateUnsq_out"],"output":["carry_out"],"attribute":[{"name":"axis","i":0,"type":2}]}],"input":[{"name":"iter","type":{"tensorType":{"elemType":7,"shape":{"dim":[]}}}},{"name":"cond_in","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":24}]}}}}],"output":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":24}]}}}}],"valueInfo":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":24}]}}}},{"name":"DQL_Srank_0","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}},{"name":"DQL_ExpandS_0_expand_fill_out","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}},{"name":"DQL_Zrank_0","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}},{"name":"DQL_ExpandZ_0_expand_fill_out","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}},{"name":"DQL_Xf_0","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}}]}}]},{"opType":"Reshape","input":["loop_out","reshape_shape_DQL_ExpandS_0_expand_add"],"output":["Y"],"attribute":[]}],"input":[{"name":"X","type":{"tensorType":{"elemType":2,"shape":{"dim":[{"dimValue":2},{"dimValue":3},{"dimValue":4}]}}}},{"name":"S","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":3}]}}}},{"name":"Z","type":{"tensorType":{"elemType":2,"shape":{"dim":[{"dimValue":3}]}}}}],"output":[{"name":"Y","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":2},{"dimValue":3},{"dimValue":4}]}}}}]}}