{"irVersion":9,"opsetImport":[{"version":19}],"graph":{"name":"head_graph","initializer":[],"node":[{"opType":"Cast","input":["S"],"output":["DQL_Sf_0"],"attribute":[{"name":"to","i":1,"type":2}]}],"input":[{"name":"S","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":3}]}}}}],"output":[{"name":"DQL_Sf_0","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":3}]}}}}]}}