{"irVersion":9,"opsetImport":[{"version":19}],"graph":{"name":"Graph","initializer":[{"name":"zero_point__312","dataType":3,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[14]}},{"name":"zero_point__217","dataType":3,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[128]}},{"name":"zero_point__198","dataType":6,"dims":[64],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]}},{"name":"zero_point__182","dataType":3,"dims":[64],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]}},{"name":"zero_point__172","dataType":6,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[0,0,0,0]}},{"name":"zero_point__170","dataType":3,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[0]}},{"name":"zero_point__168","dataType":3,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[83]}},{"name":"scale__315","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[0,0,128,59]}},{"name":"scale__311","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[70,42,20,62]}},{"name":"scale__296","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[219,82,164,61]}},{"name":"scale__285","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[138,223,63,61]}},{"name":"scale__274","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[90,12,7,61]}},{"name":"scale__267","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[193,2,60,61]}},{"name":"scale__256","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[158,50,25,61]}},{"name":"scale__245","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[84,136,128,61]}},{"name":"scale__236","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[129,221,117,61]}},{"name":"scale__225","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[234,154,169,61]}},{"name":"scale__216","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[200,58,161,61]}},{"name":"scale__207","dataType":1,"dims":[64],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[238,35,76,58,27,223,226,57,85,166,144,57,105,219,162,57,75,162,137,57,125,4,240,57,55,104,116,58,67,144,207,57,255,127,161,57,1,186,37,57,65,239,17,58,24,57,166,57,203,22,45,58,193,249,186,57,209,159,210,57,20,81,108,57,254,71,114,58,228,3,67,57,140,114,115,57,180,240,164,57,240,220,137,57,79,77,19,58,102,47,130,57,34,99,144,58,138,236,120,57,71,49,223,57,244,78,145,57,19,162,247,57,144,221,26,58,21,178,37,58,196,234,181,57,51,201,18,58,241,131,212,57,151,44,167,57,224,216,236,57,9,209,206,57,79,24,69,58,139,187,136,57,68,134,66,57,231,130,123,57,9,213,106,57,75,210,180,57,57,141,164,57,45,5,155,58,205,230,53,58,187,171,58,58,48,240,203,57,135,55,161,57,212,63,228,57,224,234,110,58,251,3,226,57,105,255,25,58,164,77,27,58,247,218,123,57,206,237,237,57,73,251,137,58,40,230,124,57,57,245,192,57,139,43,246,57,230,122,129,57,44,41,188,57,104,159,150,57,114,111,11,58,223,185,124,57]}},{"name":"scale__205","dataType":1,"dims":[64],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[38,123,48,58,128,127,213,57,245,241,62,58,108,181,132,58,100,232,105,58,177,116,147,58,134,63,73,58,1,21,245,57,182,140,76,58,64,129,218,57,240,92,67,58,68,105,102,58,11,11,98,58,93,78,113,58,90,196,27,58,106,124,43,58,224,246,52,58,159,183,148,58,228,65,134,58,210,36,141,58,177,171,160,58,52,187,19,58,0,224,205,58,4,149,55,58,214,133,153,58,133,109,221,57,207,19,62,58,160,28,145,58,172,157,124,58,27,214,138,58,123,211,42,58,170,85,243,57,204,194,71,58,122,9,91,58,254,156,61,58,75,54,88,58,172,188,43,58,222,127,188,57,208,120,130,58,101,103,100,58,52,190,196,58,143,119,127,58,166,51,169,58,152,75,92,58,69,127,37,58,80,236,53,58,218,194,31,58,8,123,226,57,14,102,170,58,218,189,82,58,241,53,84,58,86,52,231,58,143,196,103,58,180,250,26,58,11,144,8,58,6,220,7,58,73,42,124,58,76,29,29,58,49,160,177,58,201,118,134,58,189,73,79,58,90,239,6,58,0,202,114,58,245,80,142,58]}},{"name":"scale__203","dataType":1,"dims":[64],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[185,179,72,57,150,96,160,57,74,226,129,57,171,89,73,57,237,178,160,57,40,118,80,57,148,72,45,57,111,181,142,57,42,83,132,57,74,89,169,57,38,116,145,57,7,116,128,57,6,176,180,57,184,43,134,57,78,208,141,57,33,206,115,57,102,214,84,57,236,194,131,57,10,253,160,57,199,6,123,57,96,15,135,57,113,254,129,57,226,100,205,57,141,142,144,57,129,41,113,57,34,53,147,57,136,81,81,57,88,139,97,57,177,230,111,57,27,39,146,57,97,7,161,57,158,241,158,57,2,4,126,57,245,184,105,57,234,134,174,57,155,221,142,57,7,148,143,57,50,220,167,57,247,131,164,57,74,52,120,57,250,245,178,57,37,109,161,57,22,115,133,57,106,197,171,57,69,83,150,57,14,192,136,57,1,31,42,57,232,86,154,57,198,123,71,57,126,236,134,57,168,248,132,57,22,137,116,57,19,84,103,57,185,86,161,57,197,22,163,57,3,233,152,57,200,58,47,57,71,83,125,57,192,247,117,57,132,54,71,57,78,231,147,57,45,244,92,57,231,252,137,57,114,8,141,57]}},{"name":"scale__201","dataType":1,"dims":[64],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[217,48,205,57,31,91,203,57,118,190,74,58,125,173,17,58,61,201,207,57,25,0,97,58,6,11,186,57,179,215,176,57,145,106,66,58,106,20,208,57,152,160,233,57,239,19,235,57,200,69,222,57,38,12,215,57,116,52,11,58,197,88,8,58,255,75,244,57,93,147,248,57,216,196,207,57,41,204,169,57,87,94,147,57,94,103,145,58,127,142,223,57,196,11,210,57,115,193,244,57,194,110,19,58,250,198,244,57,159,163,182,57,0,164,221,57,238,120,4,58,97,2,171,57,133,107,206,57,185,53,130,58,32,74,218,57,158,65,205,57,224,206,47,58,45,192,153,57,124,87,170,57,1,194,245,57,173,140,158,57,192,84,9,58,223,7,35,58,149,33,254,57,13,124,131,57,12,88,196,57,190,31,16,58,68,255,41,58,126,209,201,57,13,12,223,57,67,237,184,57,4,201,48,58,118,61,79,58,210,81,1,58,89,87,215,57,102,137,180,57,88,76,225,57,130,130,25,58,123,134,20,58,197,136,26,58,8,98,234,57,83,150,233,57,142,206,230,57,81,73,209,57,219,105,235,57]}},{"name":"scale__199","dataType":1,"dims":[64],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[209,248,64,57,190,132,84,57,248,208,68,57,197,223,82,57,227,249,105,57,237,189,154,57,212,15,135,57,70,224,73,57,32,228,98,57,59,246,51,57,152,92,151,57,30,70,56,57,197,85,42,57,121,159,114,57,231,66,193,57,151,149,48,57,108,168,132,57,117,72,24,57,163,5,123,57,113,199,15,57,16,201,145,57,176,229,27,57,54,123,46,57,163,135,165,57,96,93,116,57,222,138,93,57,143,87,72,57,223,35,79,57,99,125,59,57,134,251,56,57,121,232,61,57,117,112,102,57,202,96,136,57,45,18,108,57,79,114,104,57,34,198,128,57,109,59,57,57,52,196,71,57,222,157,86,57,209,164,102,57,68,223,77,57,120,26,114,57,139,211,111,57,141,105,58,57,179,33,128,57,67,20,88,57,92,166,81,57,139,207,101,57,251,97,33,57,51,4,60,57,150,173,69,57,31,177,75,57,2,219,101,57,132,171,128,57,222,69,55,57,220,177,94,57,126,188,69,57,223,110,49,57,101,36,90,57,215,97,122,57,254,148,79,57,32,20,102,57,123,146,64,57,245,1,64,57]}},{"name":"scale__197","dataType":1,"dims":[64],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[53,228,205,57,70,15,104,57,44,53,158,57,112,169,120,57,131,42,80,57,234,9,207,57,106,95,32,57,82,104,144,57,231,25,38,57,30,159,171,57,12,150,190,57,136,100,146,57,242,48,107,57,42,54,130,57,158,98,146,57,241,154,146,57,94,113,180,57,212,209,170,57,36,106,145,57,186,94,63,57,142,166,110,57,235,161,147,57,148,118,37,57,118,97,183,57,27,254,36,57,185,38,59,57,231,22,136,57,73,72,140,57,74,204,227,57,144,135,152,57,194,195,54,57,25,166,148,57,62,173,152,57,182,153,71,57,43,178,118,57,126,185,47,57,234,204,175,57,73,59,185,57,194,255,110,57,66,49,18,57,0,123,86,57,1,188,67,57,101,188,96,57,222,178,28,57,106,119,76,57,251,98,134,57,23,29,114,57,172,7,167,57,161,90,112,57,169,28,196,57,147,183,119,57,109,77,245,57,146,204,57,57,77,192,102,57,247,97,177,57,141,121,142,57,129,218,147,57,168,29,145,57,191,136,61,57,236,42,145,57,76,225,160,57,89,199,134,57,125,64,214,57,219,89,150,57]}},{"name":"scale__195","dataType":1,"dims":[64],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[249,42,35,57,140,178,184,56,213,186,43,57,176,70,81,57,135,90,86,57,102,124,18,57,17,64,51,57,242,142,36,57,17,182,19,57,92,45,228,56,6,234,29,57,30,103,42,57,131,236,51,57,93,135,32,57,26,157,14,57,233,230,32,57,44,137,0,57,67,65,237,56,128,92,213,56,189,76,5,57,128,144,11,57,115,3,53,57,117,121,64,57,11,239,223,56,132,104,57,57,112,168,169,56,207,202,5,57,71,244,6,57,8,94,51,57,39,214,65,57,151,218,2,57,225,0,74,57,248,118,10,57,59,6,13,57,78,9,0,57,225,97,233,56,5,52,19,57,187,6,6,57,170,164,38,57,181,117,34,57,8,174,20,57,38,37,26,57,64,60,21,57,80,25,28,57,203,94,85,57,214,63,46,57,117,25,241,56,25,3,55,57,118,238,214,56,9,226,53,57,92,46,21,57,252,59,7,57,123,104,21,57,180,115,42,57,53,13,42,57,128,1,22,57,161,78,245,56,117,71,64,57,218,205,32,57,185,222,76,57,254,147,21,57,207,18,15,57,62,244,212,56,75,152,27,57]}},{"name":"scale__193","dataType":1,"dims":[64],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[200,144,94,57,173,162,180,56,163,162,39,57,64,206,236,56,220,215,14,57,71,124,143,57,171,79,105,57,62,78,63,57,120,99,209,57,212,16,28,57,169,6,179,57,193,178,12,57,133,176,63,57,53,37,26,57,227,199,135,57,12,38,52,57,11,60,61,57,252,244,72,57,102,220,54,57,7,249,160,57,210,34,79,57,59,101,21,57,225,31,239,56,118,42,65,57,89,30,124,57,202,231,29,57,215,128,104,57,45,139,13,57,10,155,148,57,141,197,89,57,133,87,156,57,71,212,24,57,125,204,110,57,54,138,120,57,8,226,161,57,241,177,118,57,251,191,81,57,179,16,54,57,204,97,168,57,231,106,55,57,145,204,84,57,4,146,137,57,4,129,40,57,22,230,75,57,251,209,30,57,86,156,28,57,134,244,209,57,91,0,141,57,64,180,153,57,122,154,22,57,13,110,248,57,23,66,70,57,7,134,50,57,250,215,196,57,145,175,148,57,62,115,215,57,228,42,135,57,182,1,89,57,4,139,89,57,252,177,64,57,189,13,131,57,18,44,96,57,172,213,210,57,228,100,135,57]}},{"name":"scale__191","dataType":1,"dims":[64],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[110,48,197,57,48,170,194,57,32,130,173,57,77,206,202,57,184,79,236,57,58,59,241,57,231,110,191,57,122,214,216,57,86,103,192,57,27,250,213,57,170,4,181,57,59,84,202,57,86,210,205,57,149,160,155,57,152,138,3,58,79,203,173,57,158,15,179,57,79,26,207,57,119,241,237,57,41,2,184,57,204,50,163,57,0,236,233,57,179,98,228,57,173,232,2,58,214,244,175,57,1,36,159,57,47,72,193,57,220,127,122,57,221,135,203,57,157,108,0,58,28,141,156,57,87,211,180,57,1,118,225,57,137,237,184,57,206,66,152,57,199,134,211,57,89,97,31,58,203,151,146,57,71,137,190,57,235,22,202,57,130,193,178,57,101,190,183,57,7,200,150,57,180,224,158,57,243,79,219,57,42,171,172,57,84,12,190,57,66,186,209,57,19,167,149,57,137,62,202,57,143,141,192,57,139,212,207,57,61,167,199,57,179,123,216,57,46,66,196,57,99,101,188,57,20,95,223,57,248,144,223,57,226,97,237,57,180,128,186,57,212,59,173,57,133,222,226,57,233,68,141,57,46,233,226,57]}},{"name":"scale__189","dataType":1,"dims":[64],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[172,27,12,60,240,126,169,59,84,151,23,60,235,182,82,60,249,178,57,60,73,33,106,60,74,197,31,60,2,146,194,59,72,100,34,60,132,120,173,59,54,25,27,60,85,236,54,60,148,116,51,60,152,146,63,60,147,83,247,59,125,36,8,60,218,170,15,60,7,34,108,60,110,44,85,60,155,27,96,60,206,28,127,60,61,145,234,59,165,113,163,60,224,190,17,60,93,195,115,60,145,202,175,59,247,230,22,60,127,104,102,60,45,141,72,60,172,113,92,60,95,158,7,60,222,46,193,59,8,151,30,60,171,228,45,60,163,136,22,60,136,166,43,60,128,87,8,60,71,166,149,59,187,41,79,60,95,84,53,60,171,49,156,60,162,208,74,60,62,84,134,60,101,228,46,60,83,99,3,60,180,109,16,60,25,171,253,59,124,205,179,59,127,71,135,60,185,78,39,60,77,121,40,60,141,141,183,60,12,0,56,60,103,19,246,59,122,213,216,59,164,183,215,59,146,49,72,60,72,119,249,59,82,4,141,60,106,128,85,60,212,144,36,60,218,63,214,59,253,191,64,60,41,248,97,60]}},{"name":"scale__187","dataType":1,"dims":[64],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[32,166,213,59,10,189,211,59,235,25,83,60,193,174,23,60,231,89,216,59,107,70,106,60,63,182,193,59,213,33,184,59,38,110,74,60,46,168,216,59,243,65,243,59,153,196,244,59,81,111,231,59,112,233,223,59,106,241,16,60,146,247,13,60,241,93,254,59,59,105,1,60,84,85,216,59,243,203,176,59,115,113,153,59,190,101,151,60,148,197,232,59,71,180,218,59,61,216,254,59,139,130,25,60,254,221,254,59,236,42,190,59,222,198,230,59,217,238,9,60,245,14,178,59,197,237,214,59,196,147,135,60,161,73,227,59,150,183,213,59,24,14,55,60,162,22,160,59,4,93,177,59,94,227,255,59,197,21,165,59,240,253,14,60,65,192,41,60,167,77,4,60,139,231,136,59,248,111,204,59,157,16,22,60,42,1,49,60,47,35,210,59,194,61,232,59,180,140,192,59,139,18,56,60,93,200,87,60,120,166,6,60,189,55,224,59,132,250,187,59,206,149,234,59,108,214,31,60,204,165,26,60,127,231,32,60,92,11,244,59,66,55,243,59,38,82,240,59,208,233,217,59,15,30,245,59]}},{"name":"scale__185","dataType":1,"dims":[64],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[216,6,44,60,15,228,193,59,154,47,4,60,41,195,207,59,95,237,173,59,62,252,44,60,175,254,133,59,169,79,241,59,247,199,138,59,189,100,15,60,35,61,31,60,231,160,244,59,223,129,196,59,212,150,217,59,179,157,244,59,211,251,244,59,142,195,22,60,55,185,14,60,124,254,242,59,207,228,159,59,209,101,199,59,68,179,246,59,129,63,138,59,242,55,25,60,217,218,137,59,113,94,156,59,78,105,227,59,250,106,234,59,132,84,62,60,41,226,254,59,46,180,152,59,9,102,248,59,32,33,255,59,61,197,166,59,171,30,206,59,89,210,146,59,147,226,18,60,214,195,26,60,89,176,199,59,56,75,116,59,251,51,179,59,81,138,163,59,142,197,187,59,214,236,130,59,13,214,170,59,221,144,224,59,137,74,202,59,161,142,11,60,43,210,200,59,19,219,35,60,20,249,206,59,154,244,76,60,57,61,155,59,46,204,192,59,1,53,20,60,224,20,238,59,211,17,247,59,174,126,242,59,33,92,158,59,216,148,242,59,52,107,6,60,149,56,225,59,24,3,51,60,54,62,251,59]}},{"name":"scale__183","dataType":1,"dims":[64],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[33,243,210,59,62,53,43,59,229,226,158,59,87,114,96,59,92,99,135,59,51,255,7,60,114,34,221,59,63,82,181,59,223,117,70,60,171,235,147,59,187,174,41,60,234,90,133,59,101,175,181,59,180,25,146,59,191,177,0,60,30,191,170,59,184,91,179,59,10,120,190,59,59,81,173,59,78,146,24,60,82,83,196,59,48,153,141,59,252,164,98,59,157,21,183,59,216,245,238,59,12,170,149,59,105,94,220,59,10,40,134,59,141,217,12,60,243,103,206,59,171,46,20,60,92,218,144,59,243,85,226,59,133,145,235,59,38,111,25,60,230,209,233,59,142,205,198,59,42,144,172,59,20,152,31,60,76,216,173,59,103,177,201,59,247,99,2,60,171,181,159,59,214,65,193,59,4,136,150,59,229,111,148,59,91,255,70,60,119,164,5,60,164,174,17,60,76,190,142,59,213,118,107,60,52,233,187,59,208,52,169,59,253,145,58,60,2,237,12,60,168,52,76,60,242,28,0,60,84,174,205,59,120,48,206,59,108,163,182,59,132,109,248,59,244,120,212,59,193,212,71,60,235,83,0,60]}},{"name":"scale__181","dataType":1,"dims":[64],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[77,145,174,58,124,1,66,58,224,99,247,57,202,67,11,58,42,100,235,57,87,63,77,58,71,0,209,58,175,126,49,58,180,26,10,58,247,183,141,57,108,150,121,58,165,36,14,58,183,3,148,58,176,227,31,58,187,28,52,58,45,21,202,57,229,46,207,58,172,195,166,57,51,46,208,57,212,11,13,58,118,200,235,57,28,237,123,58,220,166,222,57,242,240,246,58,24,221,212,57,24,220,62,58,68,132,248,57,128,194,83,58,80,110,132,58,49,177,141,58,76,144,27,58,43,11,123,58,185,186,53,58,222,244,14,58,77,137,74,58,41,219,48,58,246,138,168,58,133,217,233,57,63,88,166,57,129,19,215,57,48,208,200,57,117,160,26,58,194,182,12,58,48,144,4,59,232,140,155,58,248,160,159,58,14,101,46,58,188,220,9,58,28,47,67,58,134,78,204,58,26,70,65,58,88,176,131,58,40,206,132,58,207,94,215,57,29,118,75,58,94,252,235,58,75,67,216,57,77,1,37,58,58,130,82,58,40,114,221,57,39,231,32,58,129,205,0,58,220,120,110,58,108,29,216,57]}},{"name":"scale__179","dataType":1,"dims":[64],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[250,119,23,59,84,18,114,59,153,11,68,59,55,245,23,59,157,142,114,59,32,83,29,59,171,198,2,59,35,103,87,59,198,186,71,59,242,156,127,59,207,139,91,59,196,226,65,59,38,93,136,59,11,132,74,59,75,13,86,59,148,255,55,59,145,160,32,59,15,225,70,59,122,254,114,59,190,114,61,59,171,219,75,59,23,54,68,59,124,2,155,59,65,49,90,59,239,0,54,59,128,49,94,59,176,248,29,59,139,55,42,59,79,13,53,59,236,153,92,59,21,14,115,59,111,232,111,59,66,180,63,59,149,99,48,59,234,182,131,59,197,163,87,59,30,183,88,59,186,93,125,59,88,81,120,59,124,81,59,59,138,15,135,59,177,167,115,59,92,109,73,59,122,162,129,59,50,230,98,59,191,104,78,59,176,99,0,59,76,245,104,59,141,140,22,59,3,167,75,59,145,180,72,59,172,140,56,59,11,149,46,59,216,133,115,59,31,42,118,59,6,205,102,59,169,62,4,59,225,46,63,59,100,161,57,59,72,88,22,59,110,62,95,59,167,192,38,59,254,70,80,59,160,223,84,59]}},{"name":"scale__177","dataType":1,"dims":[64],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[36,44,64,59,86,163,83,59,55,0,68,59,27,0,82,59,184,1,105,59,204,25,154,59,147,128,134,59,39,10,73,59,121,243,97,59,91,55,51,59,13,188,150,59,171,130,55,59,27,161,41,59,34,158,113,59,235,117,192,59,76,218,47,59,184,27,132,59,240,166,23,59,100,251,121,59,241,46,15,59,111,46,145,59,86,64,27,59,38,194,45,59,17,216,164,59,48,90,115,59,227,159,92,59,17,131,71,59,43,72,78,59,135,182,58,59,82,55,56,59,12,31,61,59,11,124,101,59,36,208,135,59,201,23,107,59,196,123,103,59,140,61,128,59,246,118,56,59,82,240,70,59,60,186,85,59,47,176,101,59,232,4,77,59,174,25,113,59,44,213,110,59,213,163,57,59,152,51,127,59,20,47,87,59,254,199,80,59,203,219,100,59,207,182,32,59,200,60,59,59,235,219,68,59,19,217,74,59,54,231,100,59,11,35,128,59,123,131,54,59,168,197,93,59,195,234,68,59,173,178,48,59,6,61,89,59,70,88,121,59,210,184,78,59,24,32,101,59,59,198,63,59,78,54,63,59]}},{"name":"scale__175","dataType":1,"dims":[64],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[94,44,94,59,16,125,251,58,219,212,105,59,76,122,142,59,62,239,145,59,116,117,71,59,78,18,116,59,17,17,96,59,141,32,73,59,134,88,27,59,14,5,87,59,75,6,104,59,27,253,116,59,113,148,90,59,173,47,66,59,138,22,91,59,123,4,47,59,170,134,33,59,76,66,17,59,18,129,53,59,203,8,62,59,234,120,118,59,247,9,131,59,242,116,24,59,213,116,124,59,169,2,231,58,187,44,54,59,198,193,55,59,27,59,116,59,93,247,131,59,126,44,50,59,193,134,137,59,116,137,60,59,172,5,64,59,95,86,46,59,184,227,30,59,121,111,72,59,82,126,54,59,203,231,98,59,142,53,93,59,47,114,74,59,65,227,81,59,213,51,75,59,75,140,84,59,220,67,145,59,28,67,109,59,183,36,36,59,151,49,121,59,245,83,18,59,255,167,119,59,235,32,75,59,105,35,56,59,15,112,75,59,110,23,104,59,223,139,103,59,106,64,76,59,17,2,39,59,237,231,130,59,108,244,90,59,93,122,139,59,78,171,75,59,243,207,66,59,81,251,16,59,158,220,83,59]}},{"name":"scale__173","dataType":1,"dims":[64],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[220,139,3,60,191,220,1,60,78,127,231,59,19,75,7,60,34,165,29,60,92,237,32,60,184,105,255,59,113,167,16,60,151,90,0,60,223,190,14,60,99,132,241,59,164,249,6,60,27,78,9,60,225,163,207,59,33,129,47,60,243,224,231,59,225,231,238,59,230,40,10,60,208,187,30,60,185,129,245,59,224,189,217,59,13,13,28,60,143,91,24,60,25,169,46,60,121,195,234,59,231,83,212,59,151,240,0,60,41,28,167,59,221,198,7,60,116,88,43,60,118,223,208,59,147,66,241,59,25,104,22,60,195,187,246,59,22,38,203,59,96,28,13,60,191,165,84,60,32,150,195,59,89,55,254,59,189,208,6,60,171,127,238,59,78,39,245,59,183,44,201,59,28,250,211,59,9,78,18,60,128,96,230,59,164,144,253,59,41,233,11,60,48,171,199,59,43,235,6,60,23,116,0,60,35,165,10,60,173,48,5,60,226,106,16,60,236,236,2,60,88,92,251,59,63,3,21,60,135,36,21,60,7,92,30,60,172,213,248,59,132,33,231,59,154,88,23,60,191,123,188,59,182,95,23,60]}},{"name":"scale__171","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[149,97,48,58]}},{"name":"scale__169","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[104,100,9,60]}},{"name":"scale__167","dataType":1,"dims":[],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[23,175,21,63]}},{"name":"new_shape__318","dataType":7,"dims":[4],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[255,255,255,255,255,255,255,255,1,0,0,0,0,0,0,0,49,0,0,0,0,0,0,0,10,0,0,0,0,0,0,0]}},{"name":"functional_1/dense/MatMul","dataType":3,"dims":[64,12],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[176,12,54,231,12,162,60,203,225,224,42,244,218,65,221,31,224,16,215,50,241,172,213,212,217,226,25,210,194,233,56,233,255,174,79,40,43,218,204,201,237,79,234,197,221,249,175,55,6,36,14,52,67,191,215,78,167,13,192,5,5,238,224,218,67,52,179,245,40,228,180,10,241,16,35,196,59,45,55,211,0,227,164,9,35,214,190,19,224,45,229,72,174,174,187,31,250,63,209,12,22,228,254,209,214,199,56,51,40,199,246,246,202,180,247,87,195,59,39,218,185,30,242,212,175,8,73,161,231,228,254,25,66,243,199,204,188,66,212,41,167,225,177,47,226,26,56,55,252,218,206,225,205,74,182,221,215,205,33,4,32,43,30,246,61,212,220,228,37,29,183,209,10,5,73,227,177,210,40,250,37,240,193,235,212,232,242,247,246,214,166,61,187,188,76,188,24,202,240,211,184,29,195,40,220,189,57,53,189,180,60,7,201,245,187,5,186,209,51,234,20,209,26,85,56,244,227,205,19,32,181,2,36,70,36,139,224,184,1,241,23,48,24,45,187,179,227,200,168,74,52,15,245,190,61,210,65,168,236,235,49,42,204,211,176,3,60,216,44,62,206,199,24,32,19,3,218,231,10,58,68,63,193,176,217,51,212,6,207,174,62,189,60,241,43,219,243,236,44,44,21,242,238,191,9,70,244,156,224,204,198,61,170,184,195,202,182,203,52,201,253,3,4,69,16,237,217,200,209,39,231,231,225,14,230,69,240,225,9,22,159,227,65,202,208,37,66,2,52,221,186,207,65,19,202,57,46,241,1,10,87,26,9,224,218,231,232,24,212,231,166,233,231,176,223,203,179,45,3,191,254,214,35,72,10,173,42,217,182,2,51,18,206,209,194,34,233,59,44,51,21,193,43,216,198,251,171,252,35,211,206,48,248,238,227,192,226,204,152,61,247,32,247,204,220,189,207,71,45,162,186,24,249,213,13,61,209,194,220,192,197,70,142,251,36,13,246,39,186,33,68,197,206,172,231,237,228,20,199,223,9,19,195,79,223,81,186,201,175,56,29,247,212,185,61,57,36,243,225,216,210,215,26,218,215,181,222,65,49,8,195,38,215,54,171,191,221,42,198,56,225,217,221,53,7,236,214,169,202,230,252,220,245,61,66,58,164,186,200,206,5,60,30,43,191,248,206,41,246,46,195,70,186,198,189,219,254,187,242,243,84,251,245,226,11,28,181,34,250,225,14,213,43,43,188,57,248,231,197,214,52,147,203,238,189,210,237,237,220,21,245,22,67,200,217,24,167,10,177,244,225,207,228,252,52,3,207,39,227,221,69,253,181,178,62,245,24,196,211,229,47,192,227,16,178,177,24,171,200,76,191,21,212,219,212,220,40,36,234,228,60,177,240,213,80,216,200,225,242,69,171,242,8,205,60,252,182,235,8,222,46,32,198,251,56,29,233,235,184,203,29,210,37,175,193,209,251,67,65,20,215,239,252,244,27,185,26,58,179,248,231,70,180,220,197,228,66,40,232,35,46,54,65,219,23,56,173,54,229,193,196,222,244,189,183,8,44,69,189,226,195,253,205,242,3,207,200,20,226,218,35,42,216,220,228,230,255,42,142,64,60,29,206,203,214,26,1,41,33,188,220,220,236,177,68,246,0,165,202,23,9,30,50,218,223,26,197,228,10,228,27,196,17,235,164,60,32,25,239,61,175,217,198,159,229,64,129,2]}},{"name":"functional_1/dense/BiasAdd/ReadVariableOp/resource","dataType":6,"dims":[12],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[178,255,255,255,240,255,255,255,190,255,255,255,168,255,255,255,248,255,255,255,164,255,255,255,54,255,255,255,32,0,0,0,193,255,255,255,105,255,255,255,213,255,255,255,171,0,0,0]}},{"name":"functional_1/conv2d_4/Conv2D","dataType":3,"dims":[64,64,1,1],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[80,229,255,36,169,235,101,57,219,94,36,255,238,20,240,10,215,5,26,218,255,82,235,250,2,242,215,219,32,14,82,13,36,187,183,242,214,234,1,15,238,26,8,238,71,8,195,64,2,17,10,46,18,11,127,234,229,212,230,50,159,9,210,218,2,231,184,225,246,61,223,24,20,233,127,7,26,255,16,34,153,237,224,32,254,19,48,203,212,10,203,68,55,39,219,166,1,248,202,221,197,228,229,16,225,58,216,51,11,214,220,13,249,100,239,245,43,59,229,238,61,40,27,228,242,20,43,250,52,189,83,112,19,225,111,59,24,35,192,204,53,91,240,177,251,103,48,223,24,90,194,210,50,237,135,169,5,223,121,127,239,4,251,16,196,253,90,200,50,13,79,186,169,226,21,107,239,11,241,72,4,250,15,194,44,212,129,29,227,224,209,54,168,243,85,251,92,43,223,34,105,237,221,13,198,186,245,252,184,218,231,23,246,1,230,205,242,214,36,58,188,5,234,245,32,225,11,12,24,243,11,21,51,234,12,197,238,228,127,1,240,253,239,246,40,27,216,252,217,13,73,238,2,37,247,41,82,246,230,203,6,245,7,239,221,251,1,29,129,252,1,233,223,47,180,22,70,56,54,23,9,240,15,40,14,24,212,22,237,226,251,219,172,191,202,5,130,20,170,72,234,1,207,233,255,59,56,226,197,224,94,16,186,38,206,155,69,225,9,40,181,253,42,240,227,55,212,67,11,209,250,52,5,179,79,225,200,157,240,19,227,199,11,248,229,0,253,249,221,241,226,242,11,18,5,220,230,15,239,248,29,243,237,17,203,246,50,234,127,238,71,187,224,15,12,58,199,20,35,28,94,28,7,247,213,254,183,18,165,28,113,23,44,7,236,18,188,201,85,217,207,215,251,210,20,208,207,165,241,209,83,2,207,196,48,224,81,0,255,19,218,6,241,79,243,0,69,27,54,54,42,117,127,29,12,248,28,252,121,11,139,185,41,108,228,74,203,187,22,218,195,248,127,33,243,238,8,155,204,66,190,84,6,236,197,244,218,34,4,27,61,202,255,23,53,51,232,5,253,8,236,36,61,1,181,228,228,228,12,36,48,233,213,50,31,245,201,74,225,191,8,248,212,231,13,120,10,137,59,225,18,59,127,192,96,250,214,208,254,46,237,113,74,24,216,10,2,42,255,247,212,14,33,46,21,213,34,247,246,56,7,67,36,242,49,243,207,239,239,147,32,219,167,62,3,146,198,43,199,23,34,197,28,23,74,13,241,198,228,252,219,198,174,30,153,49,247,236,163,22,120,232,41,129,237,237,214,233,151,35,230,10,193,42,36,238,50,45,65,74,224,222,93,174,13,237,236,29,154,228,39,233,18,35,50,2,9,6,165,11,209,200,248,224,194,73,223,192,171,209,239,22,17,4,239,173,86,241,13,28,40,156,242,54,228,226,127,101,39,222,78,46,18,10,220,163,4,36,234,235,233,53,228,216,57,214,227,243,31,234,68,4,106,9,235,35,75,5,16,10,253,45,61,13,37,33,48,53,248,42,5,81,70,252,209,202,11,1,226,54,165,5,192,4,211,234,252,87,85,26,217,255,30,178,224,44,172,235,226,14,212,255,236,55,230,58,245,225,250,223,82,249,221,49,202,237,207,1,24,17,210,40,1,247,255,9,33,236,196,48,99,35,173,127,219,182,245,240,229,233,231,41,74,145,33,12,200,32,206,248,254,222,242,34,197,210,8,67,73,226,182,152,233,42,24,46,253,224,237,6,31,64,193,196,238,229,250,13,4,233,16,4,190,245,39,224,236,68,242,32,179,28,42,247,218,232,1,249,5,50,36,12,72,40,208,228,39,148,248,44,127,211,142,16,233,1,14,45,252,5,18,208,253,248,19,51,83,178,129,229,49,246,237,23,246,205,188,218,252,188,213,205,102,186,10,32,24,232,193,23,207,12,98,16,10,46,56,9,252,34,85,226,8,225,44,62,57,243,106,32,85,108,6,239,41,200,95,174,216,56,24,222,127,233,7,18,49,255,227,229,20,40,179,249,17,19,17,26,236,189,16,227,73,229,39,33,15,23,244,234,241,245,7,74,59,240,205,247,14,254,216,14,244,12,4,55,252,248,218,8,208,223,224,248,6,63,9,37,147,210,10,43,127,24,229,226,7,228,20,242,237,238,23,2,225,77,4,213,18,15,246,236,15,247,63,233,35,231,191,10,17,20,203,214,18,210,250,200,186,232,186,24,47,187,5,48,78,241,228,202,209,254,209,204,220,231,234,67,163,199,35,252,189,94,38,218,96,15,221,253,184,101,223,39,156,255,242,232,7,129,26,47,200,219,17,66,210,249,76,185,204,213,233,195,74,10,41,186,26,100,65,179,232,65,231,18,249,10,25,232,65,61,242,65,14,55,210,184,127,0,146,205,195,193,221,27,223,24,241,9,248,29,249,234,81,219,254,232,204,30,210,49,240,19,38,45,13,226,239,19,63,5,5,7,34,225,211,204,127,231,49,231,47,252,213,247,145,55,53,95,253,1,21,241,221,238,186,230,220,81,233,240,7,225,35,92,153,190,242,253,86,18,222,43,198,250,1,17,20,236,243,234,20,238,242,86,249,221,129,246,35,238,25,32,39,249,231,21,243,193,11,219,20,219,216,9,25,243,225,10,217,3,0,246,201,48,78,176,245,234,249,13,245,197,213,236,91,244,52,28,248,48,22,232,15,20,48,129,217,230,10,47,35,56,62,5,57,16,176,164,106,1,150,17,194,13,28,217,233,187,187,181,55,69,242,61,38,168,42,237,214,207,217,112,6,242,3,16,27,225,33,20,22,0,118,4,20,207,89,89,203,245,204,222,125,109,213,72,228,167,127,205,69,22,253,182,153,233,5,99,53,174,187,178,210,23,200,105,247,244,19,80,212,27,240,168,49,238,39,86,24,1,240,211,213,19,107,254,59,31,213,60,31,203,243,27,181,7,201,52,214,98,248,248,224,26,227,3,218,152,239,60,53,195,236,20,10,255,229,242,243,203,243,26,234,205,8,14,21,218,236,16,57,237,238,251,250,72,4,253,9,137,243,240,239,21,200,216,2,233,45,38,239,20,33,225,166,40,51,251,5,218,55,202,18,212,212,218,127,29,239,217,45,250,41,246,240,232,184,55,28,18,148,61,129,76,84,19,3,17,221,6,71,213,160,10,232,19,205,36,191,11,220,192,206,49,227,209,25,247,234,53,230,2,32,234,53,56,5,3,59,237,243,250,55,97,107,25,227,51,58,76,107,217,182,210,85,221,17,63,41,210,194,252,254,171,0,66,205,33,46,5,233,24,155,204,57,5,228,241,198,254,242,247,7,33,240,210,16,24,198,207,252,206,50,13,248,250,223,203,3,34,9,27,24,214,244,33,5,224,88,233,67,45,38,24,31,237,179,6,26,211,20,17,127,250,16,231,100,4,209,254,89,82,1,31,173,36,255,32,8,166,18,59,225,218,63,108,7,248,85,229,196,172,214,179,118,38,10,166,13,12,224,181,237,54,14,248,55,174,250,33,42,79,38,191,56,86,250,217,127,188,206,194,222,245,223,32,204,59,235,222,127,43,3,20,249,52,63,243,214,79,228,237,22,217,246,226,236,10,18,12,237,186,242,201,251,11,184,242,215,13,92,218,17,20,26,242,253,13,7,249,58,190,0,235,123,49,25,35,6,8,58,2,245,238,200,42,41,200,221,36,222,24,233,216,47,246,253,231,127,96,15,4,220,33,16,26,250,191,23,249,246,253,21,8,230,209,85,225,1,213,7,193,1,244,94,231,25,34,54,218,12,40,53,245,30,198,11,234,50,255,238,208,14,10,247,217,241,185,16,251,193,16,208,0,17,101,209,254,127,252,79,4,255,38,100,245,223,44,208,19,239,186,229,189,250,12,246,15,250,208,254,178,24,1,210,245,182,34,107,238,43,121,40,241,3,116,23,4,52,174,44,218,115,28,157,7,230,74,33,203,7,234,188,234,208,232,176,5,228,98,236,247,206,36,44,23,127,8,13,65,227,223,215,11,250,237,36,102,34,193,19,38,242,232,12,246,17,204,246,217,60,46,51,212,245,254,46,7,120,219,255,34,42,211,207,253,240,245,240,16,228,64,24,244,196,208,64,254,172,233,208,254,75,232,238,1,26,240,33,246,250,221,224,211,226,241,230,54,27,235,219,160,255,56,33,21,33,252,32,222,50,178,248,249,223,42,189,251,55,232,215,34,5,191,20,202,193,33,194,251,26,239,69,215,63,129,188,234,12,50,238,18,38,2,103,8,204,50,0,216,247,99,236,189,241,183,211,235,223,232,169,241,180,114,199,198,16,59,243,59,247,40,221,239,98,201,23,99,29,65,140,167,233,232,227,107,247,249,242,5,173,60,236,127,19,14,167,91,179,200,161,249,21,48,240,187,83,155,20,48,138,190,210,234,94,27,19,9,40,64,85,245,220,252,236,17,241,210,11,2,6,6,7,47,185,202,32,200,240,238,217,196,223,8,64,238,34,43,3,204,14,34,77,243,62,186,254,219,127,15,222,17,243,23,26,249,253,207,9,16,242,223,191,255,22,93,209,24,35,53,224,217,50,5,20,7,193,33,202,35,254,3,243,7,1,233,3,18,242,225,28,234,19,10,236,232,127,252,2,222,12,3,203,32,197,34,30,27,16,239,226,36,58,36,172,18,196,48,212,216,42,237,244,64,226,209,236,3,228,30,86,214,14,4,163,244,49,43,246,90,127,244,215,150,206,77,227,18,211,226,255,42,2,242,206,221,227,53,29,43,94,251,77,193,157,224,218,235,179,66,189,72,226,22,46,16,169,244,244,2,28,61,23,35,91,2,188,241,248,234,196,10,43,194,25,38,62,209,254,211,11,201,8,237,182,58,15,26,23,51,245,163,218,12,25,205,204,245,94,232,48,50,166,214,0,66,39,191,94,230,156,199,206,252,17,71,6,148,31,111,85,172,10,154,36,8,239,192,6,165,238,127,143,178,245,242,106,92,11,10,75,37,216,213,189,21,213,129,51,50,80,32,183,234,233,194,27,90,239,19,246,238,19,188,34,252,96,45,217,11,201,74,2,30,202,224,216,218,228,3,238,107,180,230,32,18,148,73,236,190,177,231,64,189,37,80,180,164,238,2,168,56,214,58,31,241,21,3,228,249,15,16,227,232,192,222,242,11,44,12,255,220,6,0,247,32,2,200,34,248,221,231,11,249,13,245,249,255,25,216,244,47,23,33,238,244,250,248,241,201,225,213,8,39,241,242,234,4,9,16,238,177,25,3,127,1,61,179,185,42,84,22,71,12,33,229,250,254,200,235,249,79,174,8,224,243,209,24,28,220,215,242,79,24,187,32,127,224,55,247,228,224,167,121,180,245,25,101,5,246,221,52,1,231,237,241,212,12,44,51,182,12,24,24,43,240,164,3,24,161,190,253,160,213,3,36,0,217,15,0,117,214,206,246,10,225,217,19,12,232,79,41,89,39,202,10,46,212,51,242,175,193,212,45,214,231,127,22,47,47,196,234,157,103,21,156,225,241,56,53,4,202,234,24,235,46,194,255,24,151,36,13,23,3,1,5,183,18,2,252,56,234,236,255,127,2,56,21,220,238,170,44,31,8,27,33,30,202,209,241,242,205,86,25,14,214,14,244,220,242,18,14,218,10,214,22,200,72,58,178,212,243,201,50,234,245,250,0,38,246,86,43,247,19,207,244,244,230,210,255,60,255,23,226,200,27,252,208,238,39,241,39,221,150,177,170,33,255,10,232,247,189,127,203,202,61,29,191,250,242,185,42,52,64,49,223,221,50,105,247,25,53,243,207,50,239,149,65,0,204,164,200,59,212,67,77,200,224,55,214,225,111,223,24,37,15,234,37,243,23,25,177,98,64,244,33,234,219,233,245,18,39,35,90,245,238,1,196,34,24,47,59,129,222,0,39,252,21,30,224,0,250,248,248,239,228,247,193,12,39,188,78,3,210,56,2,245,194,173,17,253,166,191,24,227,69,238,211,121,41,239,224,51,77,6,47,226,208,37,250,251,250,242,255,40,233,248,61,184,221,69,230,30,168,18,224,182,250,69,229,1,127,122,5,107,255,245,231,241,220,209,240,55,40,227,39,246,3,200,192,239,215,211,240,171,241,236,70,230,90,149,0,195,23,235,48,86,89,46,236,246,127,169,29,28,134,212,217,198,13,60,23,2,190,253,220,94,25,243,171,205,198,100,89,47,29,1,228,23,69,11,229,240,223,2,239,83,48,246,44,20,7,36,227,204,184,195,47,227,183,219,212,14,118,86,220,42,232,10,240,212,36,1,253,37,225,27,234,232,60,210,26,167,6,213,253,222,239,7,246,193,37,31,78,252,1,238,229,221,220,172,214,186,216,237,88,5,32,207,5,229,245,240,243,241,225,39,20,233,252,88,38,248,221,238,6,127,2,10,201,242,23,225,242,181,207,252,207,174,219,243,39,13,24,181,229,241,43,253,32,48,10,225,219,74,201,237,49,37,40,138,21,211,208,192,119,249,252,19,2,165,12,221,47,23,22,52,60,223,192,160,55,22,50,254,179,127,198,62,63,223,187,51,16,74,229,2,217,185,20,254,216,30,206,77,216,252,40,175,223,234,38,201,5,238,253,241,238,217,34,9,72,2,34,246,232,231,197,129,54,197,177,244,53,227,23,208,61,253,230,37,197,4,177,232,35,2,30,103,3,49,20,0,37,84,226,179,29,67,5,12,16,0,77,10,129,245,225,80,82,223,158,15,221,23,69,234,32,210,198,10,210,216,239,18,210,236,211,44,97,36,11,218,244,236,211,91,217,33,28,241,194,110,22,223,202,31,160,239,66,24,205,106,88,218,45,251,10,57,76,2,40,119,230,78,254,19,78,233,211,100,239,58,209,195,215,202,206,242,12,6,227,191,203,78,141,252,226,76,15,129,38,62,46,24,21,62,171,216,164,66,232,67,228,232,201,7,4,221,175,89,213,8,25,20,174,94,70,189,57,177,186,20,127,247,247,9,58,255,9,41,225,235,13,245,228,4,64,228,1,203,22,68,228,219,42,238,229,218,240,251,205,232,247,127,4,252,227,245,244,237,246,186,2,56,38,237,28,30,231,254,19,210,26,216,1,245,236,50,242,87,22,250,45,241,241,244,224,57,8,60,46,93,214,72,242,24,44,131,234,178,195,252,6,3,5,38,208,3,8,245,22,0,169,118,237,198,218,2,37,7,216,31,4,127,1,3,255,12,19,4,232,221,42,249,230,221,195,236,17,204,214,189,222,17,17,192,205,66,11,40,255,207,3,242,189,9,60,248,65,13,224,15,229,20,34,97,190,147,189,251,36,218,12,6,195,221,204,235,192,241,246,15,221,242,53,250,230,209,29,252,228,69,236,61,64,33,230,30,241,127,195,42,172,252,79,0,255,26,2,68,121,15,245,39,255,2,185,11,77,92,22,153,2,7,234,146,221,29,209,27,64,145,5,241,54,245,237,236,3,5,246,65,186,186,55,19,59,135,41,35,233,158,115,110,198,71,16,19,1,129,31,121,46,34,63,212,165,223,54,203,24,44,231,108,221,62,51,243,214,184,254,239,223,208,59,187,250,20,222,7,216,246,246,68,194,171,248,3,6,251,230,252,12,224,198,205,225,254,205,225,219,1,42,0,244,56,11,26,10,51,238,30,58,37,217,11,11,127,3,33,221,29,36,77,2,39,245,48,17,35,20,39,235,251,25,66,250,242,242,234,51,226,82,227,183,23,32,17,162,14,30,213,233,24,38,212,15,18,206,199,169,25,215,220,46,219,173,255,31,63,224,49,0,244,223,238,205,220,217,21,4,36,252,80,71,236,186,127,251,198,220,244,206,233,14,18,69,54,225,40,1,38,234,38,70,217,207,228,89,174,35,21,213,4,247,196,5,24,25,61,8,63,242,35,200,31,201,25,255,34,20,37,49,7,159,237,41,183,250,48,221,18,225,30,241,229,11,94,31,193,197,6,205,191,50,190,177,46,226,201,127,196,1,182,193,11,72,252,254,7,23,37,223,24,49,73,198,159,4,240,43,53,29,43,17,13,230,16,162,25,201,198,229,217,27,19,227,42,248,127,215,251,206,228,251,240,178,246,239,104,227,60,209,5,46,247,251,15,242,12,62,45,250,54,28,127,40,77,213,4,220,206,8,9,228,48,234,22,218,225,44,211,31,157,26,239,12,227,231,14,234,211,80,26,80,234,16,246,184,221,217,186,238,185,207,160,78,11,12,212,41,224,247,244,233,21,214,249,253,4,3,7,35,35,204,231,30,65,229,53,212,113,19,4,205,188,192,27,227,99,31,60,192,207,15,8,51,250,36,229,42,196,240,3,215,35,233,31,127,221,222,240,248,222,242,7,92,217,218,183,68,201,239,218,10,40,37,231,55,218,223,236,238,13,237,237,28,26,2,201,76,166,215,17,32,86,251,4,6,186,41,21,214,197,11,220,205,234,210,80,35,219,227,12,220,191,236,15,219,225,240,234,202,37,6,41,242,11,239,9,173,179,47,255,42,62,177,224,37,39,220,227,1,0,82,205,194,27,206,4,45,176,11,29,244,127,90,224,244,236,87,6,229,0,194,26,189,60,230,76,237,214,60,145,232,41,106,239,68,30,223,229,193,62,180,39,71,20,250,169,239,229,197,217,127,8,243,2,21,222,55,224,24,28,22,244,52,219,153,238,80,222,24,78,17,88,28,3,35,174,202,226,241,5,9,14,233,199,198,245,11,227,204,236,62,249,232,177,48,44,213,9,39,7,62,226,241,4,162,1,224,18,33,184,11,8,229,239,17,17,24,33,5,168,2,11,217,250,0,248,39,247,220,209,231,127,11,25,250,226,207,66,3,1,12,81,243,105,245,190,187,86,115,237,5,15,73,20,176,23,237,225,230,8,254,19,36,194,246,15,191,230,63,53,195,192,235,49,236,231,119,54,204,208,172,41,21,50,255,43,42,31,247,16,6,56,24,245,223,232,215,238,32,129,35,195,52,171,96,17,235,49,252,8,222,195,201,37,37,9,197,209,144,230,49,0,29,213,241,255,228,217,16,202,207,2,18,229,68,247,215,4,227,217,219,42,19,247,249,252,69,217,231,3,44,241,224,220,244,237,232,9,7,218,22,6,47,25,170,5,47,127,204]}},{"name":"functional_1/conv2d_3/Conv2D","dataType":3,"dims":[64,64,1,1],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[],"rawData":{"type":"Buffer","data":[6,25,14,49,227,38,163,15,218,178,115,242,50,129,253,182,15,2,252,251,23,19,10,180,245,9,227,243,76,42,247,192,213,160,208,207,79,11,64,24,12,32,215,4,220,81,245,21,237,52,244,183,78,185,239,217,4,197,249,225,12,159,7,40,81,18,160,151,249,239,26,218,22,26,17,25,33,82,43,71,212,15,234,12,129,75,58,248,236,22,10,212,220,217,46,30,239,39,97,56,35,102,17,15,229,209,176,213,237,205,36,60,75,71,18,127,122,44,197,187,11,242,87,231,47,38,202,47,248,209,215,216,62,249,155,245,189,245,251,225,212,243,97,59,4,66,239,66,230,66,195,204,42,34,127,84,83,35,101,33,64,149,44,212,59,254,41,191,13,22,212,194,203,45,231,6,199,64,24,242,0,61,29,252,185,8,173,52,235,219,189,238,88,230,236,3,61,79,216,239,240,203,43,235,31,244,255,152,221,194,219,91,15,189,90,10,25,19,215,6,196,67,205,187,225,254,208,34,29,127,53,23,8,212,247,4,210,24,68,159,248,15,25,234,195,197,20,231,197,211,52,254,28,6,217,2,48,45,127,244,192,190,34,31,203,14,236,12,234,31,226,163,217,90,7,25,216,23,40,205,254,0,207,211,247,43,234,53,214,59,31,18,39,31,13,233,246,211,164,254,60,220,10,230,14,240,61,21,190,226,219,182,23,196,194,252,166,53,53,43,183,228,67,29,234,50,153,13,252,25,236,59,230,34,178,217,224,221,40,9,186,222,194,34,226,223,28,61,129,233,30,233,1,4,217,188,238,65,227,50,197,22,171,58,41,229,242,18,240,35,111,66,38,189,46,22,222,204,41,46,165,101,204,65,51,30,76,213,231,8,12,2,48,165,242,236,183,250,42,227,248,48,169,237,127,43,37,175,250,81,28,26,20,231,216,30,207,172,0,226,236,252,191,239,228,44,170,195,27,215,69,247,30,45,165,6,43,18,56,231,246,197,176,245,197,28,172,82,235,22,172,11,210,47,60,183,250,73,238,205,46,193,247,61,46,91,50,199,226,210,129,48,40,226,4,228,244,239,8,253,29,97,180,203,195,69,229,217,57,241,19,229,165,222,228,29,65,244,220,2,44,207,249,16,38,195,181,79,254,26,41,190,7,181,17,246,205,1,249,187,221,55,251,190,209,33,252,214,31,207,233,8,10,49,208,12,237,191,41,221,244,254,228,13,224,59,246,242,237,4,210,241,209,236,229,228,17,251,224,195,193,45,41,225,34,240,233,18,127,66,28,1,9,65,213,73,164,219,227,68,201,28,160,194,79,20,104,192,183,6,5,189,2,20,139,219,216,29,85,14,191,208,195,236,242,83,38,38,12,48,175,56,9,211,244,204,63,177,205,60,194,237,62,6,249,4,55,254,103,158,219,70,149,233,177,205,205,249,28,127,242,5,1,108,239,85,210,91,229,252,2,120,225,194,127,254,181,157,203,46,34,27,58,162,167,194,199,222,241,43,67,227,203,168,253,169,192,36,57,209,34,58,15,201,5,63,15,246,194,227,188,14,46,230,157,18,157,7,234,203,188,189,12,182,232,74,221,242,42,244,252,5,249,37,35,53,72,14,25,217,52,57,127,19,191,25,157,202,18,249,22,220,125,19,245,221,194,4,28,246,44,22,18,210,69,11,255,189,44,203,24,243,47,177,131,31,7,9,211,255,17,248,108,20,234,181,232,254,255,47,87,1,240,32,211,182,88,32,33,196,243,249,243,234,218,10,225,200,16,13,38,185,230,12,18,187,253,190,206,213,228,9,238,37,34,55,21,233,62,23,211,220,56,28,192,20,185,37,55,194,6,127,72,57,53,5,219,226,43,28,222,24,190,74,18,253,218,81,179,127,213,176,70,57,97,190,218,199,104,7,218,49,174,0,224,240,17,212,213,203,237,215,234,53,201,107,12,166,1,255,12,39,239,8,237,219,56,10,12,26,112,152,24,213,7,205,55,230,93,56,172,12,1,165,57,19,45,52,68,234,248,79,253,111,196,249,12,39,63,245,8,129,244,66,24,204,90,219,102,11,4,47,215,108,200,196,48,93,205,9,216,164,240,234,200,0,13,71,166,57,179,227,180,196,39,6,252,42,192,2,252,32,0,213,224,59,35,20,219,219,42,204,240,225,9,254,53,252,11,249,178,235,249,57,64,50,218,19,235,46,240,216,10,203,180,212,46,200,107,31,240,240,241,74,109,186,81,211,243,202,8,195,173,77,188,28,182,63,79,250,119,148,129,70,165,83,177,205,188,55,184,36,15,233,230,196,179,30,234,196,194,255,43,25,38,243,246,206,35,1,201,232,236,63,230,83,35,204,172,246,250,66,248,26,19,101,218,156,226,233,242,44,210,173,204,182,127,208,14,7,54,11,11,46,105,242,83,29,218,43,224,140,255,92,21,104,188,80,42,232,152,244,244,167,166,39,218,92,1,46,165,192,63,58,10,239,186,86,145,64,8,14,200,227,178,181,6,96,166,226,174,93,62,166,43,240,215,234,36,9,190,137,160,96,163,206,12,34,57,79,226,25,75,191,4,251,129,0,2,253,28,55,6,28,236,200,48,235,251,19,205,230,226,219,236,239,22,245,35,150,220,197,102,255,27,216,251,189,183,146,185,196,127,224,14,66,52,220,116,6,245,149,181,200,72,154,255,187,233,58,249,39,100,179,221,252,7,229,224,125,45,48,236,255,9,58,209,149,221,141,248,212,247,255,1,77,194,226,203,46,19,58,113,184,137,11,17,177,228,19,255,44,241,78,255,170,16,145,210,244,1,201,221,56,1,84,255,15,233,129,120,34,223,233,187,54,12,69,39,66,193,206,6,2,96,0,225,1,71,101,29,234,212,5,13,212,53,34,205,61,58,60,187,54,24,221,255,22,101,205,7,205,246,75,243,239,176,162,220,42,35,230,13,248,4,248,202,222,199,5,50,245,12,224,198,192,49,237,27,214,253,238,32,208,129,229,236,57,3,225,254,3,231,81,245,91,190,38,76,198,224,217,209,7,60,55,187,48,223,15,229,209,215,241,129,1,225,247,237,24,215,18,201,72,221,72,189,248,229,30,205,26,228,36,240,8,27,43,199,31,226,221,28,37,62,239,159,223,34,49,229,11,227,233,51,67,8,88,64,227,248,6,18,10,43,223,214,34,233,25,80,68,252,6,129,5,159,19,234,235,60,238,189,7,238,12,26,197,185,192,42,21,254,234,233,105,11,211,9,29,0,170,205,69,212,3,31,36,43,4,42,249,20,1,218,192,244,24,42,33,195,223,132,218,205,11,38,247,219,6,45,51,17,168,181,42,21,6,251,246,220,0,41,120,20,79,242,79,213,4,253,57,3,47,244,32,66,253,1,40,25,15,79,3,192,71,99,29,246,27,93,1,119,252,127,215,250,230,53,29,220,29,16,45,222,51,7,222,241,199,255,59,212,239,219,240,51,17,254,170,207,251,240,40,240,52,228,206,6,38,213,9,14,18,199,208,58,10,23,247,234,29,232,42,44,69,127,247,78,174,247,239,61,55,254,166,169,42,68,228,66,172,241,223,23,7,219,54,94,60,204,233,51,175,26,6,161,86,250,115,7,170,125,127,22,254,34,214,232,67,13,1,72,223,244,71,254,251,30,53,253,96,104,174,40,5,215,7,99,5,10,81,190,231,35,11,120,64,231,69,67,46,108,32,62,44,39,224,159,2,251,16,206,102,212,198,96,222,198,231,50,35,65,130,46,59,228,19,234,12,70,31,23,218,194,48,24,156,61,158,219,235,218,212,245,88,153,200,182,121,23,135,186,42,129,173,39,44,11,141,226,218,17,17,195,52,239,173,254,189,181,41,29,2,234,204,201,30,85,45,210,146,235,38,201,165,54,232,164,205,229,119,185,187,205,123,48,11,16,61,179,57,129,199,118,50,28,93,186,13,212,196,24,39,40,152,200,21,214,33,210,5,58,208,228,237,147,55,47,87,182,119,210,71,46,147,254,246,216,251,20,51,1,203,209,9,229,240,249,254,255,213,207,203,251,40,38,246,212,230,225,69,36,204,20,16,193,222,39,26,0,127,42,76,206,237,254,191,5,81,198,47,19,251,134,8,254,34,1,49,61,60,172,33,237,228,184,177,160,254,224,4,2,43,218,11,233,204,48,195,4,221,196,58,31,58,153,217,249,219,51,53,29,246,213,250,0,193,67,243,228,24,235,95,18,129,218,209,37,24,130,206,11,249,250,228,52,83,243,220,230,66,192,234,5,90,225,250,121,27,244,33,74,22,30,243,18,12,52,243,15,251,246,214,24,203,74,35,127,226,228,71,197,16,182,42,14,122,250,200,210,253,100,234,203,61,29,180,205,7,188,208,240,189,231,152,38,197,111,15,213,205,214,179,98,140,67,161,50,161,189,88,206,67,60,244,12,205,161,248,234,59,14,7,255,25,20,243,236,55,250,206,3,174,36,2,79,21,46,246,211,221,226,14,250,201,18,253,247,23,243,29,8,71,10,1,20,19,208,23,247,79,26,218,6,230,127,232,252,240,35,240,245,199,49,250,255,108,36,17,2,218,255,44,238,7,5,47,67,172,24,214,3,244,95,216,44,12,26,225,90,186,251,183,245,252,212,4,7,203,65,82,234,171,15,80,34,46,99,183,224,214,32,232,167,82,2,224,129,246,146,161,175,198,81,227,16,252,239,198,171,161,64,81,190,38,192,78,18,208,54,140,2,190,108,42,125,47,177,70,38,29,194,18,254,241,20,199,32,42,64,164,211,42,83,243,5,3,66,228,217,196,164,226,28,251,172,40,52,175,101,186,75,