{
  "ir_version": "7",
  "producer_name": "tf2onnx",
  "producer_version": "1.16.1 15c810",
  "graph": {
    "node": [
      {
        "input": [
          "functional_1/conv2d_4/Conv2D",
          "scale__97",
          "zero_point__104"
        ],
        "output": [
          "functional_1/conv2d_4/Conv2D_dequant"
        ],
        "name": "functional_1/conv2d_4/Conv2D_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/conv2d_3/Conv2D",
          "scale__99",
          "zero_point__104"
        ],
        "output": [
          "functional_1/conv2d_3/Conv2D_dequant"
        ],
        "name": "functional_1/conv2d_3/Conv2D_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/conv2d_2/Conv2D",
          "scale__101",
          "zero_point__104"
        ],
        "output": [
          "functional_1/conv2d_2/Conv2D_dequant"
        ],
        "name": "functional_1/conv2d_2/Conv2D_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/conv2d_1/Conv2D",
          "scale__103",
          "zero_point__104"
        ],
        "output": [
          "functional_1/conv2d_1/Conv2D_dequant"
        ],
        "name": "functional_1/conv2d_1/Conv2D_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "functional_1/conv2d/Conv2D",
          "scale__105",
          "zero_point__104"
        ],
        "output": [
          "functional_1/conv2d/Conv2D_dequant"
        ],
        "name": "functional_1/conv2d/Conv2D_dequant",
        "op_type": "DequantizeLinear"
      },
      {
        "input": [
          "input_1",
          "new_shape__184"
        ],
        "output": [
          "functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;functional_1/conv2d/BiasAdd/ReadVariableOp/resource;functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D1__107:0"
        ],
        "name": "functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;functional_1/conv2d/BiasAdd/ReadVariableOp/resource;functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D1__107",
        "op_type": "Reshape",
        "domain": ""
      },
      {
        "input": [
          "functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;functional_1/conv2d/BiasAdd/ReadVariableOp/resource;functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D1__107:0",
          "functional_1/conv2d/Conv2D_dequant",
          "functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;functional_1/conv2d/BiasAdd/ReadVariableOp/resource;functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D"
        ],
        "output": [
          "functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;functional_1/conv2d/BiasAdd/ReadVariableOp/resource;functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D1"
        ],
        "name": "functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;functional_1/conv2d/BiasAdd/ReadVariableOp/resource;functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D1",
        "op_type": "Conv",
        "attribute": [
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          },
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "10",
              "4"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "4",
              "1",
              "5",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;functional_1/conv2d/BiasAdd/ReadVariableOp/resource;functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D1"
        ],
        "output": [
          "Relu__67:0"
        ],
        "name": "Relu__67",
        "op_type": "Relu"
      },
      {
        "input": [
          "Relu__67:0",
          "const_fold_opt__173",
          "functional_1/activation_1/Relu;functional_1/batch_normalization_1/FusedBatchNormV3;functional_1/depthwise_conv2d/depthwise;functional_1/depthwise_conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/depthwise_conv2d/BiasAdd/ReadVariableOp/resource"
        ],
        "output": [
          "functional_1/activation_1/Relu;functional_1/batch_normalization_1/FusedBatchNormV3;functional_1/depthwise_conv2d/depthwise;functional_1/depthwise_conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/depthwise_conv2d/BiasAdd/ReadVariableOp/resource1"
        ],
        "name": "functional_1/activation_1/Relu;functional_1/batch_normalization_1/FusedBatchNormV3;functional_1/depthwise_conv2d/depthwise;functional_1/depthwise_conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/depthwise_conv2d/BiasAdd/ReadVariableOp/resource1",
        "op_type": "Conv",
        "attribute": [
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "64",
            "type": "INT"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "functional_1/activation_1/Relu;functional_1/batch_normalization_1/FusedBatchNormV3;functional_1/depthwise_conv2d/depthwise;functional_1/depthwise_conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/depthwise_conv2d/BiasAdd/ReadVariableOp/resource1"
        ],
        "output": [
          "Relu__70:0"
        ],
        "name": "Relu__70",
        "op_type": "Relu"
      },
      {
        "input": [
          "Relu__70:0",
          "functional_1/conv2d_1/Conv2D_dequant",
          "functional_1/activation_2/Relu;functional_1/batch_normalization_2/FusedBatchNormV3;functional_1/conv2d_1/BiasAdd/ReadVariableOp/resource;functional_1/conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d_1/Conv2D"
        ],
        "output": [
          "functional_1/activation_2/Relu;functional_1/batch_normalization_2/FusedBatchNormV3;functional_1/conv2d_1/BiasAdd/ReadVariableOp/resource;functional_1/conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d_1/Conv2D1"
        ],
        "name": "functional_1/activation_2/Relu;functional_1/batch_normalization_2/FusedBatchNormV3;functional_1/conv2d_1/BiasAdd/ReadVariableOp/resource;functional_1/conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d_1/Conv2D1",
        "op_type": "Conv",
        "attribute": [
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "functional_1/activation_2/Relu;functional_1/batch_normalization_2/FusedBatchNormV3;functional_1/conv2d_1/BiasAdd/ReadVariableOp/resource;functional_1/conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d_1/Conv2D1"
        ],
        "output": [
          "Relu__73:0"
        ],
        "name": "Relu__73",
        "op_type": "Relu"
      },
      {
        "input": [
          "Relu__73:0",
          "const_fold_opt__180",
          "functional_1/activation_3/Relu;functional_1/batch_normalization_3/FusedBatchNormV3;functional_1/depthwise_conv2d_1/depthwise;functional_1/depthwise_conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/depthwise_conv2d_1/BiasAdd/ReadVariableOp/resource"
        ],
        "output": [
          "functional_1/activation_3/Relu;functional_1/batch_normalization_3/FusedBatchNormV3;functional_1/depthwise_conv2d_1/depthwise;functional_1/depthwise_conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/depthwise_conv2d_1/BiasAdd/ReadVariableOp/resource1"
        ],
        "name": "functional_1/activation_3/Relu;functional_1/batch_normalization_3/FusedBatchNormV3;functional_1/depthwise_conv2d_1/depthwise;functional_1/depthwise_conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/depthwise_conv2d_1/BiasAdd/ReadVariableOp/resource1",
        "op_type": "Conv",
        "attribute": [
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "64",
            "type": "INT"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "functional_1/activation_3/Relu;functional_1/batch_normalization_3/FusedBatchNormV3;functional_1/depthwise_conv2d_1/depthwise;functional_1/depthwise_conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/depthwise_conv2d_1/BiasAdd/ReadVariableOp/resource1"
        ],
        "output": [
          "Relu__76:0"
        ],
        "name": "Relu__76",
        "op_type": "Relu"
      },
      {
        "input": [
          "Relu__76:0",
          "functional_1/conv2d_2/Conv2D_dequant",
          "functional_1/activation_4/Relu;functional_1/batch_normalization_4/FusedBatchNormV3;functional_1/conv2d_2/BiasAdd/ReadVariableOp/resource;functional_1/conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d_2/Conv2D"
        ],
        "output": [
          "functional_1/activation_4/Relu;functional_1/batch_normalization_4/FusedBatchNormV3;functional_1/conv2d_2/BiasAdd/ReadVariableOp/resource;functional_1/conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d_2/Conv2D1"
        ],
        "name": "functional_1/activation_4/Relu;functional_1/batch_normalization_4/FusedBatchNormV3;functional_1/conv2d_2/BiasAdd/ReadVariableOp/resource;functional_1/conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d_2/Conv2D1",
        "op_type": "Conv",
        "attribute": [
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "functional_1/activation_4/Relu;functional_1/batch_normalization_4/FusedBatchNormV3;functional_1/conv2d_2/BiasAdd/ReadVariableOp/resource;functional_1/conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d_2/Conv2D1"
        ],
        "output": [
          "Relu__79:0"
        ],
        "name": "Relu__79",
        "op_type": "Relu"
      },
      {
        "input": [
          "Relu__79:0",
          "const_fold_opt__183",
          "functional_1/activation_5/Relu;functional_1/batch_normalization_5/FusedBatchNormV3;functional_1/depthwise_conv2d_2/depthwise;functional_1/depthwise_conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/depthwise_conv2d_2/BiasAdd/ReadVariableOp/resource"
        ],
        "output": [
          "functional_1/activation_5/Relu;functional_1/batch_normalization_5/FusedBatchNormV3;functional_1/depthwise_conv2d_2/depthwise;functional_1/depthwise_conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/depthwise_conv2d_2/BiasAdd/ReadVariableOp/resource1"
        ],
        "name": "functional_1/activation_5/Relu;functional_1/batch_normalization_5/FusedBatchNormV3;functional_1/depthwise_conv2d_2/depthwise;functional_1/depthwise_conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/depthwise_conv2d_2/BiasAdd/ReadVariableOp/resource1",
        "op_type": "Conv",
        "attribute": [
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "64",
            "type": "INT"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "functional_1/activation_5/Relu;functional_1/batch_normalization_5/FusedBatchNormV3;functional_1/depthwise_conv2d_2/depthwise;functional_1/depthwise_conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/depthwise_conv2d_2/BiasAdd/ReadVariableOp/resource1"
        ],
        "output": [
          "Relu__82:0"
        ],
        "name": "Relu__82",
        "op_type": "Relu"
      },
      {
        "input": [
          "Relu__82:0",
          "functional_1/conv2d_3/Conv2D_dequant",
          "functional_1/activation_6/Relu;functional_1/batch_normalization_6/FusedBatchNormV3;functional_1/conv2d_3/BiasAdd/ReadVariableOp/resource;functional_1/conv2d_3/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d_3/Conv2D"
        ],
        "output": [
          "functional_1/activation_6/Relu;functional_1/batch_normalization_6/FusedBatchNormV3;functional_1/conv2d_3/BiasAdd/ReadVariableOp/resource;functional_1/conv2d_3/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d_3/Conv2D1"
        ],
        "name": "functional_1/activation_6/Relu;functional_1/batch_normalization_6/FusedBatchNormV3;functional_1/conv2d_3/BiasAdd/ReadVariableOp/resource;functional_1/conv2d_3/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d_3/Conv2D1",
        "op_type": "Conv",
        "attribute": [
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "functional_1/activation_6/Relu;functional_1/batch_normalization_6/FusedBatchNormV3;functional_1/conv2d_3/BiasAdd/ReadVariableOp/resource;functional_1/conv2d_3/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d_3/Conv2D1"
        ],
        "output": [
          "Relu__85:0"
        ],
        "name": "Relu__85",
        "op_type": "Relu"
      },
      {
        "input": [
          "Relu__85:0",
          "const_fold_opt__178",
          "functional_1/activation_7/Relu;functional_1/batch_normalization_7/FusedBatchNormV3;functional_1/depthwise_conv2d_3/depthwise;functional_1/depthwise_conv2d_3/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/depthwise_conv2d_3/BiasAdd/ReadVariableOp/resource"
        ],
        "output": [
          "functional_1/activation_7/Relu;functional_1/batch_normalization_7/FusedBatchNormV3;functional_1/depthwise_conv2d_3/depthwise;functional_1/depthwise_conv2d_3/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/depthwise_conv2d_3/BiasAdd/ReadVariableOp/resource1"
        ],
        "name": "functional_1/activation_7/Relu;functional_1/batch_normalization_7/FusedBatchNormV3;functional_1/depthwise_conv2d_3/depthwise;functional_1/depthwise_conv2d_3/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/depthwise_conv2d_3/BiasAdd/ReadVariableOp/resource1",
        "op_type": "Conv",
        "attribute": [
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "64",
            "type": "INT"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "functional_1/activation_7/Relu;functional_1/batch_normalization_7/FusedBatchNormV3;functional_1/depthwise_conv2d_3/depthwise;functional_1/depthwise_conv2d_3/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/depthwise_conv2d_3/BiasAdd/ReadVariableOp/resource1"
        ],
        "output": [
          "Relu__88:0"
        ],
        "name": "Relu__88",
        "op_type": "Relu"
      },
      {
        "input": [
          "Relu__88:0",
          "functional_1/conv2d_4/Conv2D_dequant",
          "functional_1/activation_8/Relu;functional_1/batch_normalization_8/FusedBatchNormV3;functional_1/conv2d_4/BiasAdd/ReadVariableOp/resource;functional_1/conv2d_4/BiasAdd;functional_1/conv2d_4/Conv2D"
        ],
        "output": [
          "functional_1/activation_8/Relu;functional_1/batch_normalization_8/FusedBatchNormV3;functional_1/conv2d_4/BiasAdd/ReadVariableOp/resource;functional_1/conv2d_4/BiasAdd;functional_1/conv2d_4/Conv2D1"
        ],
        "name": "functional_1/activation_8/Relu;functional_1/batch_normalization_8/FusedBatchNormV3;functional_1/conv2d_4/BiasAdd/ReadVariableOp/resource;functional_1/conv2d_4/BiasAdd;functional_1/conv2d_4/Conv2D1",
        "op_type": "Conv",
        "attribute": [
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "functional_1/activation_8/Relu;functional_1/batch_normalization_8/FusedBatchNormV3;functional_1/conv2d_4/BiasAdd/ReadVariableOp/resource;functional_1/conv2d_4/BiasAdd;functional_1/conv2d_4/Conv2D1"
        ],
        "output": [
          "Relu__91:0"
        ],
        "name": "Relu__91",
        "op_type": "Relu"
      },
      {
        "input": [
          "Relu__91:0"
        ],
        "output": [
          "functional_1/average_pooling2d/AvgPool"
        ],
        "name": "functional_1/average_pooling2d/AvgPool",
        "op_type": "AveragePool",
        "attribute": [
          {
            "name": "strides",
            "ints": [
              "25",
              "5"
            ],
            "type": "INTS"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "25",
              "5"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "functional_1/average_pooling2d/AvgPool",
          "const_fold_opt__171"
        ],
        "output": [
          "functional_1/flatten/Reshape"
        ],
        "name": "functional_1/flatten/Reshape",
        "op_type": "Reshape"
      },
      {
        "input": [
          "functional_1/flatten/Reshape",
          "const_fold_opt__176",
          "functional_1/dense/BiasAdd/ReadVariableOp/resource"
        ],
        "output": [
          "Add__95:0"
        ],
        "op_type": "Gemm",
        "attribute": [
          {
            "name": "alpha",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "beta",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "transA",
            "i": "0",
            "type": "INT"
          },
          {
            "name": "transB",
            "i": "0",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "Add__95:0"
        ],
        "output": [
          "Identity"
        ],
        "name": "Identity",
        "op_type": "Softmax",
        "domain": ""
      }
    ],
    "name": "tf2onnx",
    "initializer": [
      {
        "data_type": 3,
        "name": "zero_point__104",
        "raw_data": "AA=="
      },
      {
        "data_type": 1,
        "name": "scale__99",
        "raw_data": "Pu+ROw=="
      },
      {
        "data_type": 1,
        "name": "scale__97",
        "raw_data": "vaVUPA=="
      },
      {
        "data_type": 1,
        "name": "scale__105",
        "raw_data": "MJAEOw=="
      },
      {
        "data_type": 1,
        "name": "scale__103",
        "raw_data": "ewKbOw=="
      },
      {
        "data_type": 1,
        "name": "scale__101",
        "raw_data": "63XAOw=="
      },
      {
        "dims": [
          "4"
        ],
        "data_type": 7,
        "name": "new_shape__184",
        "raw_data": "//////////8BAAAAAAAAADEAAAAAAAAACgAAAAAAAAA="
      },
      {
        "dims": [
          "12"
        ],
        "data_type": 1,
        "name": "functional_1/dense/BiasAdd/ReadVariableOp/resource",
        "raw_data": "8qFVvQkAMbzjmDS97ZRzvTbcpbuXI329eTkLvgeisDyeiC69JhDQvW3K7LwRsOs9"
      },
      {
        "dims": [
          "64",
          "64",
          "1",
          "1"
        ],
        "data_type": 3,
        "name": "functional_1/conv2d_4/Conv2D",
        "raw_data": "Me//FsrzPiPpOhf/9Qz2BucDEOj/M/P8Affn6RQJMwgW1dP35vIBCvUQBfUsBdonAQoGHAsHT/Pv5fAfxAbj6AHx1O36JewPDPJOBBD/ChXB9OwU/wwd4OUG3yoiGOnJAfvf6tzv8ArtJOcfB+fqCPw99fkaJPD1JRgR7/gMGvwc3C09C+88IA0T3eMdMvfV/Tga7g0x3ucb9b7RA+5CRfcC/Qnf/jHhGwcr2tHwCzr3BvgnAv0I3hjouxDw7ucdyPg2/Tob6xVD9OoJ29P5/dLo8A76Ae/f9+UXJdUD8vkU7QcHEPgHDSHyB9r17lEB9v71+RoR5/7nCC/1ARj6Gj347dkE+AXz5vwBFaL9Ae/oI8cQNCooEQf0Cx4KEt8Q8ur85MLP2ASjD8A28AHb7/8sKurU6EYMzBzbtTPpBx7I/iD06irfMwjd+ycExjzp1rX0D+rVCfrsAP775fTp9ggNBOXsC/P6FvbyDdj5Ju9g8zbL6AwJLNUPGhVHFgX55v/UC8kRRA4bBPQL198z6ePn/eQM4+LJ9+QyAePcHe0wAAAM6QT3MPgAKRAgIBlGTBEH+xH+SQe61RlB7y3g1g/m1vtWF/fzBrzdLdM5BPPY+OYXAxIq2wAPJCPvA/4G8xgpAc3t7e0IGCDw4yIV+Nsy69QG+uLvCVIHryjrDChN2jr85uP/HPVELQ/oBgEZ//rmCBQcDeYU+voiBCkW9x744/X2vhPqyiYCvt0a3g4V3BEOLQj33e/+6d3OEsIe+vPCD1HwHKvz9OTxuRfvB9UdGPQiHywy6uk+yQnz8hO87RrwDBciAgYEwwfh2vrr1jHq1cfh9Q8LA/XIOvYIExbH+B7w70g6Fu0sGgoG68sCFPT08x7w6iDo8PkS8ycCPAX0FCsDCQb+GSMIFRMbHvsYAy4n/uXhBgHvH8wD3ALk8v03NhDn/xPO7BzL8u0J5AD0I/Al+e386zT76h/d9OEBDwvjGQH6/wYV89oePxbMUenR+fbv8fAaL7kVB90U4Pv/6vcW2uIFKy/s0L3xGxAd/uz0BBQp19n17/wIA/EKA9b5GevzLPcVzhIb+ujwAPwDIBcILxrh7hm6+xxS48gI9QAHFv4DCej+/AkZKdrC8xj79wv759/t/t/r5zLeBRAM9OEL6AYwCAUXGwX+ESnyBPEVHhz6NA8pNQP4FOVPvd8uE+Rp7QYPKP/o6hEhwPoODw4W78kN6DzpIBsME/bu9PcGPTHz1vgL/t8M9goDLvz54AfY5eb5BTQHH6baBhdFDfHvBPEL+Pb2DAHvKgLoCgj79Qj7I/MT890FCQvj6Qrn/eHa89oNGtoDGir48ePn/+fk7fL0Jc3hE/7bMxXrNgjs/tg57RbI//jyBLkPGuHrCiXm/CvY4+jz3ioGF9kPOCXV8yTyCvwGDvMkIvglCB/m2EcAwuPe3OwP7g32BvsT/PI16P7w3hTiIPYNGR0I7fUMKQMEBRbs495T8CDwH/3k+rgkIj7+AQ336vTT7+g18fYE7Bc8vdX3/jgL5iDV/AEND/H28A/z9kD75qH5GvITGB377hD20QjkD+TiBxL26QfjAgD51yQ6xPjv+wn41ODxRPcnFfokEe4LDxy36vEGGxQgJAMhCdLLPQHDCtwHEOrz2NjVICj4IxbNGPXo5OpBA/gCCRDuEwwMAEQDDOQ0M+H54u1IP+cp8M1B5iML/trL9AMzG9bd2OgM4zb8+gop6g740xn3FCwMAPjp6go3/x4Q6h8Q5fkO2QTkG+sy/PzwDvEB7cv3Hxvh8Q8HAOz29tn2E/DbBgsQ5PEMKvLy/Pw1A/0HqPb18w/X4gHvIRz0Dhjpvh4l/APkKNgN4N/kXRX04yH7Hvn078wnFA2yLKU2PA0CDOcEM+G7B+8N3BrSCObS3CPs3hL58CbtARfwJigDAivy9/woRkwS6yUpN03ky9895wwtHd/N/f+6ADbWGyYE7ROt1S8E6fTQ/vX4Bhvz2w0U0Nj91ykK+vvl1QMcBxcT3vYcBeZI7TclHxMZ8MEFFdsQDmj7CfI3Aub/MS0BEdIU/xIFzwoh7+sjPAT8L/Hf0unVQRUFzwcH7tf2Hgj7H9P9EhcsFdwfL/3qRtvk3u367hLkIPbvPxUCCvwaH/rrKPL3C+378fYFCQb33fnl/gbc+ewGLu0JCg35/wcE/B3fAPY9GA0SAwQdAfr35BUU5O4S7wzy6Bz6/vFNOgkD6hQKEPzYDvz6/g0F8OQ07QHmBNoB+TnxDxUh6QgYIPkS3QfzHgD14wkG++j31Qr92gnjAAo+7f8y/h8CAA8n/PMR7Qf55fXm/gX8Bv7t/+EKAO784w0q+REvEPoBLQkCFOAR8S0L2QP2HQ3rA/fl9+334AL1JvP64BccD1EFCCnu6+YH/PQXQRbYDBj38Qj5C9/65yYdIOT5/x0ETOkAFhvj4P72+fYK7ikP+NrhKf/K8eH/MPHxABXzGvj75Obc6PTrKxXv4rL/LRoRG/0a5SnB+vvlIsr8LO3fGwTMENTNG878FfI43zOaye4JKPIPHwJTBtYoAOz8Mfbf+dzq9vD01fnbOOTkCB36HfsU7/gw5QsxDiDH1PX08jX8/fkD1x72PgkH1C3a5dH9Chj43inOChjG4Ob0NQ8LBRYkMPrr/vUJ+OYGAQMDBBvY4RLg9/bq3u4FJPYTGALiCBMs+SPZ/+tICO0K+A0P/P7kBQn47dsADTXeERkl6eQkBA4F0xfaGf4C9wUB8AIN9uoU8A0H8u9a/QLoCQLaFtcYFRML9OsaKRnFDdYi4eQe8vgt69/yAuwVMugIA8r5HBn6NEr56MPjLe8L5u//GQH44+vvHxEZN/0t28fu6vTTJ9kq7w0aCc35+QEQIw0UNQHZ9/vz3QYZ3AwSHer/6wXmBPfdHAcMCxj70+4GDOjn+y31FxjV7AAgEuEt9NDl6P4IIgPMDzUo2AXPEQT44gPV9z3K2/v5MywIBzEZ5uPUDuOsIiE1Fc/x8dcSPPQM+fQM0xb9QB7mB9sxARTc6uXn7QL0R87vFQy5MPPUzPAq1Bk1zsP0AcYl1jof8RUD5PkPEOPowN7yCywM/9wGAPcgAsgi+N3nC/kN9fn/Gdj0Lxch7vT6+PHJ4dUIJ/Hy6gQJEO6xGQN/ARzd3xMmCiEGD/P9/+b2/STaBPH66gsN8O36JQvgDzrxGfzz8dc43fsMLgL88BgB9Pf57AYUF94FCwsU+dYBC9TY/sbmAhUA6AkARufi+gbt6QsH8i8YNRfgBhzlH/jQ2uYb5/FMDRwc3PPFPgzE7fchHwLg8w7zHNsAD8EWCA4CAQPSCwH9I/LzAFEBJA3p9MocFAURFRPe4vb34DYQCeUJ+On3DAnoB+YO3C0lzuT43SDy+fwAGPo2G/oM4fj48Ob/Iv8N7+AP/uX2FvcW7MXU0BMABvL72kfi4SIR2/z42BgdJBvu7Rw7+w4e+eUc9sQkAOPN4SHnJivg7h/o7z7tDhUJ8xb5DQ7SOCX5E/Pr8/kKFhQ0+fYA3RQOGyK37QAW/gwR7gD8+/z28PvcBxbZLQLlIAH63NAK/8zbDu8o+Os5E/jxGCQDFvLpEv3+/fn/E/X8Hd7vIfQO1wjx3f0h8wE8OgIyAPv0+e/q+RoT8hL7Aebi+Ozr+Nj59yH0KssA4gv1GCssF/b7P9UODsPq7eMHHgsB3/7uLw351ufjMiwYDwDyCyIG8/jvAfcpGPsWCgQS8ubc4hfx2+3qBzs76B3wB/XhGQH+GusT8e8p4BLDBOL+6fQF+dUaFTX9AfPt6OfG49Dl8zwEFt4D7vj19/brGw7w/Twa+uj0BFcCBeL4De/41+b+5tTs+RUHDdfx+Bj+ERoG7+wo4vYaFBbAC+jm3UH8/goBzwftGQ0MHCHu3cweDBv/10XhIiLu2h4KLPAB6dYM/+gS4i7o/hjQ7PMX3wP1/vf16RQGKwEU+vLx3bQg3dH5IO8O4yT+8RbdAtHyFQESPQIdDAAWMu7OEywECAoAMwes+es1NurACukPLvIV4toH4ub1DOLz4x1AFwfn+PPiPOYWEvbXSQ/q3BXB9SwQ30Y65x79ByUyARM49CX/CSX16y/4G+rj7efp+QYD8uHnJMr+8iQHxBIdFgsKHdjt1R/1IPP15gMC79oq7AQMCdksIeEb298KO/r7BiX/Bhrs8gn57gIp7gHeDivu6Rr17+j2/d/x+lED/e35+PT61AEjGPQSE/D/DOMQ5wH58yD3OA78HPb2+OwiBSUcOOcs+A8atfPR2/0EAgMX4wIF+Q0AzEf13ekBFgToEwNNAQL/BwsC8usZ/PDr2/QK4efY6woK2eEoBhj/4AL31QYn+yoJ6wrvDRY/1bnV/RfnCATY6d7y1/b5Cun3I/zv4RP97S3zKCoV7xP2U9gbyf0zAAARASxPCvkZ/wHTBzA6DsABBPK76hLjESi7A/ci+fT0AgP5KdTUIgwltBoW8sNIRdstCgwBsBNMHRUo5MfrIt8PG/FD6icg+ObP//Tp3yjR/A3pBeX5+S7Wx/sCBPzv/gjr2d3r/t3r5wEcAPgmCBIHI/QUJxnmBwdWAhboFBg0ARr5IQwYDhry/Q8p/fj38h/tMu7TDhQLxggT5vIPGOUJC+HdyhDn6hzpzf8TJ+weAPjs9eHq6A0DFv0xK/PVTv3c6vjh8gkLKiDuGAEX8xYq6ePvNc8VDeYC+9wDDg8kBSX4Fd8S3w//FAwWHQTH9RjV/BzrC+0S9/AGOBLb3QTi2h7Z0Rvu30vWAczUCDL9/gUQGukRIjPYvAP1HiUUHgwJ7gu+EtnY7eQTDuwd+lnj/N3s/fTJ+fRJ6yrfAyD6/Qv2CCwg/CYTWRw24gPn3QYG7SHxD+XrH+EWuxL0CezvCfHgOBI48Qv5zejlz/TO3b03BwjhHen59/AP4/v+AwIFGRnc7hUt7SjfVA4D2s7QFOtJFy3Q2wsGJvsa7B/U9ALiGu8XX+bn9Prn9gVF4+TKMtf05AgeG+0p5Ofx8wry8hUTAdc5veEKEzL9AwPXGAzn3Qbr4vPlLxXr7wfr2vUJ6u738+AWAxj4B/YF0NMcABkk0u0WF+vvAQAw4twQ4wMb0QYR+Uo17/n1LwPxAN8O3CHyKfXpIcTzFjr3JRHu8t4i1xUmC/3Q9/Hg60UE+QEL7h7vDQ8M+hzsyPYr7g0qCTAPAhPU4uv1BAcK79fW+Ajr2/Is++/IIh/hBhsFLOr1A70A6Q0YzQgG7fQMDBEYBMEBCOT8APob+ebf7loIEvvr3S8CAQkk+i/74+EmM/gCByAJ3Ar48vUE/wkQ5fsH4/QcF+Xk9xb39TUY6evbEgkWABMTDvwHAxkL+/H17vgOyA/lF9orDPEj/Qbo1dkaGgbW3rDtIwAV4vb/7OUM2t0CDe0w+eMD6+TmHg36+/0x5O4CH/Xp5vjy7wcF5RAFIhLDBCJa2w=="
      },
      {
        "dims": [
          "64",
          "64",
          "1",
          "1"
        ],
        "data_type": 3,
        "name": "functional_1/conv2d_3/Conv2D",
        "raw_data": "BRMLJeoduQzjxFf1Jp/+yAwB/f0RDgfG+Afq9jog+dDft9vbPAkwEgkY4APlPvgQ8Sj3yTvK8+ID0/voCbYFHyMI19P9+QvwCgsHCw4jEx/tBvYFySAZ/fcJBO3x7xQN+REqGA8sBwf07N7t+OoPGiAfCDc1E+fiBfol9RQQ6RT62t/gMvqv98r3/Ofd9k4vAzXyNes1z9YiG2ZDQhxRGjOqI90v/iHMCxHdztUk7AXSNBP1ADEX/McGvinv48vyVubtAzxN2O/xzSrsH/X/mt7D21kOvlgKGBPYBsVCz73h/tIhHHw0FwjV9wTTF0Oh+Q4Z6sTGE+jG1DL+HAXaAjAtf/TAviIfyw7sDOof4qPZWgcZ2Bcozf4Az9P3K+o11jsfEicfDen206T+PNwK5g7wPRW+4tu2F8TC/KY1NSvO7S4U8SK6Cf4R8ijuF8vl6ugbBtDo1hfr6RMqqfAV8AED5dL0LOwi2A/GKBzt9g31GEwtGtIgD+ncHB/BRdwsKhlA3OsGCgEotPTvw/sj6Pkot/BqJB+8+0QYFhDr3hnXuQDn7/zK8ukluM0W3Tr5GSW0BSQPL+v4z733zxe6RPARwAndJC7I/Djy2SPQ+S8jRibU6d2fJR/pA+v28wb+F0rF2NE16+Is9Q/ruubrFzL25AIi2voMHdHHPP4UIM0FzAz53QH70egm/dPgF/3jFt7wBQci3wjz0xzo+P7tCeoo+fbzA+D23/Lt7Qz86tbUHx3rF/XwDVgtEwEGLeMyz+zwJOMPzd8qCjje2QMD3AELwuzrDy0I3uff9fksFBQGGdUeBej55CLW5SDf9iED/AId/zfM7CXH9Nbl5fwPRPUDAE/0Pt5D7P0BWenSXv7Jt9kiGRQru77S1uf1IDLq2b/+wNEaKt4ZKgvYBC4L+NLqzgoi7bcNtwXw2c7PCcntOuT1Ivf9BPseHCo5CxThKi5lD8wUsdUP+xLkYw/45M4EFvgjEg7bNwn/yyPWE/UmwZ0ZBgfc/w76VhDvxO3//yhJAfIb2sJKGxvO9fr17eAJ5tENCyDE6goPxv3I1tzpB/EfHC4S7TQT2uIvF8oRxR8uzAVrPDAtBOHmJBfjFM43Dv3kPcZf4MQ0KkjO5NZOBeQlwgDo9A3f4Njy4u8o11AJvQEACR3zBvHkKggJFFSyEuAF2intRirBCQC8Kg4eIy3y+zX+Stj7CBoq+AWs+CwQ3TzoRAcDH+VI29ggPt4G5sP28doACC/EJs3tztgaBP4c1QH9FQDj6ycXDufoINn06Qf+KP0J+8Xw+yswJeMO8SL04gjZx98j1lAX9PT1OFLMPd722AbSwTrNFcgwO/xar6E1vD7F2s0pyhsM7/Dc0hLz3Nv/Gg8X+PriFQHf8vQm8DIV4c76/Cj7EAw96cTu8vca5M7h1EzjCAQgBwccP/gyEeka7bv/Nw0/1zAX88f5+s/OFuszARrO3SMgBfbZL8IjBAjh8NXXBDXO8NM0I84Y9+n0FAXcvss1zeQHEyAs8A4p3AL9ugAB/hAfAw725Bj2/gnn8/Hu9vcL+xLL7uMzAA7s/d/cyd3iP/AHIRruOgP7y9vkJM3/3fUd/RMy2u/+BPPwPhcY9v8FHeO96rn75Pr/ATDZ7d8cDCRG07YHC8/uDP8c9zEAywq75PgB3uojATQACfKxSxXs8tUiBysYKdnhBAI8AO0ALD8T8uQDCOMjFt8oJifTIw/p/w5C3wXf+TH39czD6RwX7wj6Avvd6tsDIPkI69vWIPQS5f70FeGt7vMlAuv/AvA1903IIEDP5d/ZBjMvxijkDenY3fSVAeX48BTdENE94z3H+ekZ1RboHvMHFyTQG+fiGB808a7kHCnpCefsKzkHSzrm+QUQCSbi2h7rFkg9/AaOBKkR7O028MMG8AsXy8HHJhP+7OteCtgIGgCz0j7YAxwgJgMm+RIB3sb1FSYeyeO/7OUGFPvtAxcaCdLZFgsD/fvtABU/Cyr5KekC/h4CGPoRIv8BFQ0IKQLfJTQP+w4xAT7+Quv98hwP7Q8JF+4bBuPzzv8z2vHg8iwP/rbW+/Ij8i3o1AUh2wgMEM/WMggU+e0Z6yQmPG75RLn48TUw/7K1JDvoObfz4xQG4C9RNOz3FOAKAtsi/i0D3jIyCf8N8PYbBQAc8/sc//4MFf8mKeAQAvADJwIEIOb2DgUvGfYbGxIrDBgSD/PaAf4G7Cjk3Dzr3PAfFimxHSXvDPMILBMP6NkeD8Emw+nz6OX5N8Dd0kwPtNQascwYHAe47egLC9og9cz/1tEaEgHy394TNhzju/MY3cci8cbg70vU1OBNHgcKJ9AksNxKIBI61Ajk2g8YGb/dDeYV4wMk4u70uyIeN9JL4y0du//55/0NIAHU2Qjp8vr+/9zX1PshIPjb6uY6H9URDsvkIRYAaiNA1vD/ygRE0CcQ/JoG/hwBKTMyuRvw6MS+r/7lAwIk4Qnr0SvJBODKNBw1o9363y4wGvfZ+wDHPPTmFu1WEY3d1SEWjtIK+vvnL0v04Og7xuwEUuT7bRj1HkMUG/QQCy/0Cf365g/gLRZO7u8s3ArTGQhL/N7k/j3y3yUS0eEE1uP21/HAF9xECebh5tE8uSnGH8bXNuIpJPgH4cb78yQIBP8YE/TtNPrRA7MiAksULPfV3+QN+8wR/fgW8xwIQwkBExLTFvdKGNwG6Hjp/fEh8fbKLvr/ZSIQAtz/Ke8GBSwryhDlAvg+5hwIEew60/3R+f7jAgTeKjXyyQkzFh5A0ezlFfHHNQHrrvq5w8zbNe0K/fXaycIpNdUZ1zML4SO1AtVHHFIfzC4ZE9cM//YN2hUcKsTjGzb4AwIr7ebYxOwS/cgaIstC0jH32AxFH77OABrP1hX4GDYqDEWsHuzKzDPkD+gKzCP87Mzu7u/nCCr2+SHy4QpMzAYa0RgjvuwD/PLv/uzyIigUv+f14uruEeXVMeMHBSkA/RwA6iP37uwVCenoCyEE9swDRQrtAQ7/8wAXECPNxyMz7fz8GNEi6ggY9SfoCQ0FzvQHLO7l7NzEBvfP3eAc+vIkHu3nAdTvvAYtGepH3BoW+r78Lu4PvybRPPQkHgbpDUZQ/rc0ze4A7vQE8iYy6QZSIPrKzvEW6AzTFdFA5TQTAaneA8pBHRIxD+QAKv/GBiHY8R/Z8eL5Oy6/TwXvGcQA/jk49OTiGAYOyvkGAA7x+we97ewVEScZ1A0h8Cfl8wA10SEeISEgGQnztDfe+RbBAQI/x/8/6CFj30vx+7vWBxEzHfka5RT63Cso5SPFCQzlIRriHQkMA+Tqu/YJ9hRPKA4B0czN4Ce7AAHWy1CgDPfL0MDvORwmAjYK2yEkB+QaCRAi4t8Y68Tpv8oPG/vk6MvfBuYI7x4ctAYd6e3979Hq5vDW3R8D01gcIg0SARrs4gUJCvPzEfjeRNzyBDEAF7783TXOECTWv/Qi0uL+A/vsHvysF/7Q5uPC8RUO1U0pOy08Nvjey9T9NgDzKhIO8Urm8tbVKgktA83fARUJFujY+Pj5+vHguxoP7tHQ+Lrj6zjS2CIaAgA4FaUBxDrPDt85BAX+5gD9FvEl1dkJ4vrj/Pvi+vsNAgv1PgcKxQsUIwktDszsAgIEzyAvA/YjCtzZJtkK2lgo3vEh8TXYwg0UCB0tD9IJEr8A+QM1CPHu3By93fI+//7O0O7h9gGu8w873AEds9zrH0L66+MY9dn+HSXrzzxcGvHxy8bg/D0mCiLgClHy8vL5+DDRzyHT59sm8Uvv4un4gwnYLdGaAAkD2FDSz9cJfqsUCOIi1MjnJijI1AMH+QE8B9JfEQo5DtT1R+MvIbcT9ESvQQVDBTboMsgQ/yHxPD83GgQCI+vKFjHi5QtnsvTgCfYM7wwQ/MPrDBEU2yvi/Bbj/Afm8s77/hRFDADkFhXB7PPhCiji/AfxGeUbFBcABSoG9NcDLvvn9/IZ+f720u/j4Pvh//kcDeT24cQhE/QQ8RoI7ATuILkt2woLJ8Y8Me8oI/MBHg7AGSfrNPXe7QnvzAYF3p8HGh0z8MHE8M4b5t3arAHNzlYvDQYqDSQDlPO0JfH/GwU6DRzpLhTz3uvo8ufd3AoW7/fQ3uHs8yMCzePUzAxAEd4G7Bjk3hMV498mIs4AFQ3VCuUF+fwZEwn2P/3n2eAUHSbzw0DoPcjMPyQEIyCUw8IDHhyqAtnq8RgIxb7yAvTg0yTNAv8K1bZORREq/wLECirO/9r4NjcJAv0s3uQEtvH+8AUfyQ704PL12u7k5ecLCgcRG+r3EiUlHtzu/Qn00/UB/fUA4A0z/hUBFyEO6fgPC/bj4eDa6N0tz/4AANZYEPHUKdm/1vUH5wDcGhEf4NjyIzEI30RA2/EH9wHqIt8K5+jN+//+1j30CzjYHcq6UBG5BgHgATTH9R3rzvf0LiMgwQQaPAb2tD8LxB0/8N/89eLosyvTAMdBzSTnIvLlMSwU5yMp1ujgBeLP6KcqKUHqzPEISQwx/FIoHO8n7dAI7in//FHqBjoBErQ1//cV5wsb+/3MGEsJA87NHyJF++QOScwNAA0SICrm8mXvzPrWttovBQc0CsYL8uUcSO7Czg8X98g6zQrVRR4q4eD/KR0H49IQBA8BK/L5370lCg/46Q4IrURUJf9D3bEJFxQBD9PPscfB7LcqKSH7mwBfFi3v0N7n1Q8K8PQq+kTa3QH+CwDAI8r95dqr2/n/zcU6ri1B6TPtJiX91PX00w4MGwfIEMpIFwUjBeRZQN28HSkmBiAPxe/8HdIHHcUg8SPy8j0E3s0XGRYJ+xPzJjQW9SYTENzJKgzw3+b6+fQou/YEGQze4fcF2A7d19jw2zj8B9q3JgpK1dUZKOMc4NxjygKmKd4O8wELKwkMHdbRCdfDA3If6BK/686yBqP46TbwMe8K3yHj+RS6LJYrwvfg5VSjDunWoaM1pBoCNOMD/hPp6jjxyf0u/jYZIBnsOfD0HQHx1AInB/7k9eYZ98Y2FuYsNhYT9+zz+PErzUH28dXGG/PcySX5RTi97CP9QcV57xcp+Rv+GO4vAAjkDQwRB936vf/3udezAh3v/VUcCBb22wYHORvJISwr8isRHeQrJh5Z3hwnMA0IDUYo+fwcuQYn7AnjxxsMEx623fLzEenP9gHl+fDGIdkI69cS4tQnHibUDAPa8xTk5wwBDMzpBqcTzb0GCkkQRfD87tsiJ04a0roK1g01197s7wzQFB/REOT87f8HwBsO7sjtB/vU4RPzESHdEAjt10yrFQ/38Cvh/QDZCf/qGfXg3wftFAIT7yMb2RENEt0O3O0EPwnM6+b72fnh9B/g0ynvDvYPB/4Z9zcI0PYVKhcOz/v8xOvbDPL08OQjFykQpB8ZH+HP2+MGNs0D4BXt7h3L0ksQE+DtMvQt0+vh4RzQwOP0zxrN8NcbC7gQ0f0Tz0C/6wMrIjzyQA=="
      },
      {
        "dims": [
          "64",
          "64",
          "1",
          "1"
        ],
        "data_type": 3,
        "name": "functional_1/conv2d_2/Conv2D",
        "raw_data": "4gb+4xTb8ADh/u4T8xMW/NgA9gcqDfL5FwMV6x8PwcLrHO0X/h4Z8QwB3yXlFe7u3w8PDvny//Tf/PQP1dj8/AEK3/wb4s7g5TMpH/T26f9G6z0xEgDHDwM1FOgl8Bv4Rrok2/H3+hghDQcDJhoh/t3yAgMl7P4gBTAPNvUDIhniDjHW6xkE1b8jNe715RUKMA39C/0o9f388wrf/9cVBeQW/PBA2BrR/fEoCwIB+PwQQCgq9wAIGewW6Q36/R7w2foTD/4p8yEGJ8u/KPPw5Bsj8g039vz9AQAcGSQFI+D56djYRQEEAxoh9ysx+zbtzwwI8u4g7/cXCBsj7yojDCYR5fPYDxASLPoJCe2z3CTpwtIGG/sk8iAP4PvxJscZ+voZ+yX/HvEf+xAZ8hIZ3dL54QPvDNvn5CDgAubX8CX6xuH8Hkvq/xDd+iQ3MfAA9M8ftskh5kXrHBQLt9AHBQQCD96aGB306/7mvhne7jY74SrL8en35hL+4sLMD8btPvz7JP7ZENIaJUfwEwMo9lEdGNvo3Q7q/g4ICjAm5+IPTAMHGtnW/zYO6hHvEVkBFOAGAv4w/R3N/zMY/dz4AQ8O39Tp9CkyKgU1+vA1xfEZ7QYJ4uDpCSUXJ+wRARIr+Q/W9SrU9vfSN96+Fg4J+9kdAu8V8gf9zv0C6t/zvxHcIPP8NxEj2P8b2v7KIfn3DLgQFN/x3wguBxb8FxgGQyUUyh/fBu/czyD90gMNERbp4EsnAObBHj/YC9gM1dns6/81BOXT897oBRv8FfbMDCP93/n0+xrwCSrbEdnoFfoRBO7fI98y98/mEO0Z9ucnBeoODQr1D/sMxTTu+Rz3AvIV6ijtQ+sknQICBg/xzPwFvvzv+e0U/yj98/APNdsL5+0d8QHn1hgV9gga1ena4P8E9TDV6/MY0g7xNO4MBQf67Cj6/sX2DBQc+fXz6Ojh4iz/DPQG1enu/w/+3N71Ai3wAwfTCtcFDPsF6NLzC/fu8fnrAcwB7MPb9uDmDBP57wQC+Nru/dvI/xExIxI06eYU2u357P8PCcz0FPsf3t7dDiPn6xMZ8f0J/hoF4hPhDwfh7OkNBgIFAwTZ4Acc6xbrHM8LAxMALtv2Khzg6D0J1L028N77ABEz5BcZE9w0CxUYJAbyKdLqAQgEBxLmFRfM3s4zFbD8BgH/yxII40b8Nvnx3RAp+dzz/MtE/e7u6+wIyuXXyADw74H4H9UE7R4G4RgUCtUT7ubuyC3k2/AUBQjHOvUNIA3u6t/y3wr0Oc0eExv9DQ3W3gcV4fH+Oikb8dznyg0d5i/j1yrr+vYRCOIkNwXhyvbu0CbgA97nAukGDwb27tzb6wLc/uv4GOcm2PE4QvvXDEgS6O7X0OsaCijSIiDnC1fqGO4VQdwA+/4YEub8FwT/1Rn/vvPWIeE/9SPWD8boGOY4/QTKFjgt5f0kGujf+BIM4toH9QPe7f70KunyEwYgAQMlzu79IPju/e8J7PTyFwkA7C3/2PD4HhLz8O8GAusG/xjdGuTS6Bj++9j4G8jKABH3ARn5BfjBH9sWDQIMGQ0pGAwK/Qv7ru/wEQcWxewAFuXcz+kSJPncDPz3xP64x8gvI+sA5+El8SDp8AzWJgAbERkNCQcMDwfWHdH9BunSAQ/zDeHr1vEdA/cSIfcIAugr3gD1LvoJD/378/MAESDoA/fxGx4b/BIm8+wUJQkG8dsJtmDVOgAc3/D39+8CEggHHeff0R0L7+oVvyLuEgLO6x/x7w3yFvsuNAgbDSwuGxoOyRkV+PEGGPkcFOnrCfn2IyQM8TMg094C7/LvIAz0HvX64NIXEOoRGuTk1gQCExEND/oY+/QAIQXY7uTxMRrp7ubq8MrrCywzEfIFDiIM7iEKOAELL+8J2Rf79gMLBggQ6fHvOSvmHtgFE/sS/hzr/+E2+N7LJy0h5OTmL+X29Rbn7AUdCOwb4Sws+h/XNA7WFQsc7OzwIxklKQzaBvfO7z/z+fLaE+AEzeMl5RAX7PXf+OzvBvDwDRMfkzIKBhj18RMHF/MXAP7VJDsd7RHyEi4DGecsGfQi2/4P8ws+BBLsLekEDfA6Fuv/MOryE+/XABPVPA7kA/nIHw4OUPI3GTEo5BdA2yoAFCYoxe74xQ8JJe0Vzek+Gf8C8/QJ4dMyyiL/EvEcFMnx+QjOFw30De33LAD0yArqAi1J3THY2DfwDy0e7iAfGOoP4DglEPovODku3fMBCvU4Bt721fLjyMMzKgPe/SH1Dia++wsgKPjb/BrzFAEOACE1DyfY2yMLH+Tg++PpCh3gA/0Eyjfx/f7V/93lJ+cq/vUJvNLF2dvwEBXbAQ/+79X73L7i5v38EgE1BPjr/g77MgQhJQvq6szyywAiGAQjORMFKB0UFgDL6+sD7t4Mwt/f7vHtDgsUFyr6AcUd7BDy4e8t2doCA+7WB98OJgr+IRTgKAjwKv3s4vb5KNMK6R/T0+/XDvn57PM56PkPDDYwNdPl7/cOAv4y6fjf7OMI/+3e6/LDFvUUAxztHTUH2+X1+d4zG+zY/C8G/yAl+tX2Etrb5xgnJD7azws+JA/f0jX/JfIl8Bcl0Rgf4BD59BgJMAIMBfHo9RDqDu7nyv3b/yUIzvEQ9/Qg5QkYFRQn6iYY8u0J3/LG9fP8zCYPKSUCBOcU4+kVBSv9+Q73Hkzr8u7y1O8HAyQ8H+b/uCgADxvr/vL19P3rJ9gNB9cO+zsJ/zEl1wPY/RvU9hDT9hHp7bny+fgPzxTr2gYAIxUELg7aCO398+LTpiTULEgL0CPu/P/vEMgd9v3eydoD/B3tF9cN+hHpBhYdQO5O5NEaAuUs6u4HAP0B+RL63zgP9gH7Dt36+AzL6y/9+gv4CQ323yYgzRr3AgX21g/6CQMV4tcL1g4x//7R290N3P3rKwf4ESb23wUO3+cBIPA0NP3oIOcJ2/QFBCwiFQkIGRfOANsK7/IWGNgdtA3uHOzwDRYCyKs8utr88j3Q8PovBTDp8/m7AiXzPfHiDQfr1z4U6+8C6QLU9hIICPYX9P3zNxD4EioF+hHnuELc8P3vBCARytrm6c0QDAfx9xIKBf4QC8zZ4BgD7ugK6gck6vnr8fzw6xL1IBMHw/7m/wbaJhUP9unNDSYRLP36Cf8S7vYcCQ8PEffZ29feBvbz+gYL+O/FHAn3GBT2JQEl6RD29eryIvP+BQ8Ez+4FyO8VFxzuLQsFQvMS8CP9FBr8+gMeA/D26f4IG9z99ha5CN7b8CfqwQ0S4/fy8TII6ObmGckAGhgF7wQOBv0CMPb5yxUO3/3SF/M3CQvXBg/R7/P3Hgz0/iDn+RAVx+XWHPnqLPwZBALxHAoDNw5M+xsG8/Pz4f4JJQgbFR7++wAQ9/ndCg67KQ4o3xcC3/f95TbHAe4Y6A0C6DT7BBolE935ABgZKxAfFNoVGfnvAif18ikAGO/y/iDoAPXYLurcJODs+Sro/97sLQoHvB3BAe0n/iYTCS0WB9cVsPcY7fneHDcQz8/d1CIeCf8V7PcqGRLb5ALo5xrqIgH65Q5IMNjj1Ov3DfcP3gr17efm0gID4PQYHwzx/O7zCPT97xk1Geoz3RUDDB7pDtIHEMTo4QDjBOTpDhojJyQHNRjPAdoV9QMKFyIFGgDpAf36sQvf6A/j4fTvAgcSCAjZADEN/P4VMAXywyYZKPkcDxz7HQn7IPLfCRwgBhL8+hLi4AIQ6x8j/Ob+6Q4ONd4z4yQqO84DHwQWFjLlF/Ax+c4p/fnk/wvw5/UZ97wJE+Uh7hPY5NLw8gLoFfUWJRT5MAkaLxbhVPAJ/hzLzPDc4xvoCObuGdXJGQrJ7O0Q/yfyFNncBvND2P3vA/QVFu76NArw9hH/ECv8Dx8z0gDhGhH88bzr4CT75zLm/hH/7SP/+EcDMwNFAsTzFR/s5vE1FRL7+z4SGxcDO+4B6tnnIPfjDgAW/jTNBM/vFBATF/QO2Q4e4RP3M/ffOt747OMRJRgA3jDcD+wkIiLx+Cw+7+Hv7f3eMdvsHdn9+xYY0eTf5fEK4R349Bo7Afr67dzcTOMK9zj37eIQ8frgDBMIEMcQ8O3iFdnnFRrtDPgQCdcHGP7NzP8K5//1A/Pv/iDfDO7h7/T5NSMs9QTm9/8LDSz16QcFzBoD/OQRF+EAGhLW/QYMBN3lBi3bGNMgA8ITIN0B/gUYDc4m2x3vDQfkEuAD4A8F9B7h6xXRAggTFB8KCvTU0gkEDRkBIt8P8iQAHw/rBf/c3tEKGwXV8jQnDObPENj8/94LHwsV+/7+If/zJO/0BhMaOCAs3STjwNXsLwf69AkTCr/rIxP2GhIOLurY+DEFDvAj5CMJ4vwbxiAwFL0d7ubjA/rpFuXuBRnLGgsW9MH/0fT/DRn48cvsEdcWBBXO/BPd7vAO1+MqCgICCAMoF9bvLyQHDP7nDgseGdITAfISJPUuHAIO6eUFIN76GO3zxiAFzir49uUm6Sb07wRM+gXj/yr+Rf7wJ8rjNO/1D/fDz8f+D9Xezd9IHAjjBRgs89QksOQMCcjzAf8P6joPH+gLPBPa1Boayvr6JMADDKu/GQ7iGCreIQH9Guff/QcMxvgcHOsG8fzm+9vrHhEX7dnqGw3yGuX0+sX2EBICB/EmBRsRHA0k/vjtF/3pxALV8xMDBAERBRAVCfnq4hca4f4LGhHk99HrBSYWGQUKOxbuKfT/HyQA5AXo/uwitxLuGt3t1RosDxvp8wkCGNTlBzY0xgUB4R0LMfPgJwETEQ8HAygDL/IJ9xUfxwk1Ax3oGh4C9zbk2A8ZFxsfKtzmFxoE8OoCFwACD9X/BfD0H0Ec3/z+0ufzCP8rA/YHBf726Or7E/Aj7SDlCugS2xsHDCAIEPng8ezv5Dkk9B0ID//xAQEXD+EPz+8Y3iPw//46BA8pBQ0Y7PoTEQMz+wkMDDw+4BA17vbyNuRIMtvV7CEBIA8q30cvPznoEhP+A94F7QTmLOjWJSbUBesC+An84fPVCPUN1PYLFzXjC9PqzD8u8f7CJAze5xP5KNsByeEk9A4xFwT3+PwEBNTSOQL1DVIbLRw6RBzYLPnuAUrkA/RD3//xAsHbHN3vw+fA2eIiIQ8BNRIr7OT52CIK+wol9R1E3/b4Aebh+fAFCRMQ5cMF3RoR6u3I9TcE8/nF8f7eIuf1/QPe6wst9xMh/SDb+R4Q/+X0DAb69AS0IOAEGkAEGg4ADxXjBSDcz88f7ry2+hkPAwkGNBUqJQ8n++zN4hUa8AILARHLB//lBhYe+fToAOj0IhAOAvTE0wEDxOM3GBnsFBEJJjPJ4izl5uPbGuEb7fPuKDkA8QnW48HZJA4P4RTs7yfwBw0B2BTaEOEZ6gUO7OQB3+QDABwSEezsAx7W3BrmHvfrGjLd6enQIvwWKBAXNfwT4QMj6jUfP/f97QgB6uEfHwrr9CMP5cnbCg=="
      },
      {
        "dims": [
          "64",
          "64",
          "1",
          "1"
        ],
        "data_type": 3,
        "name": "functional_1/conv2d_1/Conv2D",
        "raw_data": "GtkCAe8m8gDg9/8E+ywL++frKfkMBOPODBj66g7o0QkTBuApGzb/Eu4M8Qft/uXt4+bRICT8EwvCBM8Z0vP16/X7/SME4b3mHNfzNfjz5UgBGNIDujcWETLIKNA4CQ4GG+g9NA42CmMb4zz+NOAaWOvXB8Tf3BzvKxsW70qzLwcYHRi0COcTxdkTIekq5xrJMP3oJzrc/eb818EGEvIrBubNEDYVsBLr6NXrBBADGgDyOQY41sYFAP/fCPslAQQw+/8dChH5Aj4MFRH29djp2eni3OI+2wTL8RnO+hbnLi30xgb0IeDbAgUbAQQJAhkw/Nvx6vMh8PzHzNXtBw09FmP1JskTQOWzzD8I+Av0FfIcxMQj0e/TEN4z/hnuC/QZ8VOzGBwI6OD/qQXe89Yu4Pz5Hr/pEMHM9QPiI+PcyBrxHAolyvkIFsrqzgH8+ugL1ebq5hHj+dbuBOrg2urSHybT2vUQPvQL+u3h/yXLGDH+7UDJ+xH33QDL+uMmCcMYCfog+wwNAN4gKAjwJf8m/CLy/iD/AvcqDA8NEgUsBBwmDgcA9CAG8yjh1QgUJwj6GwkG+ggKFwz44fH/NuLtAw3HAsQKFQDIBMILEDnrAev3r+vy2xEg8ecezFj3Eu//Dc8PISUu1dn5098g4S323vHw6wcWN+4K3vXh8+0ACgDJMwX9Hy4EJOUBBLIpJOYA5M7Y/tquIwAQwwEKL/Ll6hXlJfoNATVLDfTG//gKPQ0sATgdCPjQ9RXfD+H77wMMCg7KDBbh3z8JJeUA4d/qCwoKKOkbCw4vv+oS7+NAA9bzAhDQLuUZytvqP/jHBpcEBxsC/CgK3wKrHfs18xks5d3HN6/9DfsK/OQh+P0L0iTE4g/59O8w3erN2O0jLgim+xj9+c7yDxwiFh/4DQIo5ygsHxHGIuP4AMka7+rvMeYn87cSO/4gTwwkBQf32v3o4/Q4JN8mBv/e8w8Y+yHsLPnWuyEF+dPR5tXv2tIf+fXR5P4VQdUSBNvs0hKxI9k08uDECxbUNQX74wMg+NPI/hH1+Tb0y/U/4dbtLPoczkr8EyoHTpAspOru9B31Jq4cMwIW1ubx8CXg1QqbDNzsDeLVESf/Chjr8v0pCifX5A6t7Q8QEB0L0Qz0I+n0ChobCcHt6Pnh2hQUGSwJ2QA3EwXq/CUnAAgsDezmFADt4tT1/+z7Fef5G/Lk4QYPqMjq8/sH/wEAE+8k8PUOzO4KCef0G9742BXU+P3p//3w4gUPGBcf3P7lCvrJ+dYOAPYOvQYKvwomB+8bvB3r5t8ABOUsF+lLANn95hX5Kv7s0uHo+g4XJs4YCBIbS/cVKRH1ww/T2gkm+vPcIfr/E/fM6M/06gTY6+vk/h4jDvnl4O3nAhQXDg/68w7XCvcyDvAcz+0zDw8EDhr7Jg/sEgoSIw0Q7/YCJb7oJubw2Ann+Qnot/HaBA8hPhXZH//M5dnwwC0lzg07/czBDB/z5w/x6Q3oEPr9ySgY3OQ3EBBR/SoG+B/dFCPbCsUH9fUtBuQFANfSz7b7CckuHOb26BInBuPXBTrSRu4S7gz4z+PSnCX+FjHiA/zhz9T73un66sT/+PDsCgkJG9YAyOjj7gYR7Ar0JvL44xfTOdbuBO7qCyMNHRDRBwD/LAAWLg8JEUT0NbIR3CMiy/cc++Tj4fnO/wf5BAz1+SDVySbbMPXXFwIQ0725ANIXtuDpFCsS7Oq/NfYgMvkp/DP53hPw2iasMgMIF/70588g5x0AASYGvRQF/Bm+LRLh+TgWMr4g2s4N8BLoJP3nGf/S++4UCtXj2fsjxwXrAczkSMgJ9+uwAfMIAvED5uAZ7LTdFvrl09r75AHR+wonE0MQEwPR+kH6wd+6/Cka7RsB+v8A6Br6MYH4APn2Eb3S4DHuFPglKhYcAA0AGysDEd7n8i0W2u3b6Az2o/EQ2QrjuQHo9MXCGTLxBhwGIs/jOiLk6CMUDrYhJTYVDfjt5eX/Gy4VR/0MFfb1KOEFU83vPe/1xUP16v4f4BhZ8SYFGwLtAwCoJTAb5AH+AvER4+zdCRXq47rd+Mf1FRsZ5O/2ByAZ6yQc/Q61Efrz+N0X/Qct+RHE7hAb3vD4wvwn/AkV+hroCNj+1SH77932FubBB9r27Qz6MQYhAfClDxoNKxEN7zLq6vnq3eEX5u/0GhPr9hc5/d/vvfQyFxzzJPQztSzf2+slDegeAhXI8QMWAff+7+kU7iwA/OvID78i9RHjGOYJIf338trj4SkS8/YY5ccAEfT9Ax8D8Pr2/gXz7+rZz/vdESPlCAEz+jEYzTsrD9wgGOgKLyMjJNf48/f6HNIdEvkXM/QNDzXi9RQh+TQyBPna9+664+cI/hf0ER3GJOoK/O8G7ivj6eIh9SIQtgXO+yPu1MYoACwfBvb0IsnP/+8YE+cC7CnV9yzkAPHlEv7pIBwvPAHWLB/w188NIx75A/ni8CsRHAMqPQPUyBXj+Bjh3BYd1SDAJewV1vVO293t7vHv8PQFCCHOptwtKAMNN+/uAlok3AvtBurXNUIjQvYl1gne8+vY8yceqMsHKs1k9cYIQNYT/envTOD/AjL9FQP6OhEnNRLy9jffzfvs6toq3M7g+8nayPf17AIkJxMOC+wWMg386wRi/uLKB9/3JupJ19wMMvne/yAX8RLiNx765MkwDwwA9fAaJ/IT20gf+/vUpPTLCv7mEz0JOwYlEOgD9egBBxjY7/7yGNUG4gb9B+YSyRLmvObf8tn9zxX39dEH0/0a8Or9HgIdEQAV/AvUIPTjHuYK+9gPBrES8RH8GxvxEg8a7iQ3Huf2NSbnEcLzHLkcJhcVFhLs++3oBQsV2vvy8t773txDBsPqORoNDRO4LBE7BNnvzRgsHTHHHOrEBPcJ0/ZsEwM2GNXRBA7l1ffCHRjqH9gq7NEY+w33JDUkxukf5K/JANoA1/D2r9YTIQ0/2x7GNzv98OwB7uEZFRfr0wX8+9Xdxaj/27AEF9Pb8Pfh/S3g+QADKNKt6BXQ6xbqFiMk7PQ78wDiCAkAF1MMBc4c+NvHGQcd8h3t3BbtEg/5I+oI9/rU5gD120MM1Dfq19m7xMwp7gcYB/3u/PAW9eECHzPW19YkyMjs0Rbi5uPbCVHoNuABD+cHp9gD4iICDh3uFL75ORUQGTr09er5BvpDEQHc+t3GRvgE8QxMLhUxxywM0tcgQx/YJO4I5+fj3eoSrezR4QA03gzkmAJI7ybxSBP+6xMnByE72Cb78739GMMztx019+T68ZrO/t7J1tctACgVEvvs6QUGvMUG6goB4Qbp8QLm5S73H/gCHRkbE/30BQ0QGSngDj4Y9QvuItspBDX2/TXY7CzwEfoBEzxNBRLp+yArHxfpS+YT6fMT2OZCI/QABecg6f7Xxc448OYG49MABfsX+rsO8yAaMeAXDkOeDgEHId+z6xb+4TIYD93n5jsj9P0X9fCh8+zVkfMSJOZLCzDrRveuCfDQ/iH6Bw7dGeLAAxQUCAvbFQLeEwrA+vFQDctLzM3PNujrPP4Xxvcj58LtZN0O+xjtAfpX7S8jNw0MJUoA1DXqCu4DU9wYE+EKLuro/tRJ1uHRAkYJ9MkPBwPKKAQD+CntL7wFAtv457js9zfqxPQqFtDJPzIA3C3sHbfg3NMF3+owChDmBAPGK/QRKf7QFOHkADoR7NgTD9C77yElGR0L7QHsRfTvA/MIVzkSDCUfvxEZCjEiAfv1Ev08lurX7xro1uX6++nqzT0qNBfS9gyq7OK86A8CwV0V5BHpAvQjFrv7BRzj8dEfv/vwIQUc0g8p3f/C3+IFGTNQ/FEPI//t2wroGbz1HfYT+NL6GrTzCKvtGTT47R8JxPMvwyPi6hwS8/bfzATCPhbmBewuDNMd48Az6jzq/EQR8u8OUvku4w4rHfT+AgrjzwbwCeDM3h7hGBD+DvYo2uPs9uzlDP0J3/fp6/Xr7egZHfj3+vz5GhkUHBf17ssJDOoZAgYGFP4T3EDv8OEgoUEdMc/44wIO8fEY5gADIwH9DiIXEQEh3eqy0tQlzUdCODMm7xEwQyDkHR0O/ST7+cse3OsU0RMSG+PpJM/8+BXyGR0Q9dbvG/HxNf0JOvIHEvP44tcWEObYIvPqPtbM+BAVE8ocI+zi+M8m6+/QCizlzfUlEgYhMSQSAf4WDMEUFq/w/b7l1gUGHwADI706GvS/NBfmQyoYHtQOHObhOdDsFhzyK8TRrTovAAPk6d/Z8Qc4IsniE/z88SPozhLu8eMSCxvfCSMCALfQCAIcEtHw8u3sBQYk1fLjAgT/GuXqGzodrvTaLQULFurr6snQ6tggDDXzJCHj4AfAx+gABNjmC+X6MP4DGBnDzxzuBvlMAx3+5jgACLz4+Mg35tMY7dvxxSPrGiMJ5vUM0wW6vSIB9tX59cz11Tgk7fTL5ckBKxAK7ijj9c7w6cgKuu4J+BrtBtnu1jPW7/cd8+jZyQY3ESQ35ewWIOv98fgBIvhI6CgOGgvy+Q4OGgH+6iL8DZwi7e/2HCQX7AQh+/YgHNwzNvvP8/v2DzAs7g4BKwAQA/LvGdzB/xfE8N7c/fgSIPno8hoS+DX6GF3M7xA5GqM9zP3yVt4lwtwU+WXh+CEF3BolHFPf0uwL3gssx9wpNqf12+HTAOwQ8jULMfTM7vM6v0qjCasKGxEEo1ckSv7ovdbbLw3uAgDfHhLiBqE2LwfcEBjwDd7CC9oJKxH9MDCv/QcNEPYZyOUFQhIsuhMcHuYlrAfx+FrNGBgDyufYDwn8E/cH0Asb7/7l0ubyHifNCNolERQS2M71CN8NCBIZGx4V+fAbDiAW+vrNGuzPDM7qy/Yf7Cvl5AAe4Rom6tgj6gsj6vbxIPPKvvbq6/kE9fTQ3+fZCsGy6QQ64CEUCQvgNvvdCyn3Hf4J7s/0HwASHSQi38wd/OcszSD7/hP2TB/90x7jCSvy4wIQ5SPo8wbAEL8G9d74Ef/7COfhBtbb8Borzxz5wdbmEP4AAfMl7hn5HQwV2DIAFfDs3h3Y9Dz9GMrn8SDrBQbtKAf26Rnc9BIW/+LiGPX/7CsTFtsbARYZFO7mHgAt0d73DvwT5zsO9OgC8PDCHuHXKPga/9YKFvj469EowUDf+wICFaUxGPfvFuzUGucBEtHu/wf87fIQ5AAt8gcTLRkLQiIH/xAvJeH6FwgZ/BQS/90eDAT6BTTQxUQvDgkT6O4UzhX5Aw4ZvA0avQHXBvbXFvUQ+Qfm2v0nEA0dxxbTHQgRHhIvQxYvHiAK8R9DtiYq6DImGtbs6w/sKiDsGMsGFwE5uRgvDavs2cbcQxirxwIR6P9S2cHQJB1A4QUmMi8B3Rjv6Qm+LTDjLwAK7ORXUt8N0Pfy1QQq4hY30hzg/97C0dPkLe+0093n+Q8t3+A73wcnPwftuQryF0UqzuQrvN8gKQUlCh4GIuMqDA=="
      },
      {
        "dims": [
          "64",
          "1",
          "10",
          "4"
        ],
        "data_type": 3,
        "name": "functional_1/conv2d/Conv2D",
