{
  "irVersion": 9,
  "opsetImport": [
    {
      "version": 17
    }
  ],
  "graph": {
    "name": "Graph",
    "initializer": [
      {
        "name": "init_carry",
        "dataType": 1,
        "dims": [
          8
        ],
        "floatData": [
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0
        ]
      },
      {
        "name": "init_carry_1",
        "dataType": 1,
        "dims": [
          8
        ],
        "floatData": [
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0
        ]
      }
    ],
    "node": [
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "trip_count_0"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "trip_count_0",
              "dataType": 7,
              "dims": [],
              "int64Data": [
                24
              ]
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "cond_0"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "cond_0",
              "dataType": 9,
              "dims": [],
              "int32Data": [
                1
              ]
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "reshape_shape_0"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "reshape_shape_0",
              "dataType": 7,
              "dims": [
                2
              ],
              "int64Data": [
                2,
                4
              ]
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "trip_count_1"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "trip_count_1",
              "dataType": 7,
              "dims": [],
              "int64Data": [
                8
              ]
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "cond_1"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "cond_1",
              "dataType": 9,
              "dims": [],
              "int32Data": [
                1
              ]
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "reshape_shape_1"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "reshape_shape_1",
              "dataType": 7,
              "dims": [
                2
              ],
              "int64Data": [
                4,
                2
              ]
            }
          }
        ]
      },
      {
        "opType": "Loop",
        "input": [
          "trip_count_0",
          "cond_0",
          "init_carry"
        ],
        "output": [
          "loop_out"
        ],
        "attribute": [
          {
            "name": "body",
            "type": 5,
            "g": {
              "name": "loop_body_0",
              "initializer": [],
              "node": [
                {
                  "opType": "Constant",
                  "input": [],
                  "output": [
                    "axes"
                  ],
                  "attribute": [
                    {
                      "name": "value",
                      "type": 4,
                      "t": {
                        "name": "axes",
                        "dataType": 7,
                        "dims": [
                          1
                        ],
                        "int64Data": [
                          0
                        ]
                      }
                    }
                  ]
                },
                {
                  "opType": "Constant",
                  "input": [],
                  "output": [
                    "KN_0"
                  ],
                  "attribute": [
                    {
                      "name": "value",
                      "type": 4,
                      "t": {
                        "name": "KN_0",
                        "dataType": 7,
                        "dims": [],
                        "int64Data": [
                          12
                        ]
                      }
                    }
                  ]
                },
                {
                  "opType": "Constant",
                  "input": [],
                  "output": [
                    "K_0"
                  ],
                  "attribute": [
                    {
                      "name": "value",
                      "type": 4,
                      "t": {
                        "name": "K_0",
                        "dataType": 7,
                        "dims": [],
                        "int64Data": [
                          3
                        ]
                      }
                    }
                  ]
                },
                {
                  "opType": "Constant",
                  "input": [],
                  "output": [
                    "N_0"
                  ],
                  "attribute": [
                    {
                      "name": "value",
                      "type": 4,
                      "t": {
                        "name": "N_0",
                        "dataType": 7,
                        "dims": [],
                        "int64Data": [
                          4
                        ]
                      }
                    }
                  ]
                },
                {
                  "opType": "Constant",
                  "input": [],
                  "output": [
                    "fixshape_a_vec_0"
                  ],
                  "attribute": [
                    {
                      "name": "value",
                      "type": 4,
                      "t": {
                        "name": "fixshape_a_vec_0",
                        "dataType": 7,
                        "dims": [
                          1
                        ],
                        "int64Data": [
                          3
                        ]
                      }
                    }
                  ]
                },
                {
                  "opType": "Constant",
                  "input": [],
                  "output": [
                    "fixshape_b_vec_0"
                  ],
                  "attribute": [
                    {
                      "name": "value",
                      "type": 4,
                      "t": {
                        "name": "fixshape_b_vec_0",
                        "dataType": 7,
                        "dims": [
                          1
                        ],
                        "int64Data": [
                          3
                        ]
                      }
                    }
                  ]
                },
                {
                  "opType": "Div",
                  "input": [
                    "iter",
                    "KN_0"
                  ],
                  "output": [
                    "Div_i_0_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Mod",
                  "input": [
                    "iter",
                    "KN_0"
                  ],
                  "output": [
                    "Mod_rem_0_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Div",
                  "input": [
                    "Mod_rem_0_out",
                    "K_0"
                  ],
                  "output": [
                    "Div_j_0_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Mod",
                  "input": [
                    "Mod_rem_0_out",
                    "K_0"
                  ],
                  "output": [
                    "Mod_k_0_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Unsqueeze",
                  "input": [
                    "Div_i_0_out",
                    "axes"
                  ],
                  "output": [
                    "iU_0_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Unsqueeze",
                  "input": [
                    "Div_j_0_out",
                    "axes"
                  ],
                  "output": [
                    "jU_0_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Unsqueeze",
                  "input": [
                    "Mod_k_0_out",
                    "axes"
                  ],
                  "output": [
                    "kU_0_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Mul",
                  "input": [
                    "Div_i_0_out",
                    "N_0"
                  ],
                  "output": [
                    "iMulN_out_0"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Add",
                  "input": [
                    "iMulN_out_0",
                    "Div_j_0_out"
                  ],
                  "output": [
                    "flat_out_0"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Unsqueeze",
                  "input": [
                    "flat_out_0",
                    "axes"
                  ],
                  "output": [
                    "flatU_0_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Gather",
                  "input": [
                    "A",
                    "iU_0_out"
                  ],
                  "output": [
                    "a_row_out_0"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Reshape",
                  "input": [
                    "a_row_out_0",
                    "fixshape_a_vec_0"
                  ],
                  "output": [
                    "reshaped_a_vec_0"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Gather",
                  "input": [
                    "reshaped_a_vec_0",
                    "kU_0_out"
                  ],
                  "output": [
                    "a_scalar_0"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Squeeze",
                  "input": [
                    "a_scalar_0",
                    "axes"
                  ],
                  "output": [
                    "sq_a_sq_0_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Gather",
                  "input": [
                    "B",
                    "jU_0_out"
                  ],
                  "output": [
                    "b_col_out_0"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 1,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Reshape",
                  "input": [
                    "b_col_out_0",
                    "fixshape_b_vec_0"
                  ],
                  "output": [
                    "reshaped_b_vec_0"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Gather",
                  "input": [
                    "reshaped_b_vec_0",
                    "kU_0_out"
                  ],
                  "output": [
                    "b_scalar_0"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Squeeze",
                  "input": [
                    "b_scalar_0",
                    "axes"
                  ],
                  "output": [
                    "sq_b_sq_0_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Mul",
                  "input": [
                    "sq_a_sq_0_out",
                    "sq_b_sq_0_out"
                  ],
                  "output": [
                    "prod_0"
                  ],
                  "attribute": []
                },
                {
                  "opType": "GatherElements",
                  "input": [
                    "carry",
                    "flatU_0_out"
                  ],
                  "output": [
                    "prev_out_0"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Squeeze",
                  "input": [
                    "prev_out_0",
                    "axes"
                  ],
                  "output": [
                    "sq_prev_sq_0_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Add",
                  "input": [
                    "sq_prev_sq_0_out",
                    "prod_0"
                  ],
                  "output": [
                    "acc_out_0"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Unsqueeze",
                  "input": [
                    "acc_out_0",
                    "axes"
                  ],
                  "output": [
                    "updateUnsq_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "ScatterElements",
                  "input": [
                    "carry",
                    "flatU_0_out",
                    "updateUnsq_out"
                  ],
                  "output": [
                    "carry_out"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Identity",
                  "input": [
                    "cond_in"
                  ],
                  "output": [
                    "cond_out"
                  ],
                  "attribute": []
                }
              ],
              "input": [
                {
                  "name": "iter",
                  "type": {
                    "tensorType": {
                      "elemType": 7,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "cond_in",
                  "type": {
                    "tensorType": {
                      "elemType": 9,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "carry",
                  "type": {
                    "tensorType": {
                      "elemType": 1,
                      "shape": {
                        "dim": [
                          {
                            "dimValue": 8
                          }
                        ]
                      }
                    }
                  }
                }
              ],
              "output": [
                {
                  "name": "cond_out",
                  "type": {
                    "tensorType": {
                      "elemType": 9,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "carry_out",
                  "type": {
                    "tensorType": {
                      "elemType": 1,
                      "shape": {
                        "dim": [
                          {
                            "dimValue": 8
                          }
                        ]
                      }
                    }
                  }
                }
              ],
              "valueInfo": [
                {
                  "name": "cond_out",
                  "type": {
                    "tensorType": {
                      "elemType": 9,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "carry_out",
                  "type": {
                    "tensorType": {
                      "elemType": 1,
                      "shape": {
                        "dim": [
                          {
                            "dimValue": 8
                          }
                        ]
                      }
                    }
                  }
                }
              ]
            }
          }
        ]
      },
      {
        "opType": "Reshape",
        "input": [
          "loop_out",
          "reshape_shape_0"
        ],
        "output": [
          "M"
        ],
        "attribute": []
      },
      {
        "opType": "Loop",
        "input": [
          "trip_count_1",
          "cond_1",
          "init_carry_1"
        ],
        "output": [
          "loop_out_1"
        ],
        "attribute": [
          {
            "name": "body",
            "type": 5,
            "g": {
              "name": "loop_body_0",
              "initializer": [],
              "node": [
                {
                  "opType": "Constant",
                  "input": [],
                  "output": [
                    "axes_1"
                  ],
                  "attribute": [
                    {
                      "name": "value",
                      "type": 4,
                      "t": {
                        "name": "axes_1",
                        "dataType": 7,
                        "dims": [
                          1
                        ],
                        "int64Data": [
                          0
                        ]
                      }
                    }
                  ]
                },
                {
                  "opType": "Constant",
                  "input": [],
                  "output": [
                    "mr_dim_tp_1_1"
                  ],
                  "attribute": [
                    {
                      "name": "value",
                      "type": 4,
                      "t": {
                        "name": "mr_dim_tp_1_1",
                        "dataType": 7,
                        "dims": [],
                        "int64Data": [
                          2
                        ]
                      }
                    }
                  ]
                },
                {
                  "opType": "Constant",
                  "input": [],
                  "output": [
                    "mr_dim_tp_1_0"
                  ],
                  "attribute": [
                    {
                      "name": "value",
                      "type": 4,
                      "t": {
                        "name": "mr_dim_tp_1_0",
                        "dataType": 7,
                        "dims": [],
                        "int64Data": [
                          4
                        ]
                      }
                    }
                  ]
                },
                {
                  "opType": "Constant",
                  "input": [],
                  "output": [
                    "lin_zero_tp_lin_1"
                  ],
                  "attribute": [
                    {
                      "name": "value",
                      "type": 4,
                      "t": {
                        "name": "lin_zero_tp_lin_1",
                        "dataType": 7,
                        "dims": [],
                        "int64Data": [
                          0
                        ]
                      }
                    }
                  ]
                },
                {
                  "opType": "Constant",
                  "input": [],
                  "output": [
                    "lin_stride_tp_lin_1_0"
                  ],
                  "attribute": [
                    {
                      "name": "value",
                      "type": 4,
                      "t": {
                        "name": "lin_stride_tp_lin_1_0",
                        "dataType": 7,
                        "dims": [],
                        "int64Data": [
                          4
                        ]
                      }
                    }
                  ]
                },
                {
                  "opType": "Constant",
                  "input": [],
                  "output": [
                    "lin_stride_tp_lin_1_1"
                  ],
                  "attribute": [
                    {
                      "name": "value",
                      "type": 4,
                      "t": {
                        "name": "lin_stride_tp_lin_1_1",
                        "dataType": 7,
                        "dims": [],
                        "int64Data": [
                          1
                        ]
                      }
                    }
                  ]
                },
                {
                  "opType": "Constant",
                  "input": [],
                  "output": [
                    "flat_shape_M"
                  ],
                  "attribute": [
                    {
                      "name": "value",
                      "type": 4,
                      "t": {
                        "name": "flat_shape_M",
                        "dataType": 7,
                        "dims": [
                          1
                        ],
                        "int64Data": [
                          8
                        ]
                      }
                    }
                  ]
                },
                {
                  "opType": "Unsqueeze",
                  "input": [
                    "iter_1",
                    "axes_1"
                  ],
                  "output": [
                    "unsq_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Mod",
                  "input": [
                    "iter_1",
                    "mr_dim_tp_1_1"
                  ],
                  "output": [
                    "mr_mod_out_tp_1_1"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Div",
                  "input": [
                    "iter_1",
                    "mr_dim_tp_1_1"
                  ],
                  "output": [
                    "mr_div_out_tp_1_1"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Mod",
                  "input": [
                    "mr_div_out_tp_1_1",
                    "mr_dim_tp_1_0"
                  ],
                  "output": [
                    "mr_mod_out_tp_1_0"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Div",
                  "input": [
                    "mr_div_out_tp_1_1",
                    "mr_dim_tp_1_0"
                  ],
                  "output": [
                    "mr_div_out_tp_1_0"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Mul",
                  "input": [
                    "mr_mod_out_tp_1_1",
                    "lin_stride_tp_lin_1_0"
                  ],
                  "output": [
                    "lin_mul_out_tp_lin_1_0"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Add",
                  "input": [
                    "lin_zero_tp_lin_1",
                    "lin_mul_out_tp_lin_1_0"
                  ],
                  "output": [
                    "lin_add_out_tp_lin_1_0"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Mul",
                  "input": [
                    "mr_mod_out_tp_1_0",
                    "lin_stride_tp_lin_1_1"
                  ],
                  "output": [
                    "lin_mul_out_tp_lin_1_1"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Add",
                  "input": [
                    "lin_add_out_tp_lin_1_0",
                    "lin_mul_out_tp_lin_1_1"
                  ],
                  "output": [
                    "lin_add_out_tp_lin_1_1"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Unsqueeze",
                  "input": [
                    "lin_add_out_tp_lin_1_1",
                    "axes_1"
                  ],
                  "output": [
                    "tp_linU_1_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Reshape",
                  "input": [
                    "M",
                    "flat_shape_M"
                  ],
                  "output": [
                    "M_flat"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Gather",
                  "input": [
                    "M_flat",
                    "tp_linU_1_out"
                  ],
                  "output": [
                    "tp_g_1_out"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Squeeze",
                  "input": [
                    "tp_g_1_out",
                    "axes_1"
                  ],
                  "output": [
                    "sq_tp_sq_1_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Unsqueeze",
                  "input": [
                    "sq_tp_sq_1_out",
                    "axes_1"
                  ],
                  "output": [
                    "updateUnsq_out_1"
                  ],
                  "attribute": []
                },
                {
                  "opType": "ScatterElements",
                  "input": [
                    "carry_1",
                    "unsq_out",
                    "updateUnsq_out_1"
                  ],
                  "output": [
                    "carry_out_1"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Identity",
                  "input": [
                    "cond_in_1"
                  ],
                  "output": [
                    "cond_out_1"
                  ],
                  "attribute": []
                }
              ],
              "input": [
                {
                  "name": "iter_1",
                  "type": {
                    "tensorType": {
                      "elemType": 7,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "cond_in_1",
                  "type": {
                    "tensorType": {
                      "elemType": 9,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "carry_1",
                  "type": {
                    "tensorType": {
                      "elemType": 1,
                      "shape": {
                        "dim": [
                          {
                            "dimValue": 8
                          }
                        ]
                      }
                    }
                  }
                }
              ],
              "output": [
                {
                  "name": "cond_out_1",
                  "type": {
                    "tensorType": {
                      "elemType": 9,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "carry_out_1",
                  "type": {
                    "tensorType": {
                      "elemType": 1,
                      "shape": {
                        "dim": [
                          {
                            "dimValue": 8
                          }
                        ]
                      }
                    }
                  }
                }
              ],
              "valueInfo": [
                {
                  "name": "cond_out_1",
                  "type": {
                    "tensorType": {
                      "elemType": 9,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "carry_out_1",
                  "type": {
                    "tensorType": {
                      "elemType": 1,
                      "shape": {
                        "dim": [
                          {
                            "dimValue": 8
                          }
                        ]
                      }
                    }
                  }
                }
              ]
            }
          }
        ]
      },
      {
        "opType": "Reshape",
        "input": [
          "loop_out_1",
          "reshape_shape_1"
        ],
        "output": [
          "Z"
        ],
        "attribute": []
      }
    ],
    "input": [
      {
        "name": "A",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": 2
                },
                {
                  "dimValue": 3
                }
              ]
            }
          }
        }
      },
      {
        "name": "B",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": 3
                },
                {
                  "dimValue": 4
                }
              ]
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "Z",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": 4
                },
                {
                  "dimValue": 2
                }
              ]
            }
          }
        }
      }
    ]
  }
}