{
  "irVersion": 9,
  "opsetImport": [
    {
      "version": 17
    }
  ],
  "graph": {
    "name": "Graph",
    "initializer": [],
    "node": [
      {
        "opType": "MatMul",
        "input": [
          "X",
          "A"
        ],
        "output": [
          "XA"
        ],
        "attribute": []
      },
      {
        "opType": "Add",
        "input": [
          "B",
          "XA"
        ],
        "output": [
          "Y"
        ],
        "attribute": []
      }
    ],
    "input": [
      {
        "name": "X",
        "type": {
          "tensorType": {
            "elemType": 6,
            "shape": {
              "dim": [
                {
                  "dimValue": 3
                },
                {
                  "dimValue": 1
                }
              ]
            }
          }
        }
      },
      {
        "name": "A",
        "type": {
          "tensorType": {
            "elemType": 6,
            "shape": {
              "dim": [
                {
                  "dimValue": 1
                },
                {
                  "dimValue": 3
                }
              ]
            }
          }
        }
      },
      {
        "name": "B",
        "type": {
          "tensorType": {
            "elemType": 6,
            "shape": {
              "dim": [
                {
                  "dimValue": 3
                },
                {
                  "dimValue": 3
                }
              ]
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "Y",
        "type": {
          "tensorType": {
            "elemType": 6,
            "shape": {
              "dim": [
                {
                  "dimValue": 3
                },
                {
                  "dimValue": 3
                }
              ]
            }
          }
        }
      }
    ]
  }
}