{
  "irVersion": 9,
  "opsetImport": [
    {
      "version": 17
    }
  ],
  "graph": {
    "name": "Graph",
    "initializer": [
      {
        "name": "init_carry",
        "dataType": 1,
        "dims": [
          4
        ],
        "floatData": [
          0,
          0,
          0,
          0
        ]
      }
    ],
    "node": [
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "reshape_shape_0"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "reshape_shape_0",
              "dataType": 7,
              "dims": [
                2
              ],
              "int64Data": [
                2,
                2
              ]
            }
          }
        ]
      },
      {
        "opType": "Loop",
        "input": [
          "trip_count_0",
          "cond_0",
          "init_carry"
        ],
        "output": [
          "loop_out"
        ],
        "attribute": [
          {
            "name": "body",
            "type": 5,
            "g": {
              "name": "loop_body",
              "initializer": [],
              "node": [
                {
                  "opType": "Constant",
                  "input": [],
                  "output": [
                    "axes"
                  ],
                  "attribute": [
                    {
                      "name": "value",
                      "type": 4,
                      "t": {
                        "name": "axes",
                        "dataType": 7,
                        "dims": [
                          1
                        ],
                        "int64Data": [
                          0
                        ]
                      }
                    }
                  ]
                },
                {
                  "opType": "Constant",
                  "input": [],
                  "output": [
                    "N_0"
                  ],
                  "attribute": [
                    {
                      "name": "value",
                      "type": 4,
                      "t": {
                        "name": "N_0",
                        "dataType": 7,
                        "dims": [],
                        "int64Data": [
                          2
                        ]
                      }
                    }
                  ]
                },
                {
                  "opType": "Constant",
                  "input": [],
                  "output": [
                    "shape1_0"
                  ],
                  "attribute": [
                    {
                      "name": "value",
                      "type": 4,
                      "t": {
                        "name": "shape1_0",
                        "dataType": 7,
                        "dims": [
                          1
                        ],
                        "int64Data": [
                          1
                        ]
                      }
                    }
                  ]
                },
                {
                  "opType": "Constant",
                  "input": [],
                  "output": [
                    "shapeK_0"
                  ],
                  "attribute": [
                    {
                      "name": "value",
                      "type": 4,
                      "t": {
                        "name": "shapeK_0",
                        "dataType": 7,
                        "dims": [
                          1
                        ],
                        "int64Data": [
                          2
                        ]
                      }
                    }
                  ]
                },
                {
                  "opType": "Unsqueeze",
                  "input": [
                    "iter",
                    "axes"
                  ],
                  "output": [
                    "unsq_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Div",
                  "input": [
                    "iter",
                    "N_0"
                  ],
                  "output": [
                    "Div_0_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Mod",
                  "input": [
                    "iter",
                    "N_0"
                  ],
                  "output": [
                    "Mod_0_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Unsqueeze",
                  "input": [
                    "Div_0_out",
                    "axes"
                  ],
                  "output": [
                    "rowU_0_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Unsqueeze",
                  "input": [
                    "Mod_0_out",
                    "axes"
                  ],
                  "output": [
                    "colU_0_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Gather",
                  "input": [
                    "A",
                    "rowU_0_out"
                  ],
                  "output": [
                    "g_A_0_out"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Gather",
                  "input": [
                    "B",
                    "colU_0_out"
                  ],
                  "output": [
                    "g_B_0_out"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 1,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Reshape",
                  "input": [
                    "g_A_0_out",
                    "shapeK_0"
                  ],
                  "output": [
                    "reshaped_reshapeRow_0"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Reshape",
                  "input": [
                    "g_B_0_out",
                    "shapeK_0"
                  ],
                  "output": [
                    "reshaped_reshapeCol_0"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Mul",
                  "input": [
                    "reshaped_reshapeRow_0",
                    "reshaped_reshapeCol_0"
                  ],
                  "output": [
                    "mul_out_0"
                  ],
                  "attribute": []
                },
                {
                  "opType": "ReduceSum",
                  "input": [
                    "mul_out_0",
                    "axes"
                  ],
                  "output": [
                    "reduce_out_0"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Reshape",
                  "input": [
                    "reduce_out_0",
                    "shape1_0"
                  ],
                  "output": [
                    "final_out_0"
                  ],
                  "attribute": []
                },
                {
                  "opType": "ScatterElements",
                  "input": [
                    "carry",
                    "unsq_out",
                    "final_out_0"
                  ],
                  "output": [
                    "carry_out"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Identity",
                  "input": [
                    "cond_in"
                  ],
                  "output": [
                    "cond_out"
                  ],
                  "attribute": []
                }
              ],
              "input": [
                {
                  "name": "iter",
                  "type": {
                    "tensorType": {
                      "elemType": 7,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "cond_in",
                  "type": {
                    "tensorType": {
                      "elemType": 9,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "carry",
                  "type": {
                    "tensorType": {
                      "elemType": 1,
                      "shape": {
                        "dim": [
                          {
                            "dimValue": 4
                          }
                        ]
                      }
                    }
                  }
                }
              ],
              "output": [
                {
                  "name": "cond_out",
                  "type": {
                    "tensorType": {
                      "elemType": 9,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "carry_out",
                  "type": {
                    "tensorType": {
                      "elemType": 1,
                      "shape": {
                        "dim": [
                          {
                            "dimValue": 4
                          }
                        ]
                      }
                    }
                  }
                }
              ],
              "valueInfo": [
                {
                  "name": "cond_out",
                  "type": {
                    "tensorType": {
                      "elemType": 9,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "carry_out",
                  "type": {
                    "tensorType": {
                      "elemType": 1,
                      "shape": {
                        "dim": [
                          {
                            "dimValue": 4
                          }
                        ]
                      }
                    }
                  }
                }
              ]
            }
          }
        ]
      },
      {
        "opType": "Reshape",
        "input": [
          "loop_out",
          "reshape_shape_0"
        ],
        "output": [
          "Y"
        ],
        "attribute": []
      }
    ],
    "input": [
      {
        "name": "A",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": 2
                },
                {
                  "dimValue": 2
                }
              ]
            }
          }
        }
      },
      {
        "name": "B",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": 2
                },
                {
                  "dimValue": 2
                }
              ]
            }
          }
        }
      },
      {
        "name": "trip_count_0",
        "type": {
          "tensorType": {
            "elemType": 7,
            "shape": {
              "dim": []
            }
          }
        }
      },
      {
        "name": "cond_0",
        "type": {
          "tensorType": {
            "elemType": 9,
            "shape": {
              "dim": []
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "Y",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": 2
                },
                {
                  "dimValue": 2
                }
              ]
            }
          }
        }
      }
    ]
  }
}