{
  "irVersion": 9,
  "opsetImport": [
    {
      "version": 17
    }
  ],
  "graph": {
    "name": "Graph",
    "initializer": [
      {
        "name": "init_carry",
        "dataType": 6,
        "dims": [
          9
        ],
        "floatData": [],
        "int32Data": [],
        "stringData": [],
        "int64Data": [],
        "doubleData": [],
        "uint64Data": [],
        "externalData": [],
        "rawData": {
          "type": "Buffer",
          "data": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
          ]
        }
      },
      {
        "name": "final_shape",
        "dataType": 7,
        "dims": [
          2
        ],
        "floatData": [],
        "int32Data": [],
        "stringData": [],
        "int64Data": [],
        "doubleData": [],
        "uint64Data": [],
        "externalData": [],
        "rawData": {
          "type": "Buffer",
          "data": [
            3,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            3,
            0,
            0,
            0,
            0,
            0,
            0,
            0
          ]
        }
      }
    ],
    "node": [
      {
        "opType": "Loop",
        "input": [
          "trip_count",
          "cond",
          "init_carry"
        ],
        "output": [
          "Y_flat"
        ],
        "attribute": [
          {
            "name": "body",
            "type": 5,
            "g": {
              "name": "loop_body",
              "initializer": [
                {
                  "name": "axes0",
                  "dataType": 7,
                  "dims": [
                    1
                  ],
                  "floatData": [],
                  "int32Data": [],
                  "stringData": [],
                  "int64Data": [],
                  "doubleData": [],
                  "uint64Data": [],
                  "externalData": [],
                  "rawData": {
                    "type": "Buffer",
                    "data": [
                      0,
                      0,
                      0,
                      0,
                      0,
                      0,
                      0,
                      0
                    ]
                  }
                },
                {
                  "name": "N",
                  "dataType": 7,
                  "dims": [],
                  "floatData": [],
                  "int32Data": [],
                  "stringData": [],
                  "int64Data": [],
                  "doubleData": [],
                  "uint64Data": [],
                  "externalData": [],
                  "rawData": {
                    "type": "Buffer",
                    "data": [
                      3,
                      0,
                      0,
                      0,
                      0,
                      0,
                      0,
                      0
                    ]
                  }
                },
                {
                  "name": "shape1",
                  "dataType": 7,
                  "dims": [
                    1
                  ],
                  "floatData": [],
                  "int32Data": [],
                  "stringData": [],
                  "int64Data": [],
                  "doubleData": [],
                  "uint64Data": [],
                  "externalData": [],
                  "rawData": {
                    "type": "Buffer",
                    "data": [
                      1,
                      0,
                      0,
                      0,
                      0,
                      0,
                      0,
                      0
                    ]
                  }
                }
              ],
              "node": [
                {
                  "opType": "Unsqueeze",
                  "input": [
                    "i",
                    "axes0"
                  ],
                  "output": [
                    "i_unsqueezed"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Div",
                  "input": [
                    "i",
                    "N"
                  ],
                  "output": [
                    "row"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Mod",
                  "input": [
                    "i",
                    "N"
                  ],
                  "output": [
                    "col"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Unsqueeze",
                  "input": [
                    "row",
                    "axes0"
                  ],
                  "output": [
                    "row_idx"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Unsqueeze",
                  "input": [
                    "col",
                    "axes0"
                  ],
                  "output": [
                    "col_idx"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Gather",
                  "input": [
                    "X",
                    "row_idx"
                  ],
                  "output": [
                    "x_val"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Reshape",
                  "input": [
                    "x_val",
                    "shape1"
                  ],
                  "output": [
                    "x_scalar"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Gather",
                  "input": [
                    "A",
                    "col_idx"
                  ],
                  "output": [
                    "a_val"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 1,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Reshape",
                  "input": [
                    "a_val",
                    "shape1"
                  ],
                  "output": [
                    "a_scalar"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Mul",
                  "input": [
                    "x_scalar",
                    "a_scalar"
                  ],
                  "output": [
                    "dot"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Gather",
                  "input": [
                    "B",
                    "row_idx"
                  ],
                  "output": [
                    "b_row"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Gather",
                  "input": [
                    "b_row",
                    "col_idx"
                  ],
                  "output": [
                    "b_val"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 1,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Reshape",
                  "input": [
                    "b_val",
                    "shape1"
                  ],
                  "output": [
                    "b_scalar"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Add",
                  "input": [
                    "dot",
                    "b_scalar"
                  ],
                  "output": [
                    "sum_val"
                  ],
                  "attribute": []
                },
                {
                  "opType": "ScatterElements",
                  "input": [
                    "carry",
                    "i_unsqueezed",
                    "sum_val"
                  ],
                  "output": [
                    "carry_out"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Identity",
                  "input": [
                    "cond_in"
                  ],
                  "output": [
                    "cond_out"
                  ],
                  "attribute": []
                }
              ],
              "input": [
                {
                  "name": "i",
                  "type": {
                    "tensorType": {
                      "elemType": 7,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "cond_in",
                  "type": {
                    "tensorType": {
                      "elemType": 9,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "carry",
                  "type": {
                    "tensorType": {
                      "elemType": 6,
                      "shape": {
                        "dim": [
                          {
                            "dimValue": 9
                          }
                        ]
                      }
                    }
                  }
                }
              ],
              "output": [
                {
                  "name": "cond_out",
                  "type": {
                    "tensorType": {
                      "elemType": 9,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "carry_out",
                  "type": {
                    "tensorType": {
                      "elemType": 6,
                      "shape": {
                        "dim": [
                          {
                            "dimValue": 9
                          }
                        ]
                      }
                    }
                  }
                }
              ],
              "valueInfo": [
                {
                  "name": "cond_out",
                  "type": {
                    "tensorType": {
                      "elemType": 9,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "carry_out",
                  "type": {
                    "tensorType": {
                      "elemType": 6,
                      "shape": {
                        "dim": [
                          {
                            "dimValue": 9
                          }
                        ]
                      }
                    }
                  }
                }
              ]
            }
          }
        ]
      },
      {
        "opType": "Reshape",
        "input": [
          "Y_flat",
          "final_shape"
        ],
        "output": [
          "Y"
        ],
        "attribute": []
      }
    ],
    "input": [
      {
        "name": "X",
        "type": {
          "tensorType": {
            "elemType": 6,
            "shape": {
              "dim": [
                {
                  "dimValue": 3
                },
                {
                  "dimValue": 1
                }
              ]
            }
          }
        }
      },
      {
        "name": "A",
        "type": {
          "tensorType": {
            "elemType": 6,
            "shape": {
              "dim": [
                {
                  "dimValue": 1
                },
                {
                  "dimValue": 3
                }
              ]
            }
          }
        }
      },
      {
        "name": "B",
        "type": {
          "tensorType": {
            "elemType": 6,
            "shape": {
              "dim": [
                {
                  "dimValue": 3
                },
                {
                  "dimValue": 3
                }
              ]
            }
          }
        }
      },
      {
        "name": "trip_count",
        "type": {
          "tensorType": {
            "elemType": 7,
            "shape": {
              "dim": []
            }
          }
        }
      },
      {
        "name": "cond",
        "type": {
          "tensorType": {
            "elemType": 9,
            "shape": {
              "dim": []
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "Y",
        "type": {
          "tensorType": {
            "elemType": 6,
            "shape": {
              "dim": [
                {
                  "dimValue": 3
                },
                {
                  "dimValue": 3
                }
              ]
            }
          }
        }
      }
    ]
  }
}