{"irVersion":9,"opsetImport":[{"version":19}],"graph":{"name":"Graph","initializer":[{"name":"scale","dataType":1,"dims":[],"floatData":[0.5],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[]},{"name":"zero_point","dataType":3,"dims":[],"floatData":[],"int32Data":[10],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[]}],"node":[{"opType":"Constant","input":[],"output":["QL_Zf_const_0"],"attribute":[{"name":"value","type":4,"t":{"name":"QL_Zf_const_0","dataType":1,"dims":[],"floatData":[10]}}]},{"opType":"Div","input":["X","scale"],"output":["QL_DivOut_0"],"attribute":[]},{"opType":"Round","input":["QL_DivOut_0"],"output":["QL_RoundOut_0"],"attribute":[]},{"opType":"Add","input":["QL_RoundOut_0","QL_Zf_const_0"],"output":["QL_AddOut_0"],"attribute":[]},{"opType":"Max","input":["QL_AddOut_0","QL_min_0"],"output":["clip_max_out_QL_Clip_0"],"attribute":[]},{"opType":"Min","input":["clip_max_out_QL_Clip_0","QL_max_0"],"output":["QL_ClipOut_0"],"attribute":[]},{"opType":"Cast","input":["QL_ClipOut_0"],"output":["Y"],"attribute":[{"name":"to","i":3,"type":2}]}],"input":[{"name":"X","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":1},{"dimValue":3},{"dimValue":4},{"dimValue":4}]}}}}],"output":[{"name":"Y","type":{"tensorType":{"elemType":3,"shape":{"dim":[{"dimValue":1},{"dimValue":3},{"dimValue":4},{"dimValue":4}]}}}}]}}