{"irVersion":9,"opsetImport":[{"version":19}],"graph":{"name":"Graph","initializer":[],"node":[{"opType":"Constant","input":[],"output":["rd_init_out_0"],"attribute":[{"name":"value","type":4,"t":{"name":"rd_init_out_0","dataType":1,"dims":[8],"floatData":[3.4028235e+38,3.4028235e+38,3.4028235e+38,3.4028235e+38,3.4028235e+38,3.4028235e+38,3.4028235e+38,3.4028235e+38]}}]},{"opType":"Constant","input":[],"output":["trip_count_0"],"attribute":[{"name":"value","type":4,"t":{"name":"trip_count_0","dataType":7,"dims":[],"int64Data":[24]}}]},{"opType":"Constant","input":[],"output":["cond_0"],"attribute":[{"name":"value","type":4,"t":{"name":"cond_0","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["reshape_shape_0"],"attribute":[{"name":"value","type":4,"t":{"name":"reshape_shape_0","dataType":7,"dims":[3],"int64Data":[2,1,4]}}]},{"opType":"Loop","input":["trip_count_0","cond_0","rd_init_out_0"],"output":["loop_out"],"attribute":[{"name":"body","type":5,"g":{"name":"loop_body_0","initializer":[],"node":[{"opType":"Constant","input":[],"output":["axes_0"],"attribute":[{"name":"value","type":4,"t":{"name":"axes_0","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["flat_shape_X"],"attribute":[{"name":"value","type":4,"t":{"name":"flat_shape_X","dataType":7,"dims":[1],"int64Data":[-1]}}]},{"opType":"Constant","input":[],"output":["mr_dim_rd_0_2"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_rd_0_2","dataType":7,"dims":[],"int64Data":[4]}}]},{"opType":"Constant","input":[],"output":["mr_dim_rd_0_1"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_rd_0_1","dataType":7,"dims":[],"int64Data":[3]}}]},{"opType":"Constant","input":[],"output":["mr_dim_rd_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_rd_0_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["lin_zero_rd_inlin_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_rd_inlin_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_rd_inlin_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_rd_inlin_0_0","dataType":7,"dims":[],"int64Data":[12]}}]},{"opType":"Constant","input":[],"output":["lin_stride_rd_inlin_0_1"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_rd_inlin_0_1","dataType":7,"dims":[],"int64Data":[4]}}]},{"opType":"Constant","input":[],"output":["lin_stride_rd_inlin_0_2"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_rd_inlin_0_2","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["rd_zero_0_1"],"attribute":[{"name":"value","type":4,"t":{"name":"rd_zero_0_1","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_zero_rd_outlin_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_rd_outlin_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_rd_outlin_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_rd_outlin_0_0","dataType":7,"dims":[],"int64Data":[4]}}]},{"opType":"Constant","input":[],"output":["lin_stride_rd_outlin_0_1"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_rd_outlin_0_1","dataType":7,"dims":[],"int64Data":[4]}}]},{"opType":"Constant","input":[],"output":["lin_stride_rd_outlin_0_2"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_rd_outlin_0_2","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Reshape","input":["X","flat_shape_X"],"output":["X_flat"],"attribute":[]},{"opType":"Mod","input":["iter","mr_dim_rd_0_2"],"output":["mr_mod_out_rd_0_2"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_rd_0_2"],"output":["mr_div_out_rd_0_2"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_rd_0_2","mr_dim_rd_0_1"],"output":["mr_mod_out_rd_0_1"],"attribute":[]},{"opType":"Div","input":["mr_div_out_rd_0_2","mr_dim_rd_0_1"],"output":["mr_div_out_rd_0_1"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_rd_0_1","mr_dim_rd_0_0"],"output":["mr_mod_out_rd_0_0"],"attribute":[]},{"opType":"Div","input":["mr_div_out_rd_0_1","mr_dim_rd_0_0"],"output":["mr_div_out_rd_0_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_rd_0_0","lin_stride_rd_inlin_0_0"],"output":["lin_mul_out_rd_inlin_0_0"],"attribute":[]},{"opType":"Add","input":["lin_zero_rd_inlin_0","lin_mul_out_rd_inlin_0_0"],"output":["lin_add_out_rd_inlin_0_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_rd_0_1","lin_stride_rd_inlin_0_1"],"output":["lin_mul_out_rd_inlin_0_1"],"attribute":[]},{"opType":"Add","input":["lin_add_out_rd_inlin_0_0","lin_mul_out_rd_inlin_0_1"],"output":["lin_add_out_rd_inlin_0_1"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_rd_0_2","lin_stride_rd_inlin_0_2"],"output":["lin_mul_out_rd_inlin_0_2"],"attribute":[]},{"opType":"Add","input":["lin_add_out_rd_inlin_0_1","lin_mul_out_rd_inlin_0_2"],"output":["lin_add_out_rd_inlin_0_2"],"attribute":[]},{"opType":"Unsqueeze","input":["lin_add_out_rd_inlin_0_2","axes_0"],"output":["rd_inlinU_0_out"],"attribute":[]},{"opType":"Gather","input":["X_flat","rd_inlinU_0_out"],"output":["gather_x_out_0"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Squeeze","input":["gather_x_out_0","axes_0"],"output":["sq_x_sq_0_out"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_rd_0_0","lin_stride_rd_outlin_0_0"],"output":["lin_mul_out_rd_outlin_0_0"],"attribute":[]},{"opType":"Add","input":["lin_zero_rd_outlin_0","lin_mul_out_rd_outlin_0_0"],"output":["lin_add_out_rd_outlin_0_0"],"attribute":[]},{"opType":"Mul","input":["rd_zero_0_1","lin_stride_rd_outlin_0_1"],"output":["lin_mul_out_rd_outlin_0_1"],"attribute":[]},{"opType":"Add","input":["lin_add_out_rd_outlin_0_0","lin_mul_out_rd_outlin_0_1"],"output":["lin_add_out_rd_outlin_0_1"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_rd_0_2","lin_stride_rd_outlin_0_2"],"output":["lin_mul_out_rd_outlin_0_2"],"attribute":[]},{"opType":"Add","input":["lin_add_out_rd_outlin_0_1","lin_mul_out_rd_outlin_0_2"],"output":["lin_add_out_rd_outlin_0_2"],"attribute":[]},{"opType":"Unsqueeze","input":["lin_add_out_rd_outlin_0_2","axes_0"],"output":["rd_outlinU_0_out"],"attribute":[]},{"opType":"Gather","input":["carry","rd_outlinU_0_out"],"output":["acc_prev_out_0"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Squeeze","input":["acc_prev_out_0","axes_0"],"output":["sq_acc_sq_0_out"],"attribute":[]},{"opType":"Min","input":["sq_acc_sq_0_out","sq_x_sq_0_out"],"output":["min_out_0"],"attribute":[]},{"opType":"Unsqueeze","input":["min_out_0","axes_0"],"output":["combined_unsq_0_out"],"attribute":[]},{"opType":"Identity","input":["cond_in"],"output":["cond_out"],"attribute":[]},{"opType":"ScatterElements","input":["carry","rd_outlinU_0_out","combined_unsq_0_out"],"output":["carry_out"],"attribute":[{"name":"axis","i":0,"type":2}]}],"input":[{"name":"iter","type":{"tensorType":{"elemType":7,"shape":{"dim":[]}}}},{"name":"cond_in","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":8}]}}}}],"output":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":8}]}}}}],"valueInfo":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":8}]}}}},{"name":"X","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}}]}}]},{"opType":"Reshape","input":["loop_out","reshape_shape_0"],"output":["Y"],"attribute":[]}],"input":[{"name":"X","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":2},{"dimValue":3},{"dimValue":4}]}}}}],"output":[{"name":"Y","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":2},{"dimValue":1},{"dimValue":4}]}}}}]}}