{"irVersion":9,"opsetImport":[{"version":19}],"graph":{"name":"Graph","initializer":[{"name":"Di_Divcst","dataType":1,"dims":[1],"floatData":[2.933396339416504],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[]},{"name":"Di_Divcst1","dataType":1,"dims":[378,1],"floatData":[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,204,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,243,244,245,246,247,248,249,250,251,252,253,254,255,256,257,258,259,260,261,262,263,264,265,266,267,268,269,270,271,272,273,274,275,276,277,278,279,280,281,282,283,284,285,286,287,288,289,290,291,292,293,294,295,296,297,298,299,300,301,302,303,304,305,306,307,308,309,310,311,312,313,314,315,316,317,318,319,320,321,322,323,324,325,326,327,328,329,330,331,332,333,334,335,336,337,338,339,340,341,342,343,344,345,346,347,348,349,350,351,352,353,354,355,356,357,358,359,360,361,362,363,364,365,366,367,368,369,370,371,372,373,374,375,376,377,378],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[]},{"name":"kgpd_Mulcst","dataType":1,"dims":[1],"floatData":[0.5],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[]},{"name":"gpr_MatMulcst","dataType":1,"dims":[378],"floatData":[0.5068034529685974,0.41766712069511414,0.3074251711368561,0.19363658130168915,0.0833035260438919,-0.02360154502093792,-0.12307439744472504,-0.19820812344551086,-0.22205917537212372,-0.17343167960643768,-0.055730897933244705,0.0959232822060585,0.22782501578330994,0.2951969802379608,0.2861133813858032,0.22412775456905365,0.1463986337184906,0.07325135171413422,-0.00640857731923461,-0.1205245852470398,-0.2805367410182953,0.5853432416915894,0.47304007411003113,0.31856653094291687,0.16717681288719177,0.03717118874192238,-0.0740405023097992,-0.17035523056983948,-0.24032649397850037,-0.2572706937789917,-0.1973409801721573,-0.0627446398139,0.10819638520479202,0.2546508312225342,0.3244982361793518,0.30326956510543823,0.22054575383663177,0.1284037083387375,0.06670577824115753,0.040288861840963364,0.024466058239340782,-0.006480197422206402,0.36298710107803345,0.3235810697078705,0.22781841456890106,0.11057359725236893,-0.0076418668031692505,-0.11982939392328262,-0.21990737318992615,-0.2901102602481842,-0.3013896048069,-0.2301204353570938,-0.0804084986448288,0.1058930903673172,0.2629827857017517,0.3338393568992615,0.3022453486919403,0.20277024805545807,0.10103966295719147,0.05650407448410988,0.09172749519348145,0.1872103214263916,0.3026989996433258,0.08701194822788239,0.1364622712135315,0.1162957102060318,0.04602465033531189,-0.0533892959356308,-0.1642170548439026,-0.2681099772453308,-0.33941078186035156,-0.3466241955757141,-0.26712217926979065,-0.10717713087797165,0.08901208639144897,0.25305745005607605,0.3252773880958557,0.2882489562034607,0.1795676201581955,0.07430507242679596,0.04659826681017876,0.13283303380012512,0.3174470067024231,0.547950804233551,-0.15206962823867798,-0.021891452372074127,0.029608942568302155,0.005656396504491568,-0.07477226108312607,-0.18535524606704712,-0.2961874008178711,-0.3732491731643677,-0.3819204270839691,-0.3002544641494751,-0.13642993569374084,0.06390843540430069,0.23154722154140472,0.3060556948184967,0.26941895484924316,0.16002285480499268,0.05647222325205803,0.03878870606422424,0.14846453070640564,0.36978578567504883,0.642369270324707,-0.27149656414985657,-0.09254671633243561,0.006106628570705652,0.01481702458113432,-0.052176352590322495,-0.16527290642261505,-0.28703245520591736,-0.3762718141078949,-0.39443862438201904,-0.3189639151096344,-0.15890178084373474,0.03957431763410568,0.20759637653827667,0.2852040231227875,0.25398772954940796,0.15067294239997864,0.0510413758456707,0.031247269362211227,0.12809467315673828,0.3214307427406311,0.5489004254341125,-0.23283256590366364,-0.052390553057193756,0.05564228817820549,0.07530997693538666,0.013717731460928917,-0.10335787385702133,-0.2374592423439026,-0.3433208465576172,-0.3782976269721985,-0.3174620270729065,-0.16885317862033844,0.022307539358735085,0.1884981095790863,0.27057188749313354,0.24881359934806824,0.15525208413600922,0.05718965083360672,0.019522149115800858,0.06817694008350372,0.17778940498828888,0.29158148169517517,-0.05450516566634178,0.0767720490694046,0.15311186015605927,0.16015489399433136,0.09665986895561218,-0.02228526771068573,-0.1647091507911682,-0.2860201597213745,-0.3406924903392792,-0.3000392019748688,-0.16851331293582916,0.012064537964761257,0.1768459975719452,0.2670324742794037,0.2591262459754944,0.17638131976127625,0.0730920284986496,-0.00024006834428291768,-0.028196608647704124,-0.03610723093152046,-0.06572284549474716,0.20648805797100067,0.24432271718978882,0.25229865312576294,0.2254648357629776,0.15481747686862946,0.03982940688729286,-0.10097936540842056,-0.22950387001037598,-0.3001725971698761,-0.2800952196121216,-0.1673709601163864,0.0028942092321813107,0.1704132854938507,0.2758241295814514,0.28808078169822693,0.2165948450565338,0.09903550148010254,-0.027837753295898438,-0.15283417701721191,-0.29064416885375977,-0.4570644497871399,0.48984813690185547,0.4013321101665497,0.3122497797012329,0.23402102291584015,0.15226569771766663,0.048550643026828766,-0.07740803807973862,-0.19986888766288757,-0.2771798372268677,-0.2729426324367523,-0.1766197383403778,-0.01313228253275156,0.1640419363975525,0.2942185699939728,0.3349260091781616,0.27664729952812195,0.13741834461688995,-0.05759434401988983,-0.29319489002227783,-0.5615313649177551,-0.842006266117096,0.7596385478973389,0.5251652002334595,0.319733589887619,0.17672644555568695,0.07984312623739243,-0.0071871234104037285,-0.10657567530870438,-0.20961511135101318,-0.2825140655040741,-0.28688591718673706,-0.20241576433181763,-0.041272617876529694,0.15194019675254822,0.3152451515197754,0.3924556076526642,0.3517535924911499,0.18936529755592346,-0.07994566857814789,-0.4317528009414673,-0.8280539512634277,-1.2053213119506836,1.0068142414093018,0.6226688027381897,0.2937179207801819,0.07858892530202866,-0.0375785194337368,-0.10707135498523712,-0.17446185648441315,-0.2502303123474121,-0.31101107597351074,-0.31818416714668274,-0.24207033216953278,-0.08136045932769775,0.1294892132282257,0.32842034101486206,0.44626936316490173,0.42902377247810364,0.2506662607192993,-0.08517275005578995,-0.5456563830375671,-1.0635019540786743,-1.5331861972808838,1.2287217378616333,0.7120524644851685,0.2697811722755432,-0.014694935642182827,-0.15251252055168152,-0.20863784849643707,-0.24724356830120087,-0.2966924011707306,-0.34432071447372437,-0.3527733385562897,-0.28502124547958374,-0.127788245677948,0.0947105884552002,0.3226763904094696,0.4781572222709656,0.4893951117992401,0.31056058406829834,-0.06743838638067245,-0.6096811294555664,-1.2294352054595947,-1.7893375158309937,1.4054988622665405,0.7987972497940063,0.27558544278144836,-0.06137983873486519,-0.21860413253307343,-0.26863282918930054,-0.288989782333374,-0.3210518956184387,-0.36083099246025085,-0.3733440339565277,-0.3175106346607208,-0.17152227461338043,0.049555569887161255,0.2911207973957062,0.473178893327713,0.5143772959709167,0.3548423945903778,-0.02753128670156002,-0.6040460467338562,-1.283814787864685,-1.9154577255249023,1.4956140518188477,0.864568829536438,0.313787579536438,-0.044731125235557556,-0.21293891966342926,-0.2640007734298706,-0.27959710359573364,-0.30670520663261414,-0.3465708792209625,-0.3674786686897278,-0.3282633125782013,-0.20305120944976807,0.00030311508453451097,0.2351171225309372,0.42677995562553406,0.4941520094871521,0.37159526348114014,0.0265826266258955,-0.5244913101196289,-1.2017031908035278,-1.860363483428955,1.4569077491760254,0.8773674368858337,0.36259573698043823,0.02121935784816742,-0.1446177214384079,-0.20076724886894226,-0.22275373339653015,-0.2551676630973816,-0.30095741152763367,-0.3325633406639099,-0.3125636577606201,-0.21539027988910675,-0.04395350441336632,0.16472582519054413,0.3474608063697815,0.432142049074173,0.35613346099853516,0.08179809898138046,-0.38814491033554077,-0.9947012662887573,-1.6173242330551147,1.2776137590408325,0.8143762350082397,0.3915140628814697,0.10271832346916199,-0.04631191864609718,-0.10721393674612045,-0.14067690074443817,-0.18258191645145416,-0.2350710779428482,-0.27558499574661255,-0.2733244299888611,-0.20632708072662354,-0.07465783506631851,0.09466752409934998,0.25312620401382446,0.3433215916156769,0.31252521276474,0.12423402816057205,-0.22943337261676788,-0.7130667567253113,-1.2397477626800537,0.9923652410507202,0.6795511245727539,0.38014036417007446,0.1656709611415863,0.044613104313611984,-0.016969211399555206,-0.06061476841568947,-0.1105172336101532,-0.16659121215343475,-0.2106943130493164,-0.21864458918571472,-0.1735420674085617,-0.0769842118024826,0.04658462107181549,0.1564919650554657,0.21224257349967957,0.19174174964427948,0.10109826177358627,-0.02929464355111122,-0.15919147431850433,-0.25472161173820496],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[]},{"name":"gpr_Mulcst","dataType":1,"dims":[1],"floatData":[0.22262731194496155],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[]},{"name":"gpr_Addcst","dataType":1,"dims":[1],"floatData":[-1.1438995599746704],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[]},{"name":"Re_Reshapecst","dataType":7,"dims":[2],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[-1,1],"doubleData":[],"uint64Data":[],"externalData":[]},{"name":"init_carry","dataType":1,"dims":[2],"floatData":[0,0]},{"name":"init_carry_1","dataType":1,"dims":[378],"floatData":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]},{"name":"init_carry_2","dataType":1,"dims":[756],"floatData":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]},{"name":"init_carry_3","dataType":1,"dims":[756],"floatData":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]},{"name":"init_carry_4","dataType":1,"dims":[756],"floatData":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]},{"name":"init_carry_5","dataType":1,"dims":[2],"floatData":[0,0]},{"name":"init_carry_6","dataType":1,"dims":[2],"floatData":[0,0]},{"name":"init_carry_7","dataType":1,"dims":[2],"floatData":[0,0]}],"node":[{"opType":"Constant","input":[],"output":["cond_9"],"attribute":[{"name":"value","type":4,"t":{"name":"cond_9","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["cond_6"],"attribute":[{"name":"value","type":4,"t":{"name":"cond_6","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["cond_0"],"attribute":[{"name":"value","type":4,"t":{"name":"cond_0","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["reshape_shape_0"],"attribute":[{"name":"value","type":4,"t":{"name":"reshape_shape_0","dataType":7,"dims":[2],"int64Data":[2,1]}}]},{"opType":"Constant","input":[],"output":["cond_1"],"attribute":[{"name":"value","type":4,"t":{"name":"cond_1","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["cond_3"],"attribute":[{"name":"value","type":4,"t":{"name":"cond_3","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["trip_count_0"],"attribute":[{"name":"value","type":4,"t":{"name":"trip_count_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["cond_7"],"attribute":[{"name":"value","type":4,"t":{"name":"cond_7","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["cond_8"],"attribute":[{"name":"value","type":4,"t":{"name":"cond_8","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["trip_count_1"],"attribute":[{"name":"value","type":4,"t":{"name":"trip_count_1","dataType":7,"dims":[],"int64Data":[378]}}]},{"opType":"Constant","input":[],"output":["reshape_shape_1"],"attribute":[{"name":"value","type":4,"t":{"name":"reshape_shape_1","dataType":7,"dims":[2],"int64Data":[378,1]}}]},{"opType":"Constant","input":[],"output":["trip_count_3"],"attribute":[{"name":"value","type":4,"t":{"name":"trip_count_3","dataType":7,"dims":[],"int64Data":[756]}}]},{"opType":"Constant","input":[],"output":["cond_4"],"attribute":[{"name":"value","type":4,"t":{"name":"cond_4","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["reshape_shape_3"],"attribute":[{"name":"value","type":4,"t":{"name":"reshape_shape_3","dataType":7,"dims":[2],"int64Data":[2,378]}}]},{"opType":"Constant","input":[],"output":["trip_count_4"],"attribute":[{"name":"value","type":4,"t":{"name":"trip_count_4","dataType":7,"dims":[],"int64Data":[756]}}]},{"opType":"Constant","input":[],"output":["reshape_shape_4"],"attribute":[{"name":"value","type":4,"t":{"name":"reshape_shape_4","dataType":7,"dims":[2],"int64Data":[2,378]}}]},{"opType":"Constant","input":[],"output":["trip_count_6"],"attribute":[{"name":"value","type":4,"t":{"name":"trip_count_6","dataType":7,"dims":[],"int64Data":[756]}}]},{"opType":"Constant","input":[],"output":["reshape_shape_6"],"attribute":[{"name":"value","type":4,"t":{"name":"reshape_shape_6","dataType":7,"dims":[2],"int64Data":[2,378]}}]},{"opType":"Constant","input":[],"output":["trip_count_7"],"attribute":[{"name":"value","type":4,"t":{"name":"trip_count_7","dataType":7,"dims":[],"int64Data":[756]}}]},{"opType":"Constant","input":[],"output":["reshape_shape_7"],"attribute":[{"name":"value","type":4,"t":{"name":"reshape_shape_7","dataType":7,"dims":[2],"int64Data":[2,1]}}]},{"opType":"Constant","input":[],"output":["trip_count_8"],"attribute":[{"name":"value","type":4,"t":{"name":"trip_count_8","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["trip_count_9"],"attribute":[{"name":"value","type":4,"t":{"name":"trip_count_9","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["reshape_shape_9"],"attribute":[{"name":"value","type":4,"t":{"name":"reshape_shape_9","dataType":7,"dims":[2],"int64Data":[2,1]}}]},{"opType":"Loop","input":["trip_count_0","cond_0","init_carry"],"output":["loop_out"],"attribute":[{"name":"body","type":5,"g":{"name":"loop_body_0","initializer":[],"node":[{"opType":"Constant","input":[],"output":["axes"],"attribute":[{"name":"value","type":4,"t":{"name":"axes","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_input_0_1"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_input_0_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_input_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_input_0_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["gb_zero_input_0_1"],"attribute":[{"name":"value","type":4,"t":{"name":"gb_zero_input_0_1","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_zero_gb_lin_input_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_gb_lin_input_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_input_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_input_0_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_input_0_1"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_input_0_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["flat_shape_input"],"attribute":[{"name":"value","type":4,"t":{"name":"flat_shape_input","dataType":7,"dims":[1],"int64Data":[-1]}}]},{"opType":"Constant","input":[],"output":["sg_len_idx_gb_lin_input_0"],"attribute":[{"name":"value","type":4,"t":{"name":"sg_len_idx_gb_lin_input_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_Di_Divcst_0_1"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_Di_Divcst_0_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_Di_Divcst_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_Di_Divcst_0_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["gb_zero_Di_Divcst_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"gb_zero_Di_Divcst_0_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_zero_gb_lin_Di_Divcst_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_gb_lin_Di_Divcst_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_Di_Divcst_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_Di_Divcst_0_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["sg_len_idx_gb_lin_Di_Divcst_0"],"attribute":[{"name":"value","type":4,"t":{"name":"sg_len_idx_gb_lin_Di_Divcst_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Unsqueeze","input":["iter","axes"],"output":["unsq_out"],"attribute":[]},{"opType":"Mod","input":["iter","mr_dim_gb_out_input_0_1"],"output":["mr_mod_out_gb_out_input_0_1"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_gb_out_input_0_1"],"output":["mr_div_out_gb_out_input_0_1"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_input_0_1","mr_dim_gb_out_input_0_0"],"output":["mr_mod_out_gb_out_input_0_0"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_input_0_1","mr_dim_gb_out_input_0_0"],"output":["mr_div_out_gb_out_input_0_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_input_0_0","lin_stride_gb_lin_input_0_0"],"output":["lin_mul_out_gb_lin_input_0_0"],"attribute":[]},{"opType":"Add","input":["lin_zero_gb_lin_input_0","lin_mul_out_gb_lin_input_0_0"],"output":["lin_add_out_gb_lin_input_0_0"],"attribute":[]},{"opType":"Mul","input":["gb_zero_input_0_1","lin_stride_gb_lin_input_0_1"],"output":["lin_mul_out_gb_lin_input_0_1"],"attribute":[]},{"opType":"Add","input":["lin_add_out_gb_lin_input_0_0","lin_mul_out_gb_lin_input_0_1"],"output":["lin_add_out_gb_lin_input_0_1"],"attribute":[]},{"opType":"Reshape","input":["input","flat_shape_input"],"output":["input_flat"],"attribute":[]},{"opType":"Shape","input":["input_flat"],"output":["sg_shape_out_gb_lin_input_0"],"attribute":[]},{"opType":"Gather","input":["sg_shape_out_gb_lin_input_0","sg_len_idx_gb_lin_input_0"],"output":["sg_len_gb_lin_input_0_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["lin_add_out_gb_lin_input_0_1","sg_len_gb_lin_input_0_out"],"output":["Mod_sg_mod_gb_lin_input_0_out"],"attribute":[]},{"opType":"Unsqueeze","input":["Mod_sg_mod_gb_lin_input_0_out","axes"],"output":["sg_idx_unsq_gb_lin_input_0_out"],"attribute":[]},{"opType":"Gather","input":["input_flat","sg_idx_unsq_gb_lin_input_0_out"],"output":["sg_g_gb_lin_input_0_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["iter","mr_dim_gb_out_Di_Divcst_0_1"],"output":["mr_mod_out_gb_out_Di_Divcst_0_1"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_gb_out_Di_Divcst_0_1"],"output":["mr_div_out_gb_out_Di_Divcst_0_1"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_Di_Divcst_0_1","mr_dim_gb_out_Di_Divcst_0_0"],"output":["mr_mod_out_gb_out_Di_Divcst_0_0"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_Di_Divcst_0_1","mr_dim_gb_out_Di_Divcst_0_0"],"output":["mr_div_out_gb_out_Di_Divcst_0_0"],"attribute":[]},{"opType":"Mul","input":["gb_zero_Di_Divcst_0_0","lin_stride_gb_lin_Di_Divcst_0_0"],"output":["lin_mul_out_gb_lin_Di_Divcst_0_0"],"attribute":[]},{"opType":"Add","input":["lin_zero_gb_lin_Di_Divcst_0","lin_mul_out_gb_lin_Di_Divcst_0_0"],"output":["lin_add_out_gb_lin_Di_Divcst_0_0"],"attribute":[]},{"opType":"Shape","input":["Di_Divcst"],"output":["sg_shape_out_gb_lin_Di_Divcst_0"],"attribute":[]},{"opType":"Gather","input":["sg_shape_out_gb_lin_Di_Divcst_0","sg_len_idx_gb_lin_Di_Divcst_0"],"output":["sg_len_gb_lin_Di_Divcst_0_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["lin_add_out_gb_lin_Di_Divcst_0_0","sg_len_gb_lin_Di_Divcst_0_out"],"output":["Mod_sg_mod_gb_lin_Di_Divcst_0_out"],"attribute":[]},{"opType":"Unsqueeze","input":["Mod_sg_mod_gb_lin_Di_Divcst_0_out","axes"],"output":["sg_idx_unsq_gb_lin_Di_Divcst_0_out"],"attribute":[]},{"opType":"Gather","input":["Di_Divcst","sg_idx_unsq_gb_lin_Di_Divcst_0_out"],"output":["sg_g_gb_lin_Di_Divcst_0_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Squeeze","input":["sg_g_gb_lin_input_0_out","axes"],"output":["sq_0_in0_scalar_out"],"attribute":[]},{"opType":"Squeeze","input":["sg_g_gb_lin_Di_Divcst_0_out","axes"],"output":["sq_0_in1_scalar_out"],"attribute":[]},{"opType":"Div","input":["sq_0_in0_scalar_out","sq_0_in1_scalar_out"],"output":["0_out"],"attribute":[]},{"opType":"Unsqueeze","input":["0_out","axes"],"output":["updateUnsq_out"],"attribute":[]},{"opType":"Identity","input":["cond_in"],"output":["cond_out"],"attribute":[]},{"opType":"ScatterElements","input":["carry","unsq_out","updateUnsq_out"],"output":["carry_out"],"attribute":[{"name":"axis","i":0,"type":2}]}],"input":[{"name":"iter","type":{"tensorType":{"elemType":7,"shape":{"dim":[]}}}},{"name":"cond_in","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":2}]}}}}],"output":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":2}]}}}}],"valueInfo":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":2}]}}}},{"name":"input","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}},{"name":"Di_Divcst","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}}]}}]},{"opType":"Loop","input":["trip_count_1","cond_1","init_carry_1"],"output":["loop_out_1"],"attribute":[{"name":"body","type":5,"g":{"name":"loop_body_0","initializer":[],"node":[{"opType":"Constant","input":[],"output":["axes"],"attribute":[{"name":"value","type":4,"t":{"name":"axes","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_Di_Divcst1_1_1"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_Di_Divcst1_1_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_Di_Divcst1_1_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_Di_Divcst1_1_0","dataType":7,"dims":[],"int64Data":[378]}}]},{"opType":"Constant","input":[],"output":["gb_zero_Di_Divcst1_1_1"],"attribute":[{"name":"value","type":4,"t":{"name":"gb_zero_Di_Divcst1_1_1","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_zero_gb_lin_Di_Divcst1_1"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_gb_lin_Di_Divcst1_1","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_Di_Divcst1_1_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_Di_Divcst1_1_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_Di_Divcst1_1_1"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_Di_Divcst1_1_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["flat_shape_Di_Divcst1"],"attribute":[{"name":"value","type":4,"t":{"name":"flat_shape_Di_Divcst1","dataType":7,"dims":[1],"int64Data":[-1]}}]},{"opType":"Constant","input":[],"output":["sg_len_idx_gb_lin_Di_Divcst1_1"],"attribute":[{"name":"value","type":4,"t":{"name":"sg_len_idx_gb_lin_Di_Divcst1_1","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_Di_Divcst_1_1"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_Di_Divcst_1_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_Di_Divcst_1_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_Di_Divcst_1_0","dataType":7,"dims":[],"int64Data":[378]}}]},{"opType":"Constant","input":[],"output":["gb_zero_Di_Divcst_1_0"],"attribute":[{"name":"value","type":4,"t":{"name":"gb_zero_Di_Divcst_1_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_zero_gb_lin_Di_Divcst_1"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_gb_lin_Di_Divcst_1","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_Di_Divcst_1_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_Di_Divcst_1_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["sg_len_idx_gb_lin_Di_Divcst_1"],"attribute":[{"name":"value","type":4,"t":{"name":"sg_len_idx_gb_lin_Di_Divcst_1","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Unsqueeze","input":["iter","axes"],"output":["unsq_out"],"attribute":[]},{"opType":"Mod","input":["iter","mr_dim_gb_out_Di_Divcst1_1_1"],"output":["mr_mod_out_gb_out_Di_Divcst1_1_1"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_gb_out_Di_Divcst1_1_1"],"output":["mr_div_out_gb_out_Di_Divcst1_1_1"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_Di_Divcst1_1_1","mr_dim_gb_out_Di_Divcst1_1_0"],"output":["mr_mod_out_gb_out_Di_Divcst1_1_0"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_Di_Divcst1_1_1","mr_dim_gb_out_Di_Divcst1_1_0"],"output":["mr_div_out_gb_out_Di_Divcst1_1_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_Di_Divcst1_1_0","lin_stride_gb_lin_Di_Divcst1_1_0"],"output":["lin_mul_out_gb_lin_Di_Divcst1_1_0"],"attribute":[]},{"opType":"Add","input":["lin_zero_gb_lin_Di_Divcst1_1","lin_mul_out_gb_lin_Di_Divcst1_1_0"],"output":["lin_add_out_gb_lin_Di_Divcst1_1_0"],"attribute":[]},{"opType":"Mul","input":["gb_zero_Di_Divcst1_1_1","lin_stride_gb_lin_Di_Divcst1_1_1"],"output":["lin_mul_out_gb_lin_Di_Divcst1_1_1"],"attribute":[]},{"opType":"Add","input":["lin_add_out_gb_lin_Di_Divcst1_1_0","lin_mul_out_gb_lin_Di_Divcst1_1_1"],"output":["lin_add_out_gb_lin_Di_Divcst1_1_1"],"attribute":[]},{"opType":"Reshape","input":["Di_Divcst1","flat_shape_Di_Divcst1"],"output":["Di_Divcst1_flat"],"attribute":[]},{"opType":"Shape","input":["Di_Divcst1_flat"],"output":["sg_shape_out_gb_lin_Di_Divcst1_1"],"attribute":[]},{"opType":"Gather","input":["sg_shape_out_gb_lin_Di_Divcst1_1","sg_len_idx_gb_lin_Di_Divcst1_1"],"output":["sg_len_gb_lin_Di_Divcst1_1_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["lin_add_out_gb_lin_Di_Divcst1_1_1","sg_len_gb_lin_Di_Divcst1_1_out"],"output":["Mod_sg_mod_gb_lin_Di_Divcst1_1_out"],"attribute":[]},{"opType":"Unsqueeze","input":["Mod_sg_mod_gb_lin_Di_Divcst1_1_out","axes"],"output":["sg_idx_unsq_gb_lin_Di_Divcst1_1_out"],"attribute":[]},{"opType":"Gather","input":["Di_Divcst1_flat","sg_idx_unsq_gb_lin_Di_Divcst1_1_out"],"output":["sg_g_gb_lin_Di_Divcst1_1_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["iter","mr_dim_gb_out_Di_Divcst_1_1"],"output":["mr_mod_out_gb_out_Di_Divcst_1_1"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_gb_out_Di_Divcst_1_1"],"output":["mr_div_out_gb_out_Di_Divcst_1_1"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_Di_Divcst_1_1","mr_dim_gb_out_Di_Divcst_1_0"],"output":["mr_mod_out_gb_out_Di_Divcst_1_0"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_Di_Divcst_1_1","mr_dim_gb_out_Di_Divcst_1_0"],"output":["mr_div_out_gb_out_Di_Divcst_1_0"],"attribute":[]},{"opType":"Mul","input":["gb_zero_Di_Divcst_1_0","lin_stride_gb_lin_Di_Divcst_1_0"],"output":["lin_mul_out_gb_lin_Di_Divcst_1_0"],"attribute":[]},{"opType":"Add","input":["lin_zero_gb_lin_Di_Divcst_1","lin_mul_out_gb_lin_Di_Divcst_1_0"],"output":["lin_add_out_gb_lin_Di_Divcst_1_0"],"attribute":[]},{"opType":"Shape","input":["Di_Divcst"],"output":["sg_shape_out_gb_lin_Di_Divcst_1"],"attribute":[]},{"opType":"Gather","input":["sg_shape_out_gb_lin_Di_Divcst_1","sg_len_idx_gb_lin_Di_Divcst_1"],"output":["sg_len_gb_lin_Di_Divcst_1_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["lin_add_out_gb_lin_Di_Divcst_1_0","sg_len_gb_lin_Di_Divcst_1_out"],"output":["Mod_sg_mod_gb_lin_Di_Divcst_1_out"],"attribute":[]},{"opType":"Unsqueeze","input":["Mod_sg_mod_gb_lin_Di_Divcst_1_out","axes"],"output":["sg_idx_unsq_gb_lin_Di_Divcst_1_out"],"attribute":[]},{"opType":"Gather","input":["Di_Divcst","sg_idx_unsq_gb_lin_Di_Divcst_1_out"],"output":["sg_g_gb_lin_Di_Divcst_1_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Squeeze","input":["sg_g_gb_lin_Di_Divcst1_1_out","axes"],"output":["sq_1_in0_scalar_out"],"attribute":[]},{"opType":"Squeeze","input":["sg_g_gb_lin_Di_Divcst_1_out","axes"],"output":["sq_1_in1_scalar_out"],"attribute":[]},{"opType":"Div","input":["sq_1_in0_scalar_out","sq_1_in1_scalar_out"],"output":["1_out"],"attribute":[]},{"opType":"Unsqueeze","input":["1_out","axes"],"output":["updateUnsq_out"],"attribute":[]},{"opType":"Identity","input":["cond_in"],"output":["cond_out"],"attribute":[]},{"opType":"ScatterElements","input":["carry","unsq_out","updateUnsq_out"],"output":["carry_out"],"attribute":[{"name":"axis","i":0,"type":2}]}],"input":[{"name":"iter","type":{"tensorType":{"elemType":7,"shape":{"dim":[]}}}},{"name":"cond_in","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":378}]}}}}],"output":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":378}]}}}}],"valueInfo":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":378}]}}}},{"name":"Di_Divcst1","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}},{"name":"Di_Divcst","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}}]}}]},{"opType":"Reshape","input":["loop_out","reshape_shape_0"],"output":["Di_C0"],"attribute":[]},{"opType":"Reshape","input":["loop_out_1","reshape_shape_1"],"output":["Di_C02"],"attribute":[]},{"opType":"Scan","input":["Di_C0","Di_C02"],"output":["UU004UU","UU005UU"],"attribute":[{"name":"num_scan_inputs","i":1,"type":2},{"name":"body","type":5,"g":{"name":"scan_body_0","initializer":[{"name":"cdistdf_3_ReduceSumSquarecst","dataType":7,"dims":[1],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[1],"doubleData":[],"uint64Data":[],"externalData":[]}],"node":[{"opType":"Identity","input":["next_in"],"output":["next_out"],"attribute":[]},{"opType":"Sub","input":["next_in","next"],"output":["cdistdf_3_C0"],"attribute":[]},{"opType":"ReduceSumSquare","input":["cdistdf_3_C0","cdistdf_3_ReduceSumSquarecst"],"output":["cdistdf_3_reduced0"],"attribute":[{"name":"keepdims","i":0,"type":2}]},{"opType":"Identity","input":["cdistdf_3_reduced0"],"output":["scan_out"],"attribute":[]}],"input":[{"name":"next_in","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":2},{"dimValue":1}]}}}},{"name":"next","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":1}]}}}}],"output":[{"name":"next_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":2},{"dimValue":1}]}}}},{"name":"scan_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":2}]}}}}],"valueInfo":[{"name":"next_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":2},{"dimValue":1}]}}}},{"name":"scan_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":2}]}}}}]}}]},{"opType":"Loop","input":["trip_count_3","cond_3","init_carry_2"],"output":["loop_out_2"],"attribute":[{"name":"body","type":5,"g":{"name":"loop_body_0","initializer":[],"node":[{"opType":"Constant","input":[],"output":["axes"],"attribute":[{"name":"value","type":4,"t":{"name":"axes","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["mr_dim_tp_3_1"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_tp_3_1","dataType":7,"dims":[],"int64Data":[378]}}]},{"opType":"Constant","input":[],"output":["mr_dim_tp_3_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_tp_3_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["lin_zero_tp_lin_3"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_tp_lin_3","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_tp_lin_3_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_tp_lin_3_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["lin_stride_tp_lin_3_1"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_tp_lin_3_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["flat_shape_UU005UU"],"attribute":[{"name":"value","type":4,"t":{"name":"flat_shape_UU005UU","dataType":7,"dims":[1],"int64Data":[-1]}}]},{"opType":"Constant","input":[],"output":["tp_scalar_3_shape"],"attribute":[{"name":"value","type":4,"t":{"name":"tp_scalar_3_shape","dataType":7,"dims":[0],"int64Data":[]}}]},{"opType":"Unsqueeze","input":["iter","axes"],"output":["unsq_out"],"attribute":[]},{"opType":"Mod","input":["iter","mr_dim_tp_3_1"],"output":["mr_mod_out_tp_3_1"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_tp_3_1"],"output":["mr_div_out_tp_3_1"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_tp_3_1","mr_dim_tp_3_0"],"output":["mr_mod_out_tp_3_0"],"attribute":[]},{"opType":"Div","input":["mr_div_out_tp_3_1","mr_dim_tp_3_0"],"output":["mr_div_out_tp_3_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_tp_3_1","lin_stride_tp_lin_3_0"],"output":["lin_mul_out_tp_lin_3_0"],"attribute":[]},{"opType":"Add","input":["lin_zero_tp_lin_3","lin_mul_out_tp_lin_3_0"],"output":["lin_add_out_tp_lin_3_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_tp_3_0","lin_stride_tp_lin_3_1"],"output":["lin_mul_out_tp_lin_3_1"],"attribute":[]},{"opType":"Add","input":["lin_add_out_tp_lin_3_0","lin_mul_out_tp_lin_3_1"],"output":["lin_add_out_tp_lin_3_1"],"attribute":[]},{"opType":"Unsqueeze","input":["lin_add_out_tp_lin_3_1","axes"],"output":["tp_linU_3_out"],"attribute":[]},{"opType":"Reshape","input":["UU005UU","flat_shape_UU005UU"],"output":["UU005UU_flat"],"attribute":[]},{"opType":"Gather","input":["UU005UU_flat","tp_linU_3_out"],"output":["tp_g_3_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Reshape","input":["tp_g_3_out","tp_scalar_3_shape"],"output":["tp_scalar_3_out"],"attribute":[]},{"opType":"Unsqueeze","input":["tp_scalar_3_out","axes"],"output":["updateUnsq_out"],"attribute":[]},{"opType":"Identity","input":["cond_in"],"output":["cond_out"],"attribute":[]},{"opType":"ScatterElements","input":["carry","unsq_out","updateUnsq_out"],"output":["carry_out"],"attribute":[{"name":"axis","i":0,"type":2}]}],"input":[{"name":"iter","type":{"tensorType":{"elemType":7,"shape":{"dim":[]}}}},{"name":"cond_in","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":756}]}}}}],"output":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":756}]}}}}],"valueInfo":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":756}]}}}},{"name":"UU005UU","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}}]}}]},{"opType":"Reshape","input":["loop_out_2","reshape_shape_3"],"output":["kgpd_transposed0"],"attribute":[]},{"opType":"Loop","input":["trip_count_4","cond_4","init_carry_3"],"output":["loop_out_3"],"attribute":[{"name":"body","type":5,"g":{"name":"loop_body_0","initializer":[],"node":[{"opType":"Constant","input":[],"output":["axes"],"attribute":[{"name":"value","type":4,"t":{"name":"axes","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_kgpd_transposed0_4_1"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_kgpd_transposed0_4_1","dataType":7,"dims":[],"int64Data":[378]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_kgpd_transposed0_4_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_kgpd_transposed0_4_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["lin_zero_gb_lin_kgpd_transposed0_4"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_gb_lin_kgpd_transposed0_4","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_kgpd_transposed0_4_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_kgpd_transposed0_4_0","dataType":7,"dims":[],"int64Data":[378]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_kgpd_transposed0_4_1"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_kgpd_transposed0_4_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["flat_shape_kgpd_transposed0"],"attribute":[{"name":"value","type":4,"t":{"name":"flat_shape_kgpd_transposed0","dataType":7,"dims":[1],"int64Data":[-1]}}]},{"opType":"Constant","input":[],"output":["sg_len_idx_gb_lin_kgpd_transposed0_4"],"attribute":[{"name":"value","type":4,"t":{"name":"sg_len_idx_gb_lin_kgpd_transposed0_4","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_kgpd_Mulcst_4_1"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_kgpd_Mulcst_4_1","dataType":7,"dims":[],"int64Data":[378]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_kgpd_Mulcst_4_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_kgpd_Mulcst_4_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["gb_zero_kgpd_Mulcst_4_0"],"attribute":[{"name":"value","type":4,"t":{"name":"gb_zero_kgpd_Mulcst_4_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_zero_gb_lin_kgpd_Mulcst_4"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_gb_lin_kgpd_Mulcst_4","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_kgpd_Mulcst_4_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_kgpd_Mulcst_4_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["sg_len_idx_gb_lin_kgpd_Mulcst_4"],"attribute":[{"name":"value","type":4,"t":{"name":"sg_len_idx_gb_lin_kgpd_Mulcst_4","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Unsqueeze","input":["iter","axes"],"output":["unsq_out"],"attribute":[]},{"opType":"Mod","input":["iter","mr_dim_gb_out_kgpd_transposed0_4_1"],"output":["mr_mod_out_gb_out_kgpd_transposed0_4_1"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_gb_out_kgpd_transposed0_4_1"],"output":["mr_div_out_gb_out_kgpd_transposed0_4_1"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_kgpd_transposed0_4_1","mr_dim_gb_out_kgpd_transposed0_4_0"],"output":["mr_mod_out_gb_out_kgpd_transposed0_4_0"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_kgpd_transposed0_4_1","mr_dim_gb_out_kgpd_transposed0_4_0"],"output":["mr_div_out_gb_out_kgpd_transposed0_4_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_kgpd_transposed0_4_0","lin_stride_gb_lin_kgpd_transposed0_4_0"],"output":["lin_mul_out_gb_lin_kgpd_transposed0_4_0"],"attribute":[]},{"opType":"Add","input":["lin_zero_gb_lin_kgpd_transposed0_4","lin_mul_out_gb_lin_kgpd_transposed0_4_0"],"output":["lin_add_out_gb_lin_kgpd_transposed0_4_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_kgpd_transposed0_4_1","lin_stride_gb_lin_kgpd_transposed0_4_1"],"output":["lin_mul_out_gb_lin_kgpd_transposed0_4_1"],"attribute":[]},{"opType":"Add","input":["lin_add_out_gb_lin_kgpd_transposed0_4_0","lin_mul_out_gb_lin_kgpd_transposed0_4_1"],"output":["lin_add_out_gb_lin_kgpd_transposed0_4_1"],"attribute":[]},{"opType":"Reshape","input":["kgpd_transposed0","flat_shape_kgpd_transposed0"],"output":["kgpd_transposed0_flat"],"attribute":[]},{"opType":"Shape","input":["kgpd_transposed0_flat"],"output":["sg_shape_out_gb_lin_kgpd_transposed0_4"],"attribute":[]},{"opType":"Gather","input":["sg_shape_out_gb_lin_kgpd_transposed0_4","sg_len_idx_gb_lin_kgpd_transposed0_4"],"output":["sg_len_gb_lin_kgpd_transposed0_4_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["lin_add_out_gb_lin_kgpd_transposed0_4_1","sg_len_gb_lin_kgpd_transposed0_4_out"],"output":["Mod_sg_mod_gb_lin_kgpd_transposed0_4_out"],"attribute":[]},{"opType":"Unsqueeze","input":["Mod_sg_mod_gb_lin_kgpd_transposed0_4_out","axes"],"output":["sg_idx_unsq_gb_lin_kgpd_transposed0_4_out"],"attribute":[]},{"opType":"Gather","input":["kgpd_transposed0_flat","sg_idx_unsq_gb_lin_kgpd_transposed0_4_out"],"output":["sg_g_gb_lin_kgpd_transposed0_4_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["iter","mr_dim_gb_out_kgpd_Mulcst_4_1"],"output":["mr_mod_out_gb_out_kgpd_Mulcst_4_1"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_gb_out_kgpd_Mulcst_4_1"],"output":["mr_div_out_gb_out_kgpd_Mulcst_4_1"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_kgpd_Mulcst_4_1","mr_dim_gb_out_kgpd_Mulcst_4_0"],"output":["mr_mod_out_gb_out_kgpd_Mulcst_4_0"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_kgpd_Mulcst_4_1","mr_dim_gb_out_kgpd_Mulcst_4_0"],"output":["mr_div_out_gb_out_kgpd_Mulcst_4_0"],"attribute":[]},{"opType":"Mul","input":["gb_zero_kgpd_Mulcst_4_0","lin_stride_gb_lin_kgpd_Mulcst_4_0"],"output":["lin_mul_out_gb_lin_kgpd_Mulcst_4_0"],"attribute":[]},{"opType":"Add","input":["lin_zero_gb_lin_kgpd_Mulcst_4","lin_mul_out_gb_lin_kgpd_Mulcst_4_0"],"output":["lin_add_out_gb_lin_kgpd_Mulcst_4_0"],"attribute":[]},{"opType":"Shape","input":["kgpd_Mulcst"],"output":["sg_shape_out_gb_lin_kgpd_Mulcst_4"],"attribute":[]},{"opType":"Gather","input":["sg_shape_out_gb_lin_kgpd_Mulcst_4","sg_len_idx_gb_lin_kgpd_Mulcst_4"],"output":["sg_len_gb_lin_kgpd_Mulcst_4_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["lin_add_out_gb_lin_kgpd_Mulcst_4_0","sg_len_gb_lin_kgpd_Mulcst_4_out"],"output":["Mod_sg_mod_gb_lin_kgpd_Mulcst_4_out"],"attribute":[]},{"opType":"Unsqueeze","input":["Mod_sg_mod_gb_lin_kgpd_Mulcst_4_out","axes"],"output":["sg_idx_unsq_gb_lin_kgpd_Mulcst_4_out"],"attribute":[]},{"opType":"Gather","input":["kgpd_Mulcst","sg_idx_unsq_gb_lin_kgpd_Mulcst_4_out"],"output":["sg_g_gb_lin_kgpd_Mulcst_4_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Squeeze","input":["sg_g_gb_lin_kgpd_transposed0_4_out","axes"],"output":["sq_4_in0_scalar_out"],"attribute":[]},{"opType":"Squeeze","input":["sg_g_gb_lin_kgpd_Mulcst_4_out","axes"],"output":["sq_4_in1_scalar_out"],"attribute":[]},{"opType":"Mul","input":["sq_4_in0_scalar_out","sq_4_in1_scalar_out"],"output":["4_out"],"attribute":[]},{"opType":"Unsqueeze","input":["4_out","axes"],"output":["updateUnsq_out"],"attribute":[]},{"opType":"Identity","input":["cond_in"],"output":["cond_out"],"attribute":[]},{"opType":"ScatterElements","input":["carry","unsq_out","updateUnsq_out"],"output":["carry_out"],"attribute":[{"name":"axis","i":0,"type":2}]}],"input":[{"name":"iter","type":{"tensorType":{"elemType":7,"shape":{"dim":[]}}}},{"name":"cond_in","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":756}]}}}}],"output":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":756}]}}}}],"valueInfo":[{"name":"cond_out",