{"irVersion":9,"opsetImport":[{"version":19}],"graph":{"name":"Graph","initializer":[{"name":"Di_Divcst","dataType":1,"dims":[1],"floatData":[5.142068862915039],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[]},{"name":"Di_Divcst1","dataType":1,"dims":[378,1],"floatData":[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,204,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,243,244,245,246,247,248,249,250,251,252,253,254,255,256,257,258,259,260,261,262,263,264,265,266,267,268,269,270,271,272,273,274,275,276,277,278,279,280,281,282,283,284,285,286,287,288,289,290,291,292,293,294,295,296,297,298,299,300,301,302,303,304,305,306,307,308,309,310,311,312,313,314,315,316,317,318,319,320,321,322,323,324,325,326,327,328,329,330,331,332,333,334,335,336,337,338,339,340,341,342,343,344,345,346,347,348,349,350,351,352,353,354,355,356,357,358,359,360,361,362,363,364,365,366,367,368,369,370,371,372,373,374,375,376,377,378],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[]},{"name":"kgpd_Mulcst","dataType":1,"dims":[1],"floatData":[0.5],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[]},{"name":"gpr_MatMulcst","dataType":1,"dims":[378],"floatData":[-0.09942170232534409,-0.07283324748277664,-0.05141019448637962,-0.03645586967468262,-0.02824411541223526,-0.025911031290888786,-0.02752384915947914,-0.030364081263542175,-0.03144765645265579,-0.028268219903111458,-0.019685084000229836,-0.006792993750423193,0.006466397549957037,0.013221767731010914,0.004333817400038242,-0.03013794869184494,-0.09883484989404678,-0.20678043365478516,-0.3534243404865265,-0.5316348671913147,-0.7280376553535461,0.5559008717536926,0.39606985449790955,0.2476155161857605,0.12283986061811447,0.028951959684491158,-0.03222979977726936,-0.0633307695388794,-0.06971967220306396,-0.05774063989520073,-0.033511508256196976,-0.0026483109686523676,0.029121819883584976,0.05487942695617676,0.06561608612537384,0.050169866532087326,-0.003615315305069089,-0.10654959827661514,-0.2650923728942871,-0.47854363918304443,-0.7373693585395813,-1.0233559608459473,0.8073068857192993,0.5892173051834106,0.3835931122303009,0.20886866748332977,0.07628889381885529,-0.010778600350022316,-0.05570618063211441,-0.06626586616039276,-0.05200858414173126,-0.02225332520902157,0.014757533557713032,0.05148650333285332,0.0799601599574089,0.09062433987855911,0.0719892680644989,0.011583971790969372,-0.10175211727619171,-0.27475690841674805,-0.5067354440689087,-0.7876851558685303,-1.098344087600708,0.8585863709449768,0.6311172246932983,0.4148884117603302,0.2303602546453476,0.0902324691414833,-0.0014737197197973728,-0.04833376035094261,-0.05904744938015938,-0.044520191848278046,-0.015438598580658436,0.019030362367630005,0.05127745866775513,0.07437752932310104,0.08098115772008896,0.06270863860845566,0.01056618057191372,-0.08351130038499832,-0.2243557572364807,-0.41122376918792725,-0.6362568140029907,-0.8844071626663208,0.6445130109786987,0.47133398056030273,0.3057742416858673,0.1644045114517212,0.05764953792095184,-0.01110383402556181,-0.0447872057557106,-0.05074174329638481,-0.038317784667015076,-0.016708724200725555,0.006455159280449152,0.025561165064573288,0.036669038236141205,0.036760080605745316,0.02304946817457676,-0.007266084663569927,-0.056672658771276474,-0.1265217661857605,-0.21604593098163605,-0.32161062955856323,-0.43654802441596985,0.22249247133731842,0.15299107134342194,0.08616987615823746,0.029680190607905388,-0.011555119417607784,-0.03593635931611061,-0.04502847418189049,-0.04276634752750397,-0.03427845612168312,-0.024631591513752937,-0.017764823511242867,-0.01579323224723339,-0.01875929906964302,-0.024819713085889816,-0.030789531767368317,-0.03292226418852806,-0.027776993811130524,-0.013010415248572826,0.012061729095876217,0.04625357314944267,0.08669939637184143,-0.2471456080675125,-0.20136485993862152,-0.15746036171913147,-0.1184864193201065,-0.08624270558357239,-0.061405811458826065,-0.04392338916659355,-0.03347789868712425,-0.029795853421092033,-0.03262918069958687,-0.04135828837752342,-0.05432605743408203,-0.06815595924854279,-0.07738125324249268,-0.07467667013406754,-0.051832299679517746,-0.001375024439767003,0.08150413632392883,0.19723008573055267,0.3408668041229248,0.502263069152832,-0.5820173621177673,-0.45118874311447144,-0.3250674605369568,-0.21520191431045532,-0.12880901992321014,-0.06845470517873764,-0.03279447183012962,-0.01797599531710148,-0.019138462841510773,-0.03147974610328674,-0.05058130621910095,-0.07200159132480621,-0.09045840054750443,-0.09911144524812698,-0.08945802599191666,-0.052159350365400314,0.021221067756414413,0.13595184683799744,0.29199376702308655,0.48270151019096375,0.6949014067649841,-0.6779137849807739,-0.5152105093002319,-0.3582698106765747,-0.22224092483520508,-0.11669236421585083,-0.045020122081041336,-0.0052514770068228245,0.00820490438491106,0.0025397641584277153,-0.01508289948105812,-0.03833165764808655,-0.061625346541404724,-0.07944948971271515,-0.08558719605207443,-0.07280907034873962,-0.03338763490319252,0.03952375426888466,0.14996851980686188,0.2973102927207947,0.47506609559059143,0.6709551215171814,-0.5667035579681396,-0.41770464181900024,-0.2749395966529846,-0.1522720754146576,-0.05846285820007324,0.0034457845613360405,0.03546282276511192,0.043082088232040405,0.03341228887438774,0.013597000390291214,-0.010077559389173985,-0.032295648008584976,-0.048259202390909195,-0.05308233201503754,-0.04147969186306,-0.008057648316025734,0.05173984542489052,0.140264093875885,0.25631844997406006,0.3943435251712799,0.5445131659507751,-0.3929559290409088,-0.2720135450363159,-0.15855969488620758,-0.06285200268030167,0.008748406544327736,0.05422874167561531,0.07540885359048843,0.07675469666719437,0.06397581100463867,0.042855579406023026,0.018607761710882187,-0.004185465630143881,-0.02123274654150009,-0.02811810001730919,-0.020155148580670357,0.007263406179845333,0.057806625962257385,0.13305090367794037,0.23140808939933777,0.347548246383667,0.4726136028766632,-0.32871705293655396,-0.21365977823734283,-0.10877252370119095,-0.02203989215195179,0.04183727502822876,0.08169297128915787,0.09936109930276871,0.0986458957195282,0.08421210199594498,0.06078008562326431,0.03284609317779541,0.004910784773528576,-0.0180255938321352,-0.03007364273071289,-0.024531349539756775,0.005370606202632189,0.06510791182518005,0.15720728039741516,0.2798002362251282,0.4259095788002014,0.5838249921798706,-0.48651719093322754,-0.329852819442749,-0.18753688037395477,-0.06952885538339615,0.01850586198270321,0.07536015659570694,0.10344742983579636,0.10739510506391525,0.09265276789665222,0.06463318318128586,0.028650758787989616,-0.009431078098714352,-0.04225917533040047,-0.060354724526405334,-0.05234222859144211,-0.006339385639876127,0.08761339634656906,0.23464015126228333,0.43248453736305237,0.6702134013175964,0.9287703037261963,-0.8746724724769592,-0.6235142946243286,-0.3924071788787842,-0.1984497755765915,-0.05148131400346756,0.04619036242365837,0.09836051613092422,0.11252451688051224,0.09747878462076187,0.061801619827747345,0.013672173023223877,-0.03809665888547897,-0.08247953653335571,-0.10509119182825089,-0.08839753270149231,-0.01379444357007742,0.1346062868833542,0.36534926295280457,0.6755167245864868,1.048533320426941,1.4548816680908203,-1.3981176614761353,-1.0170522928237915,-0.6630215048789978,-0.36395949125289917,-0.13615582883358002,0.01630786620080471,0.09937199205160141,0.12516562640666962,0.1080419197678566,0.061866261065006256,-0.0006737781804986298,-0.06684042513370514,-0.12162556499242783,-0.14594611525535583,-0.11662280559539795,-0.008934392593801022,0.19840285181999207,0.5169816613197327,0.9430282115936279,1.4542720317840576,2.0107614994049072,-1.8928889036178589,-1.3839755058288574,-0.9090750217437744,-0.5072711706161499,-0.20150421559810638,0.0023795971646904945,0.11274369806051254,0.14688771963119507,0.12541596591472626,0.06813663989305496,-0.007404434494674206,-0.08478179574012756,-0.14604175090789795,-0.16929610073566437,-0.12829658389091492,0.004952996037900448,0.25463393330574036,0.6339097023010254,1.138262391090393,1.7417172193527222,2.397653102874756,-2.1880640983581543,-1.5982245206832886,-1.0470227003097534,-0.581000804901123,-0.22754845023155212,0.006391796283423901,0.1310441493988037,0.1675807535648346,0.1413068324327469,0.07646346837282181,-0.006003497634083033,-0.0876253992319107,-0.14967526495456696,-0.17039650678634644,-0.12411175668239594,0.016567308455705643,0.27540668845176697,0.6653676629066467,1.1817888021469116,1.7983647584915161,2.4677326679229736,-2.1725876331329346,-1.5796154737472534,-1.028076410293579,-0.5662514567375183,-0.2220374494791031,-0.0010087966220453382,0.11059708148241043,0.13934844732284546,0.11670146882534027,0.07190309464931488,0.027320537716150284,-0.003165280446410179,-0.013050392270088196,-0.00043739794637076557,0.03507170081138611,0.09466338157653809,0.18110759556293488,0.2979924976825714,0.4478684663772583,0.6300933361053467,0.8392108678817749],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[]},{"name":"gpr_Mulcst","dataType":1,"dims":[1],"floatData":[0.2375706285238266],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[]},{"name":"gpr_Addcst","dataType":1,"dims":[1],"floatData":[0.04787885770201683],"int32Data":[],"stringData":[],"int64Data":[],"doubleData":[],"uint64Data":[],"externalData":[]},{"name":"Re_Reshapecst","dataType":7,"dims":[2],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[-1,1],"doubleData":[],"uint64Data":[],"externalData":[]},{"name":"init_carry","dataType":1,"dims":[2],"floatData":[0,0]},{"name":"init_carry_1","dataType":1,"dims":[378],"floatData":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]},{"name":"init_carry_2","dataType":1,"dims":[756],"floatData":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]},{"name":"init_carry_3","dataType":1,"dims":[756],"floatData":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]},{"name":"init_carry_4","dataType":1,"dims":[756],"floatData":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]},{"name":"init_carry_5","dataType":1,"dims":[2],"floatData":[0,0]},{"name":"init_carry_6","dataType":1,"dims":[2],"floatData":[0,0]},{"name":"init_carry_7","dataType":1,"dims":[2],"floatData":[0,0]}],"node":[{"opType":"Constant","input":[],"output":["cond_9"],"attribute":[{"name":"value","type":4,"t":{"name":"cond_9","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["cond_6"],"attribute":[{"name":"value","type":4,"t":{"name":"cond_6","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["cond_0"],"attribute":[{"name":"value","type":4,"t":{"name":"cond_0","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["reshape_shape_0"],"attribute":[{"name":"value","type":4,"t":{"name":"reshape_shape_0","dataType":7,"dims":[2],"int64Data":[2,1]}}]},{"opType":"Constant","input":[],"output":["cond_1"],"attribute":[{"name":"value","type":4,"t":{"name":"cond_1","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["cond_3"],"attribute":[{"name":"value","type":4,"t":{"name":"cond_3","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["trip_count_0"],"attribute":[{"name":"value","type":4,"t":{"name":"trip_count_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["cond_7"],"attribute":[{"name":"value","type":4,"t":{"name":"cond_7","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["cond_8"],"attribute":[{"name":"value","type":4,"t":{"name":"cond_8","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["trip_count_1"],"attribute":[{"name":"value","type":4,"t":{"name":"trip_count_1","dataType":7,"dims":[],"int64Data":[378]}}]},{"opType":"Constant","input":[],"output":["reshape_shape_1"],"attribute":[{"name":"value","type":4,"t":{"name":"reshape_shape_1","dataType":7,"dims":[2],"int64Data":[378,1]}}]},{"opType":"Constant","input":[],"output":["trip_count_3"],"attribute":[{"name":"value","type":4,"t":{"name":"trip_count_3","dataType":7,"dims":[],"int64Data":[756]}}]},{"opType":"Constant","input":[],"output":["cond_4"],"attribute":[{"name":"value","type":4,"t":{"name":"cond_4","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["reshape_shape_3"],"attribute":[{"name":"value","type":4,"t":{"name":"reshape_shape_3","dataType":7,"dims":[2],"int64Data":[2,378]}}]},{"opType":"Constant","input":[],"output":["trip_count_4"],"attribute":[{"name":"value","type":4,"t":{"name":"trip_count_4","dataType":7,"dims":[],"int64Data":[756]}}]},{"opType":"Constant","input":[],"output":["reshape_shape_4"],"attribute":[{"name":"value","type":4,"t":{"name":"reshape_shape_4","dataType":7,"dims":[2],"int64Data":[2,378]}}]},{"opType":"Constant","input":[],"output":["trip_count_6"],"attribute":[{"name":"value","type":4,"t":{"name":"trip_count_6","dataType":7,"dims":[],"int64Data":[756]}}]},{"opType":"Constant","input":[],"output":["reshape_shape_6"],"attribute":[{"name":"value","type":4,"t":{"name":"reshape_shape_6","dataType":7,"dims":[2],"int64Data":[2,378]}}]},{"opType":"Constant","input":[],"output":["trip_count_7"],"attribute":[{"name":"value","type":4,"t":{"name":"trip_count_7","dataType":7,"dims":[],"int64Data":[756]}}]},{"opType":"Constant","input":[],"output":["reshape_shape_7"],"attribute":[{"name":"value","type":4,"t":{"name":"reshape_shape_7","dataType":7,"dims":[2],"int64Data":[2,1]}}]},{"opType":"Constant","input":[],"output":["trip_count_8"],"attribute":[{"name":"value","type":4,"t":{"name":"trip_count_8","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["trip_count_9"],"attribute":[{"name":"value","type":4,"t":{"name":"trip_count_9","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["reshape_shape_9"],"attribute":[{"name":"value","type":4,"t":{"name":"reshape_shape_9","dataType":7,"dims":[2],"int64Data":[2,1]}}]},{"opType":"Loop","input":["trip_count_0","cond_0","init_carry"],"output":["loop_out"],"attribute":[{"name":"body","type":5,"g":{"name":"loop_body_0","initializer":[],"node":[{"opType":"Constant","input":[],"output":["axes"],"attribute":[{"name":"value","type":4,"t":{"name":"axes","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_input_0_1"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_input_0_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_input_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_input_0_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["gb_zero_input_0_1"],"attribute":[{"name":"value","type":4,"t":{"name":"gb_zero_input_0_1","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_zero_gb_lin_input_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_gb_lin_input_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_input_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_input_0_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_input_0_1"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_input_0_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["flat_shape_input"],"attribute":[{"name":"value","type":4,"t":{"name":"flat_shape_input","dataType":7,"dims":[1],"int64Data":[-1]}}]},{"opType":"Constant","input":[],"output":["sg_len_idx_gb_lin_input_0"],"attribute":[{"name":"value","type":4,"t":{"name":"sg_len_idx_gb_lin_input_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_Di_Divcst_0_1"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_Di_Divcst_0_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_Di_Divcst_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_Di_Divcst_0_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["gb_zero_Di_Divcst_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"gb_zero_Di_Divcst_0_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_zero_gb_lin_Di_Divcst_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_gb_lin_Di_Divcst_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_Di_Divcst_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_Di_Divcst_0_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["sg_len_idx_gb_lin_Di_Divcst_0"],"attribute":[{"name":"value","type":4,"t":{"name":"sg_len_idx_gb_lin_Di_Divcst_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Unsqueeze","input":["iter","axes"],"output":["unsq_out"],"attribute":[]},{"opType":"Mod","input":["iter","mr_dim_gb_out_input_0_1"],"output":["mr_mod_out_gb_out_input_0_1"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_gb_out_input_0_1"],"output":["mr_div_out_gb_out_input_0_1"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_input_0_1","mr_dim_gb_out_input_0_0"],"output":["mr_mod_out_gb_out_input_0_0"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_input_0_1","mr_dim_gb_out_input_0_0"],"output":["mr_div_out_gb_out_input_0_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_input_0_0","lin_stride_gb_lin_input_0_0"],"output":["lin_mul_out_gb_lin_input_0_0"],"attribute":[]},{"opType":"Add","input":["lin_zero_gb_lin_input_0","lin_mul_out_gb_lin_input_0_0"],"output":["lin_add_out_gb_lin_input_0_0"],"attribute":[]},{"opType":"Mul","input":["gb_zero_input_0_1","lin_stride_gb_lin_input_0_1"],"output":["lin_mul_out_gb_lin_input_0_1"],"attribute":[]},{"opType":"Add","input":["lin_add_out_gb_lin_input_0_0","lin_mul_out_gb_lin_input_0_1"],"output":["lin_add_out_gb_lin_input_0_1"],"attribute":[]},{"opType":"Reshape","input":["input","flat_shape_input"],"output":["input_flat"],"attribute":[]},{"opType":"Shape","input":["input_flat"],"output":["sg_shape_out_gb_lin_input_0"],"attribute":[]},{"opType":"Gather","input":["sg_shape_out_gb_lin_input_0","sg_len_idx_gb_lin_input_0"],"output":["sg_len_gb_lin_input_0_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["lin_add_out_gb_lin_input_0_1","sg_len_gb_lin_input_0_out"],"output":["Mod_sg_mod_gb_lin_input_0_out"],"attribute":[]},{"opType":"Unsqueeze","input":["Mod_sg_mod_gb_lin_input_0_out","axes"],"output":["sg_idx_unsq_gb_lin_input_0_out"],"attribute":[]},{"opType":"Gather","input":["input_flat","sg_idx_unsq_gb_lin_input_0_out"],"output":["sg_g_gb_lin_input_0_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["iter","mr_dim_gb_out_Di_Divcst_0_1"],"output":["mr_mod_out_gb_out_Di_Divcst_0_1"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_gb_out_Di_Divcst_0_1"],"output":["mr_div_out_gb_out_Di_Divcst_0_1"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_Di_Divcst_0_1","mr_dim_gb_out_Di_Divcst_0_0"],"output":["mr_mod_out_gb_out_Di_Divcst_0_0"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_Di_Divcst_0_1","mr_dim_gb_out_Di_Divcst_0_0"],"output":["mr_div_out_gb_out_Di_Divcst_0_0"],"attribute":[]},{"opType":"Mul","input":["gb_zero_Di_Divcst_0_0","lin_stride_gb_lin_Di_Divcst_0_0"],"output":["lin_mul_out_gb_lin_Di_Divcst_0_0"],"attribute":[]},{"opType":"Add","input":["lin_zero_gb_lin_Di_Divcst_0","lin_mul_out_gb_lin_Di_Divcst_0_0"],"output":["lin_add_out_gb_lin_Di_Divcst_0_0"],"attribute":[]},{"opType":"Shape","input":["Di_Divcst"],"output":["sg_shape_out_gb_lin_Di_Divcst_0"],"attribute":[]},{"opType":"Gather","input":["sg_shape_out_gb_lin_Di_Divcst_0","sg_len_idx_gb_lin_Di_Divcst_0"],"output":["sg_len_gb_lin_Di_Divcst_0_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["lin_add_out_gb_lin_Di_Divcst_0_0","sg_len_gb_lin_Di_Divcst_0_out"],"output":["Mod_sg_mod_gb_lin_Di_Divcst_0_out"],"attribute":[]},{"opType":"Unsqueeze","input":["Mod_sg_mod_gb_lin_Di_Divcst_0_out","axes"],"output":["sg_idx_unsq_gb_lin_Di_Divcst_0_out"],"attribute":[]},{"opType":"Gather","input":["Di_Divcst","sg_idx_unsq_gb_lin_Di_Divcst_0_out"],"output":["sg_g_gb_lin_Di_Divcst_0_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Squeeze","input":["sg_g_gb_lin_input_0_out","axes"],"output":["sq_0_in0_scalar_out"],"attribute":[]},{"opType":"Squeeze","input":["sg_g_gb_lin_Di_Divcst_0_out","axes"],"output":["sq_0_in1_scalar_out"],"attribute":[]},{"opType":"Div","input":["sq_0_in0_scalar_out","sq_0_in1_scalar_out"],"output":["0_out"],"attribute":[]},{"opType":"Unsqueeze","input":["0_out","axes"],"output":["updateUnsq_out"],"attribute":[]},{"opType":"Identity","input":["cond_in"],"output":["cond_out"],"attribute":[]},{"opType":"ScatterElements","input":["carry","unsq_out","updateUnsq_out"],"output":["carry_out"],"attribute":[{"name":"axis","i":0,"type":2}]}],"input":[{"name":"iter","type":{"tensorType":{"elemType":7,"shape":{"dim":[]}}}},{"name":"cond_in","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":2}]}}}}],"output":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":2}]}}}}],"valueInfo":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":2}]}}}},{"name":"input","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}},{"name":"Di_Divcst","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}}]}}]},{"opType":"Loop","input":["trip_count_1","cond_1","init_carry_1"],"output":["loop_out_1"],"attribute":[{"name":"body","type":5,"g":{"name":"loop_body_0","initializer":[],"node":[{"opType":"Constant","input":[],"output":["axes"],"attribute":[{"name":"value","type":4,"t":{"name":"axes","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_Di_Divcst1_1_1"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_Di_Divcst1_1_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_Di_Divcst1_1_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_Di_Divcst1_1_0","dataType":7,"dims":[],"int64Data":[378]}}]},{"opType":"Constant","input":[],"output":["gb_zero_Di_Divcst1_1_1"],"attribute":[{"name":"value","type":4,"t":{"name":"gb_zero_Di_Divcst1_1_1","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_zero_gb_lin_Di_Divcst1_1"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_gb_lin_Di_Divcst1_1","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_Di_Divcst1_1_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_Di_Divcst1_1_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_Di_Divcst1_1_1"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_Di_Divcst1_1_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["flat_shape_Di_Divcst1"],"attribute":[{"name":"value","type":4,"t":{"name":"flat_shape_Di_Divcst1","dataType":7,"dims":[1],"int64Data":[-1]}}]},{"opType":"Constant","input":[],"output":["sg_len_idx_gb_lin_Di_Divcst1_1"],"attribute":[{"name":"value","type":4,"t":{"name":"sg_len_idx_gb_lin_Di_Divcst1_1","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_Di_Divcst_1_1"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_Di_Divcst_1_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_Di_Divcst_1_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_Di_Divcst_1_0","dataType":7,"dims":[],"int64Data":[378]}}]},{"opType":"Constant","input":[],"output":["gb_zero_Di_Divcst_1_0"],"attribute":[{"name":"value","type":4,"t":{"name":"gb_zero_Di_Divcst_1_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_zero_gb_lin_Di_Divcst_1"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_gb_lin_Di_Divcst_1","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_Di_Divcst_1_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_Di_Divcst_1_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["sg_len_idx_gb_lin_Di_Divcst_1"],"attribute":[{"name":"value","type":4,"t":{"name":"sg_len_idx_gb_lin_Di_Divcst_1","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Unsqueeze","input":["iter","axes"],"output":["unsq_out"],"attribute":[]},{"opType":"Mod","input":["iter","mr_dim_gb_out_Di_Divcst1_1_1"],"output":["mr_mod_out_gb_out_Di_Divcst1_1_1"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_gb_out_Di_Divcst1_1_1"],"output":["mr_div_out_gb_out_Di_Divcst1_1_1"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_Di_Divcst1_1_1","mr_dim_gb_out_Di_Divcst1_1_0"],"output":["mr_mod_out_gb_out_Di_Divcst1_1_0"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_Di_Divcst1_1_1","mr_dim_gb_out_Di_Divcst1_1_0"],"output":["mr_div_out_gb_out_Di_Divcst1_1_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_Di_Divcst1_1_0","lin_stride_gb_lin_Di_Divcst1_1_0"],"output":["lin_mul_out_gb_lin_Di_Divcst1_1_0"],"attribute":[]},{"opType":"Add","input":["lin_zero_gb_lin_Di_Divcst1_1","lin_mul_out_gb_lin_Di_Divcst1_1_0"],"output":["lin_add_out_gb_lin_Di_Divcst1_1_0"],"attribute":[]},{"opType":"Mul","input":["gb_zero_Di_Divcst1_1_1","lin_stride_gb_lin_Di_Divcst1_1_1"],"output":["lin_mul_out_gb_lin_Di_Divcst1_1_1"],"attribute":[]},{"opType":"Add","input":["lin_add_out_gb_lin_Di_Divcst1_1_0","lin_mul_out_gb_lin_Di_Divcst1_1_1"],"output":["lin_add_out_gb_lin_Di_Divcst1_1_1"],"attribute":[]},{"opType":"Reshape","input":["Di_Divcst1","flat_shape_Di_Divcst1"],"output":["Di_Divcst1_flat"],"attribute":[]},{"opType":"Shape","input":["Di_Divcst1_flat"],"output":["sg_shape_out_gb_lin_Di_Divcst1_1"],"attribute":[]},{"opType":"Gather","input":["sg_shape_out_gb_lin_Di_Divcst1_1","sg_len_idx_gb_lin_Di_Divcst1_1"],"output":["sg_len_gb_lin_Di_Divcst1_1_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["lin_add_out_gb_lin_Di_Divcst1_1_1","sg_len_gb_lin_Di_Divcst1_1_out"],"output":["Mod_sg_mod_gb_lin_Di_Divcst1_1_out"],"attribute":[]},{"opType":"Unsqueeze","input":["Mod_sg_mod_gb_lin_Di_Divcst1_1_out","axes"],"output":["sg_idx_unsq_gb_lin_Di_Divcst1_1_out"],"attribute":[]},{"opType":"Gather","input":["Di_Divcst1_flat","sg_idx_unsq_gb_lin_Di_Divcst1_1_out"],"output":["sg_g_gb_lin_Di_Divcst1_1_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["iter","mr_dim_gb_out_Di_Divcst_1_1"],"output":["mr_mod_out_gb_out_Di_Divcst_1_1"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_gb_out_Di_Divcst_1_1"],"output":["mr_div_out_gb_out_Di_Divcst_1_1"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_Di_Divcst_1_1","mr_dim_gb_out_Di_Divcst_1_0"],"output":["mr_mod_out_gb_out_Di_Divcst_1_0"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_Di_Divcst_1_1","mr_dim_gb_out_Di_Divcst_1_0"],"output":["mr_div_out_gb_out_Di_Divcst_1_0"],"attribute":[]},{"opType":"Mul","input":["gb_zero_Di_Divcst_1_0","lin_stride_gb_lin_Di_Divcst_1_0"],"output":["lin_mul_out_gb_lin_Di_Divcst_1_0"],"attribute":[]},{"opType":"Add","input":["lin_zero_gb_lin_Di_Divcst_1","lin_mul_out_gb_lin_Di_Divcst_1_0"],"output":["lin_add_out_gb_lin_Di_Divcst_1_0"],"attribute":[]},{"opType":"Shape","input":["Di_Divcst"],"output":["sg_shape_out_gb_lin_Di_Divcst_1"],"attribute":[]},{"opType":"Gather","input":["sg_shape_out_gb_lin_Di_Divcst_1","sg_len_idx_gb_lin_Di_Divcst_1"],"output":["sg_len_gb_lin_Di_Divcst_1_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["lin_add_out_gb_lin_Di_Divcst_1_0","sg_len_gb_lin_Di_Divcst_1_out"],"output":["Mod_sg_mod_gb_lin_Di_Divcst_1_out"],"attribute":[]},{"opType":"Unsqueeze","input":["Mod_sg_mod_gb_lin_Di_Divcst_1_out","axes"],"output":["sg_idx_unsq_gb_lin_Di_Divcst_1_out"],"attribute":[]},{"opType":"Gather","input":["Di_Divcst","sg_idx_unsq_gb_lin_Di_Divcst_1_out"],"output":["sg_g_gb_lin_Di_Divcst_1_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Squeeze","input":["sg_g_gb_lin_Di_Divcst1_1_out","axes"],"output":["sq_1_in0_scalar_out"],"attribute":[]},{"opType":"Squeeze","input":["sg_g_gb_lin_Di_Divcst_1_out","axes"],"output":["sq_1_in1_scalar_out"],"attribute":[]},{"opType":"Div","input":["sq_1_in0_scalar_out","sq_1_in1_scalar_out"],"output":["1_out"],"attribute":[]},{"opType":"Unsqueeze","input":["1_out","axes"],"output":["updateUnsq_out"],"attribute":[]},{"opType":"Identity","input":["cond_in"],"output":["cond_out"],"attribute":[]},{"opType":"ScatterElements","input":["carry","unsq_out","updateUnsq_out"],"output":["carry_out"],"attribute":[{"name":"axis","i":0,"type":2}]}],"input":[{"name":"iter","type":{"tensorType":{"elemType":7,"shape":{"dim":[]}}}},{"name":"cond_in","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":378}]}}}}],"output":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":378}]}}}}],"valueInfo":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":378}]}}}},{"name":"Di_Divcst1","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}},{"name":"Di_Divcst","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}}]}}]},{"opType":"Reshape","input":["loop_out","reshape_shape_0"],"output":["Di_C0"],"attribute":[]},{"opType":"Reshape","input":["loop_out_1","reshape_shape_1"],"output":["Di_C02"],"attribute":[]},{"opType":"Scan","input":["Di_C0","Di_C02"],"output":["UU002UU","UU003UU"],"attribute":[{"name":"num_scan_inputs","i":1,"type":2},{"name":"body","type":5,"g":{"name":"scan_body_0","initializer":[{"name":"cdistdf_2_ReduceSumSquarecst","dataType":7,"dims":[1],"floatData":[],"int32Data":[],"stringData":[],"int64Data":[1],"doubleData":[],"uint64Data":[],"externalData":[]}],"node":[{"opType":"Identity","input":["next_in"],"output":["next_out"],"attribute":[]},{"opType":"Sub","input":["next_in","next"],"output":["cdistdf_2_C0"],"attribute":[]},{"opType":"ReduceSumSquare","input":["cdistdf_2_C0","cdistdf_2_ReduceSumSquarecst"],"output":["cdistdf_2_reduced0"],"attribute":[{"name":"keepdims","i":0,"type":2}]},{"opType":"Identity","input":["cdistdf_2_reduced0"],"output":["scan_out"],"attribute":[]}],"input":[{"name":"next_in","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":2},{"dimValue":1}]}}}},{"name":"next","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":1}]}}}}],"output":[{"name":"next_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":2},{"dimValue":1}]}}}},{"name":"scan_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":2}]}}}}],"valueInfo":[{"name":"next_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":2},{"dimValue":1}]}}}},{"name":"scan_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":2}]}}}}]}}]},{"opType":"Loop","input":["trip_count_3","cond_3","init_carry_2"],"output":["loop_out_2"],"attribute":[{"name":"body","type":5,"g":{"name":"loop_body_0","initializer":[],"node":[{"opType":"Constant","input":[],"output":["axes"],"attribute":[{"name":"value","type":4,"t":{"name":"axes","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["mr_dim_tp_3_1"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_tp_3_1","dataType":7,"dims":[],"int64Data":[378]}}]},{"opType":"Constant","input":[],"output":["mr_dim_tp_3_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_tp_3_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["lin_zero_tp_lin_3"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_tp_lin_3","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_tp_lin_3_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_tp_lin_3_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["lin_stride_tp_lin_3_1"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_tp_lin_3_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["flat_shape_UU003UU"],"attribute":[{"name":"value","type":4,"t":{"name":"flat_shape_UU003UU","dataType":7,"dims":[1],"int64Data":[-1]}}]},{"opType":"Constant","input":[],"output":["tp_scalar_3_shape"],"attribute":[{"name":"value","type":4,"t":{"name":"tp_scalar_3_shape","dataType":7,"dims":[0],"int64Data":[]}}]},{"opType":"Unsqueeze","input":["iter","axes"],"output":["unsq_out"],"attribute":[]},{"opType":"Mod","input":["iter","mr_dim_tp_3_1"],"output":["mr_mod_out_tp_3_1"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_tp_3_1"],"output":["mr_div_out_tp_3_1"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_tp_3_1","mr_dim_tp_3_0"],"output":["mr_mod_out_tp_3_0"],"attribute":[]},{"opType":"Div","input":["mr_div_out_tp_3_1","mr_dim_tp_3_0"],"output":["mr_div_out_tp_3_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_tp_3_1","lin_stride_tp_lin_3_0"],"output":["lin_mul_out_tp_lin_3_0"],"attribute":[]},{"opType":"Add","input":["lin_zero_tp_lin_3","lin_mul_out_tp_lin_3_0"],"output":["lin_add_out_tp_lin_3_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_tp_3_0","lin_stride_tp_lin_3_1"],"output":["lin_mul_out_tp_lin_3_1"],"attribute":[]},{"opType":"Add","input":["lin_add_out_tp_lin_3_0","lin_mul_out_tp_lin_3_1"],"output":["lin_add_out_tp_lin_3_1"],"attribute":[]},{"opType":"Unsqueeze","input":["lin_add_out_tp_lin_3_1","axes"],"output":["tp_linU_3_out"],"attribute":[]},{"opType":"Reshape","input":["UU003UU","flat_shape_UU003UU"],"output":["UU003UU_flat"],"attribute":[]},{"opType":"Gather","input":["UU003UU_flat","tp_linU_3_out"],"output":["tp_g_3_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Reshape","input":["tp_g_3_out","tp_scalar_3_shape"],"output":["tp_scalar_3_out"],"attribute":[]},{"opType":"Unsqueeze","input":["tp_scalar_3_out","axes"],"output":["updateUnsq_out"],"attribute":[]},{"opType":"Identity","input":["cond_in"],"output":["cond_out"],"attribute":[]},{"opType":"ScatterElements","input":["carry","unsq_out","updateUnsq_out"],"output":["carry_out"],"attribute":[{"name":"axis","i":0,"type":2}]}],"input":[{"name":"iter","type":{"tensorType":{"elemType":7,"shape":{"dim":[]}}}},{"name":"cond_in","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":756}]}}}}],"output":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":756}]}}}}],"valueInfo":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":756}]}}}},{"name":"UU003UU","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}}]}}]},{"opType":"Reshape","input":["loop_out_2","reshape_shape_3"],"output":["kgpd_transposed0"],"attribute":[]},{"opType":"Loop","input":["trip_count_4","cond_4","init_carry_3"],"output":["loop_out_3"],"attribute":[{"name":"body","type":5,"g":{"name":"loop_body_0","initializer":[],"node":[{"opType":"Constant","input":[],"output":["axes"],"attribute":[{"name":"value","type":4,"t":{"name":"axes","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_kgpd_transposed0_4_1"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_kgpd_transposed0_4_1","dataType":7,"dims":[],"int64Data":[378]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_kgpd_transposed0_4_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_kgpd_transposed0_4_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["lin_zero_gb_lin_kgpd_transposed0_4"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_gb_lin_kgpd_transposed0_4","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_kgpd_transposed0_4_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_kgpd_transposed0_4_0","dataType":7,"dims":[],"int64Data":[378]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_kgpd_transposed0_4_1"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_kgpd_transposed0_4_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["flat_shape_kgpd_transposed0"],"attribute":[{"name":"value","type":4,"t":{"name":"flat_shape_kgpd_transposed0","dataType":7,"dims":[1],"int64Data":[-1]}}]},{"opType":"Constant","input":[],"output":["sg_len_idx_gb_lin_kgpd_transposed0_4"],"attribute":[{"name":"value","type":4,"t":{"name":"sg_len_idx_gb_lin_kgpd_transposed0_4","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_kgpd_Mulcst_4_1"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_kgpd_Mulcst_4_1","dataType":7,"dims":[],"int64Data":[378]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_kgpd_Mulcst_4_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_kgpd_Mulcst_4_0","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["gb_zero_kgpd_Mulcst_4_0"],"attribute":[{"name":"value","type":4,"t":{"name":"gb_zero_kgpd_Mulcst_4_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_zero_gb_lin_kgpd_Mulcst_4"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_gb_lin_kgpd_Mulcst_4","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_kgpd_Mulcst_4_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_kgpd_Mulcst_4_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["sg_len_idx_gb_lin_kgpd_Mulcst_4"],"attribute":[{"name":"value","type":4,"t":{"name":"sg_len_idx_gb_lin_kgpd_Mulcst_4","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Unsqueeze","input":["iter","axes"],"output":["unsq_out"],"attribute":[]},{"opType":"Mod","input":["iter","mr_dim_gb_out_kgpd_transposed0_4_1"],"output":["mr_mod_out_gb_out_kgpd_transposed0_4_1"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_gb_out_kgpd_transposed0_4_1"],"output":["mr_div_out_gb_out_kgpd_transposed0_4_1"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_kgpd_transposed0_4_1","mr_dim_gb_out_kgpd_transposed0_4_0"],"output":["mr_mod_out_gb_out_kgpd_transposed0_4_0"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_kgpd_transposed0_4_1","mr_dim_gb_out_kgpd_transposed0_4_0"],"output":["mr_div_out_gb_out_kgpd_transposed0_4_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_kgpd_transposed0_4_0","lin_stride_gb_lin_kgpd_transposed0_4_0"],"output":["lin_mul_out_gb_lin_kgpd_transposed0_4_0"],"attribute":[]},{"opType":"Add","input":["lin_zero_gb_lin_kgpd_transposed0_4","lin_mul_out_gb_lin_kgpd_transposed0_4_0"],"output":["lin_add_out_gb_lin_kgpd_transposed0_4_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_kgpd_transposed0_4_1","lin_stride_gb_lin_kgpd_transposed0_4_1"],"output":["lin_mul_out_gb_lin_kgpd_transposed0_4_1"],"attribute":[]},{"opType":"Add","input":["lin_add_out_gb_lin_kgpd_transposed0_4_0","lin_mul_out_gb_lin_kgpd_transposed0_4_1"],"output":["lin_add_out_gb_lin_kgpd_transposed0_4_1"],"attribute":[]},{"opType":"Reshape","input":["kgpd_transposed0","flat_shape_kgpd_transposed0"],"output":["kgpd_transposed0_flat"],"attribute":[]},{"opType":"Shape","input":["kgpd_transposed0_flat"],"output":["sg_shape_out_gb_lin_kgpd_transposed0_4"],"attribute":[]},{"opType":"Gather","input":["sg_shape_out_gb_lin_kgpd_transposed0_4","sg_len_idx_gb_lin_kgpd_transposed0_4"],"output":["sg_len_gb_lin_kgpd_transposed0_4_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["lin_add_out_gb_lin_kgpd_transposed0_4_1","sg_len_gb_lin_kgpd_transposed0_4_out"],"output":["Mod_sg_mod_gb_lin_kgpd_transposed0_4_out"],"attribute":[]},{"opType":"Unsqueeze","input":["Mod_sg_mod_gb_lin_kgpd_transposed0_4_out","axes"],"output":["sg_idx_unsq_gb_lin_kgpd_transposed0_4_out"],"attribute":[]},{"opType":"Gather","input":["kgpd_transposed0_flat","sg_idx_unsq_gb_lin_kgpd_transposed0_4_out"],"output":["sg_g_gb_lin_kgpd_transposed0_4_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["iter","mr_dim_gb_out_kgpd_Mulcst_4_1"],"output":["mr_mod_out_gb_out_kgpd_Mulcst_4_1"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_gb_out_kgpd_Mulcst_4_1"],"output":["mr_div_out_gb_out_kgpd_Mulcst_4_1"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_kgpd_Mulcst_4_1","mr_dim_gb_out_kgpd_Mulcst_4_0"],"output":["mr_mod_out_gb_out_kgpd_Mulcst_4_0"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_kgpd_Mulcst_4_1","mr_dim_gb_out_kgpd_Mulcst_4_0"],"output":["mr_div_out_gb_out_kgpd_Mulcst_4_0"],"attribute":[]},{"opType":"Mul","input":["gb_zero_kgpd_Mulcst_4_0","lin_stride_gb_lin_kgpd_Mulcst_4_0"],"output":["lin_mul_out_gb_lin_kgpd_Mulcst_4_0"],"attribute":[]},{"opType":"Add","input":["lin_zero_gb_lin_kgpd_Mulcst_4","lin_mul_out_gb_lin_kgpd_Mulcst_4_0"],"output":["lin_add_out_gb_lin_kgpd_Mulcst_4_0"],"attribute":[]},{"opType":"Shape","input":["kgpd_Mulcst"],"output":["sg_shape_out_gb_lin_kgpd_Mulcst_4"],"attribute":[]},{"opType":"Gather","input":["sg_shape_out_gb_lin_kgpd_Mulcst_4","sg_len_idx_gb_lin_kgpd_Mulcst_4"],"output":["sg_len_gb_lin_kgpd_Mulcst_4_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["lin_add_out_gb_lin_kgpd_Mulcst_4_0","sg_len_gb_lin_kgpd_Mulcst_4_out"],"output":["Mod_sg_mod_gb_lin_kgpd_Mulcst_4_out"],"attribute":[]},{"opType":"Unsqueeze","input":["Mod_sg_mod_gb_lin_kgpd_Mulcst_4_out","axes"],"output":["sg_idx_unsq_gb_lin_kgpd_Mulcst_4_out"],"attribute":[]},{"opType":"Gather","input":["kgpd_Mulcst","sg_idx_unsq_gb_lin_kgpd_Mulcst_4_out"],"output":["sg_g_gb_lin_kgpd_Mulcst_4_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Squeeze","input":["sg_g_gb_lin_kgpd_transposed0_4_out","axes"],"output":["sq_4_in0_scalar_out"],"attribute":[]},{"opType":"Squeeze","input":["sg_g_gb_lin_kgpd_Mulcst_4_out","axes"],"output":["sq_4_in1_scalar_out"],"attribute":[]},{"opType":"Mul","input":["sq_4_in0_scalar_out","sq_4_in1_scalar_out"],"output":["4_out"],"attribute":[]},{"opType":"Unsqueeze","input":["4_out","axes"],"output":["updateUnsq_out"],"attribute":[]},{"opType":"Identity","input":["cond_in"],"output":["cond_out"],"attribute":[]},{"opType":"ScatterElements","input":["carry","unsq_out","updateUnsq_out"],"output":["carry_out"],"attribute":[{"name":"axis","i":0,"type":2}]}],"input":[{"name":"iter","type":{"tensorType":{"elemType":7,"shape":{"dim":[]}}}},{"name":"cond_in","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":756}]}}}}],"output":[{"name":"cond_out",