{
  "ir_version": "7",
  "producer_name": "skl2onnx",
  "producer_version": "1.18.0",
  "domain": "ai.onnx",
  "model_version": "0",
  "doc_string": "",
  "graph": {
    "node": [
      {
        "input": [
          "input",
          "Di_Divcst"
        ],
        "output": [
          "Di_C0"
        ],
        "name": "Di_Div",
        "op_type": "Div",
        "domain": ""
      },
      {
        "input": [
          "Di_Divcst1",
          "Di_Divcst"
        ],
        "output": [
          "Di_C02"
        ],
        "name": "Di_Div1",
        "op_type": "Div",
        "domain": ""
      },
      {
        "input": [
          "Di_C0",
          "Di_C02"
        ],
        "output": [
          "UU000UU",
          "UU001UU"
        ],
        "name": "Sc_Scan",
        "op_type": "Scan",
        "attribute": [
          {
            "name": "body",
            "g": {
              "node": [
                {
                  "input": [
                    "next_in"
                  ],
                  "output": [
                    "next_out"
                  ],
                  "name": "cdistd_1_Identity",
                  "op_type": "Identity",
                  "domain": ""
                },
                {
                  "input": [
                    "next_in",
                    "next"
                  ],
                  "output": [
                    "cdistdf_1_C0"
                  ],
                  "name": "cdistdf_1_Sub",
                  "op_type": "Sub",
                  "domain": ""
                },
                {
                  "input": [
                    "cdistdf_1_C0"
                  ],
                  "output": [
                    "cdistdf_1_reduced0"
                  ],
                  "name": "cdistdf_1_ReduceSumSquare",
                  "op_type": "ReduceSumSquare",
                  "attribute": [
                    {
                      "name": "axes",
                      "ints": [
                        "1"
                      ],
                      "type": "INTS"
                    },
                    {
                      "name": "keepdims",
                      "i": "0",
                      "type": "INT"
                    }
                  ],
                  "domain": ""
                },
                {
                  "input": [
                    "cdistdf_1_reduced0"
                  ],
                  "output": [
                    "scan_out"
                  ],
                  "name": "cdistdf_1_Identity",
                  "op_type": "Identity",
                  "domain": ""
                }
              ],
              "name": "OnnxIdentity",
              "input": [
                {
                  "name": "next_in",
                  "type": {
                    "tensor_type": {
                      "elem_type": 1,
                      "shape": {
                        "dim": [
                          {
                            "dim_value": "33345"
                          },
                          {
                            "dim_value": "2"
                          }
                        ]
                      }
                    }
                  }
                },
                {
                  "name": "next",
                  "type": {
                    "tensor_type": {
                      "elem_type": 1,
                      "shape": {
                        "dim": [
                          {
                            "dim_value": "2"
                          }
                        ]
                      }
                    }
                  }
                }
              ],
              "output": [
                {
                  "name": "next_out",
                  "type": {
                    "tensor_type": {
                      "elem_type": 1,
                      "shape": {
                        "dim": [
                          {
                            "dim_value": "33345"
                          },
                          {
                            "dim_value": "2"
                          }
                        ]
                      }
                    }
                  }
                },
                {
                  "name": "scan_out",
                  "type": {
                    "tensor_type": {
                      "elem_type": 1,
                      "shape": {
                        "dim": [
                          {
                            "dim_value": "1"
                          }
                        ]
                      }
                    }
                  }
                }
              ]
            },
            "type": "GRAPH"
          },
          {
            "name": "num_scan_inputs",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "UU001UU"
        ],
        "output": [
          "kgpd_transposed0"
        ],
        "name": "kgpd_Transpose",
        "op_type": "Transpose",
        "attribute": [
          {
            "name": "perm",
            "ints": [
              "1",
              "0"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "kgpd_transposed0",
          "kgpd_Mulcst"
        ],
        "output": [
          "kgpd_C0"
        ],
        "name": "kgpd_Mul",
        "op_type": "Mul",
        "domain": ""
      },
      {
        "input": [
          "kgpd_C0"
        ],
        "output": [
          "kgpd_Y0"
        ],
        "name": "kgpd_Neg",
        "op_type": "Neg",
        "domain": ""
      },
      {
        "input": [
          "kgpd_Y0"
        ],
        "output": [
          "kgpd_output0"
        ],
        "name": "kgpd_Exp",
        "op_type": "Exp",
        "domain": ""
      },
      {
        "input": [
          "kgpd_output0",
          "gpr_MatMulcst"
        ],
        "output": [
          "gpr_Y0"
        ],
        "name": "gpr_MatMul",
        "op_type": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "gpr_Y0",
          "gpr_Mulcst"
        ],
        "output": [
          "gpr_C01"
        ],
        "name": "gpr_Mul",
        "op_type": "Mul",
        "domain": ""
      },
      {
        "input": [
          "gpr_C01",
          "gpr_Addcst"
        ],
        "output": [
          "gpr_C0"
        ],
        "name": "gpr_Add",
        "op_type": "Add",
        "domain": ""
      },
      {
        "input": [
          "gpr_C0",
          "Re_Reshapecst"
        ],
        "output": [
          "GPmean"
        ],
        "name": "Re_Reshape",
        "op_type": "Reshape",
        "domain": ""
      }
    ],
    "name": "9448b908ddb84e5caa6e97a3ee512a47",
    "initializer": [
      {
        "dims": [
          "2"
        ],
        "data_type": 1,
        "float_data": [
          33.969624,
          118.90387
        ],
        "name": "Di_Divcst"
      },
      {
        "dims": [
          "378",
          "2"
        ],
        "data_type": 1,
        "float_data": [
          0.0,
          0.0,
          9.7,
          0.0,
          19.4,
          0.0,
          29.1,
          0.0,
          38.8,
          0.0,
          48.5,
          0.0,
          58.2,
          0.0,
          67.9,
          0.0,
          77.6,
          0.0,
          87.3,
          0.0,
          97.0,
          0.0,
          106.7,
          0.0,
          116.4,
          0.0,
          126.1,
          0.0,
          135.8,
          0.0,
          145.5,
          0.0,
          155.2,
          0.0,
          164.9,
          0.0,
          174.6,
          0.0,
          184.3,
          0.0,
          194.0,
          0.0,
          0.0,
          10.0,
          9.7,
          10.0,
          19.4,
          10.0,
          29.1,
          10.0,
          38.8,
          10.0,
          48.5,
          10.0,
          58.2,
          10.0,
          67.9,
          10.0,
          77.6,
          10.0,
          87.3,
          10.0,
          97.0,
          10.0,
          106.7,
          10.0,
          116.4,
          10.0,
          126.1,
          10.0,
          135.8,
          10.0,
          145.5,
          10.0,
          155.2,
          10.0,
          164.9,
          10.0,
          174.6,
          10.0,
          184.3,
          10.0,
          194.0,
          10.0,
          0.0,
          20.0,
          9.7,
          20.0,
          19.4,
          20.0,
          29.1,
          20.0,
          38.8,
          20.0,
          48.5,
          20.0,
          58.2,
          20.0,
          67.9,
          20.0,
          77.6,
          20.0,
          87.3,
          20.0,
          97.0,
          20.0,
          106.7,
          20.0,
          116.4,
          20.0,
          126.1,
          20.0,
          135.8,
          20.0,
          145.5,
          20.0,
          155.2,
          20.0,
          164.9,
          20.0,
          174.6,
          20.0,
          184.3,
          20.0,
          194.0,
          20.0,
          0.0,
          30.0,
          9.7,
          30.0,
          19.4,
          30.0,
          29.1,
          30.0,
          38.8,
          30.0,
          48.5,
          30.0,
          58.2,
          30.0,
          67.9,
          30.0,
          77.6,
          30.0,
          87.3,
          30.0,
          97.0,
          30.0,
          106.7,
          30.0,
          116.4,
          30.0,
          126.1,
          30.0,
          135.8,
          30.0,
          145.5,
          30.0,
          155.2,
          30.0,
          164.9,
          30.0,
          174.6,
          30.0,
          184.3,
          30.0,
          194.0,
          30.0,
          0.0,
          40.0,
          9.7,
          40.0,
          19.4,
          40.0,
          29.1,
          40.0,
          38.8,
          40.0,
          48.5,
          40.0,
          58.2,
          40.0,
          67.9,
          40.0,
          77.6,
          40.0,
          87.3,
          40.0,
          97.0,
          40.0,
          106.7,
          40.0,
          116.4,
          40.0,
          126.1,
          40.0,
          135.8,
          40.0,
          145.5,
          40.0,
          155.2,
          40.0,
          164.9,
          40.0,
          174.6,
          40.0,
          184.3,
          40.0,
          194.0,
          40.0,
          0.0,
          50.0,
          9.7,
          50.0,
          19.4,
          50.0,
          29.1,
          50.0,
          38.8,
          50.0,
          48.5,
          50.0,
          58.2,
          50.0,
          67.9,
          50.0,
          77.6,
          50.0,
          87.3,
          50.0,
          97.0,
          50.0,
          106.7,
          50.0,
          116.4,
          50.0,
          126.1,
          50.0,
          135.8,
          50.0,
          145.5,
          50.0,
          155.2,
          50.0,
          164.9,
          50.0,
          174.6,
          50.0,
          184.3,
          50.0,
          194.0,
          50.0,
          0.0,
          60.0,
          9.7,
          60.0,
          19.4,
          60.0,
          29.1,
          60.0,
          38.8,
          60.0,
          48.5,
          60.0,
          58.2,
          60.0,
          67.9,
          60.0,
          77.6,
          60.0,
          87.3,
          60.0,
          97.0,
          60.0,
          106.7,
          60.0,
          116.4,
          60.0,
          126.1,
          60.0,
          135.8,
          60.0,
          145.5,
          60.0,
          155.2,
          60.0,
          164.9,
          60.0,
          174.6,
          60.0,
          184.3,
          60.0,
          194.0,
          60.0,
          0.0,
          70.0,
          9.7,
          70.0,
          19.4,
          70.0,
          29.1,
          70.0,
          38.8,
          70.0,
          48.5,
          70.0,
          58.2,
          70.0,
          67.9,
          70.0,
          77.6,
          70.0,
          87.3,
          70.0,
          97.0,
          70.0,
          106.7,
          70.0,
          116.4,
          70.0,
          126.1,
          70.0,
          135.8,
          70.0,
          145.5,
          70.0,
          155.2,
          70.0,
          164.9,
          70.0,
          174.6,
          70.0,
          184.3,
          70.0,
          194.0,
          70.0,
          0.0,
          80.0,
          9.7,
          80.0,
          19.4,
          80.0,
          29.1,
          80.0,
          38.8,
          80.0,
          48.5,
          80.0,
          58.2,
          80.0,
          67.9,
          80.0,
          77.6,
          80.0,
          87.3,
          80.0,
          97.0,
          80.0,
          106.7,
          80.0,
          116.4,
          80.0,
          126.1,
          80.0,
          135.8,
          80.0,
          145.5,
          80.0,
          155.2,
          80.0,
          164.9,
          80.0,
          174.6,
          80.0,
          184.3,
          80.0,
          194.0,
          80.0,
          0.0,
          90.0,
          9.7,
          90.0,
          19.4,
          90.0,
          29.1,
          90.0,
          38.8,
          90.0,
          48.5,
          90.0,
          58.2,
          90.0,
          67.9,
          90.0,
          77.6,
          90.0,
          87.3,
          90.0,
          97.0,
          90.0,
          106.7,
          90.0,
          116.4,
          90.0,
          126.1,
          90.0,
          135.8,
          90.0,
          145.5,
          90.0,
          155.2,
          90.0,
          164.9,
          90.0,
          174.6,
          90.0,
          184.3,
          90.0,
          194.0,
          90.0,
          0.0,
          100.0,
          9.7,
          100.0,
          19.4,
          100.0,
          29.1,
          100.0,
          38.8,
          100.0,
          48.5,
          100.0,
          58.2,
          100.0,
          67.9,
          100.0,
          77.6,
          100.0,
          87.3,
          100.0,
          97.0,
          100.0,
          106.7,
          100.0,
          116.4,
          100.0,
          126.1,
          100.0,
          135.8,
          100.0,
          145.5,
          100.0,
          155.2,
          100.0,
          164.9,
          100.0,
          174.6,
          100.0,
          184.3,
          100.0,
          194.0,
          100.0,
          0.0,
          110.0,
          9.7,
          110.0,
          19.4,
          110.0,
          29.1,
          110.0,
          38.8,
          110.0,
          48.5,
          110.0,
          58.2,
          110.0,
          67.9,
          110.0,
          77.6,
          110.0,
          87.3,
          110.0,
          97.0,
          110.0,
          106.7,
          110.0,
          116.4,
          110.0,
          126.1,
          110.0,
          135.8,
          110.0,
          145.5,
          110.0,
          155.2,
          110.0,
          164.9,
          110.0,
          174.6,
          110.0,
          184.3,
          110.0,
          194.0,
          110.0,
          0.0,
          120.0,
          9.7,
          120.0,
          19.4,
          120.0,
          29.1,
          120.0,
          38.8,
          120.0,
          48.5,
          120.0,
          58.2,
          120.0,
          67.9,
          120.0,
          77.6,
          120.0,
          87.3,
          120.0,
          97.0,
          120.0,
          106.7,
          120.0,
          116.4,
          120.0,
          126.1,
          120.0,
          135.8,
          120.0,
          145.5,
          120.0,
          155.2,
          120.0,
          164.9,
          120.0,
          174.6,
          120.0,
          184.3,
          120.0,
          194.0,
          120.0,
          0.0,
          130.0,
          9.7,
          130.0,
          19.4,
          130.0,
          29.1,
          130.0,
          38.8,
          130.0,
          48.5,
          130.0,
          58.2,
          130.0,
          67.9,
          130.0,
          77.6,
          130.0,
          87.3,
          130.0,
          97.0,
          130.0,
          106.7,
          130.0,
          116.4,
          130.0,
          126.1,
          130.0,
          135.8,
          130.0,
          145.5,
          130.0,
          155.2,
          130.0,
          164.9,
          130.0,
          174.6,
          130.0,
          184.3,
          130.0,
          194.0,
          130.0,
          0.0,
          140.0,
          9.7,
          140.0,
          19.4,
          140.0,
          29.1,
          140.0,
          38.8,
          140.0,
          48.5,
          140.0,
          58.2,
          140.0,
          67.9,
          140.0,
          77.6,
          140.0,
          87.3,
          140.0,
          97.0,
          140.0,
          106.7,
          140.0,
          116.4,
          140.0,
          126.1,
          140.0,
          135.8,
          140.0,
          145.5,
          140.0,
          155.2,
          140.0,
          164.9,
          140.0,
          174.6,
          140.0,
          184.3,
          140.0,
          194.0,
          140.0,
          0.0,
          150.0,
          9.7,
          150.0,
          19.4,
          150.0,
          29.1,
          150.0,
          38.8,
          150.0,
          48.5,
          150.0,
          58.2,
          150.0,
          67.9,
          150.0,
          77.6,
          150.0,
          87.3,
          150.0,
          97.0,
          150.0,
          106.7,
          150.0,
          116.4,
          150.0,
          126.1,
          150.0,
          135.8,
          150.0,
          145.5,
          150.0,
          155.2,
          150.0,
          164.9,
          150.0,
          174.6,
          150.0,
          184.3,
          150.0,
          194.0,
          150.0,
          0.0,
          160.0,
          9.7,
          160.0,
          19.4,
          160.0,
          29.1,
          160.0,
          38.8,
          160.0,
          48.5,
          160.0,
          58.2,
          160.0,
          67.9,
          160.0,
          77.6,
          160.0,
          87.3,
          160.0,
          97.0,
          160.0,
          106.7,
          160.0,
          116.4,
          160.0,
          126.1,
          160.0,
          135.8,
          160.0,
          145.5,
          160.0,
          155.2,
          160.0,
          164.9,
          160.0,
          174.6,
          160.0,
          184.3,
          160.0,
          194.0,
          160.0,
          0.0,
          170.0,
          9.7,
          170.0,
          19.4,
          170.0,
          29.1,
          170.0,
          38.8,
          170.0,
          48.5,
          170.0,
          58.2,
          170.0,
          67.9,
          170.0,
          77.6,
          170.0,
          87.3,
          170.0,
          97.0,
          170.0,
          106.7,
          170.0,
          116.4,
          170.0,
          126.1,
          170.0,
          135.8,
          170.0,
          145.5,
          170.0,
          155.2,
          170.0,
          164.9,
          170.0,
          174.6,
          170.0,
          184.3,
          170.0,
          194.0,
          170.0
        ],
        "name": "Di_Divcst1"
      },
      {
        "dims": [
          "1"
        ],
        "data_type": 1,
        "float_data": [
          0.5
        ],
        "name": "kgpd_Mulcst"
      },
      {
        "dims": [
          "378"
        ],
        "data_type": 1,
        "float_data": [
          0.09382591,
          0.11148852,
          0.09724469,
          0.08246379,
          0.0862181,
          0.10557746,
          0.12662777,
          0.13337922,
          0.10507941,
          0.024128646,
          -0.09094042,
          -0.16472489,
          -0.11223525,
          0.063783675,
          0.2371713,
          0.26446006,
          0.14666992,
          0.057698537,
          0.1769076,
          0.4940334,
          0.79972446,
          0.082562916,
          0.09486474,
          0.076526225,
          0.061320793,
          0.06764795,
          0.08959391,
          0.11112902,
          0.11700047,
          0.08875047,
          0.0101453,
          -0.10027808,
          -0.16719136,
          -0.106255524,
          0.07534723,
          0.24196632,
          0.24113315,
          0.07482189,
          -0.06843928,
          0.011327436,
          0.31722286,
          0.63876903,
          0.0666573,
          0.07252927,
          0.04937245,
          0.033476148,
          0.042595223,
          0.06778075,
          0.090806045,
          0.097130686,
          0.070631705,
          -0.0036616744,
          -0.107762225,
          -0.16736643,
          -0.09936993,
          0.0853769,
          0.24385795,
          0.21649463,
          0.005884457,
          -0.18761903,
          -0.14656672,
          0.14464872,
          0.47646433,
          0.04800677,
          0.04676499,
          0.018230285,
          0.0012881684,
          0.013165828,
          0.041967772,
          0.06726681,
          0.07517824,
          0.051870693,
          -0.016510868,
          -0.11306212,
          -0.16539672,
          -0.09211962,
          0.09326166,
          0.24287526,
          0.19224997,
          -0.0557927,
          -0.2925073,
          -0.28707582,
          -0.013023765,
          0.32284334,
          0.028807526,
          0.020223608,
          -0.014038768,
          -0.032459725,
          -0.018133981,
          0.014333449,
          0.042399187,
          0.05275026,
          0.033721365,
          -0.02761086,
          -0.11591489,
          -0.16152652,
          -0.085118674,
          0.09835061,
          0.23896046,
          0.16982521,
          -0.10644687,
          -0.3766487,
          -0.4015043,
          -0.14603136,
          0.18730314,
          0.011359205,
          -0.004301824,
          -0.044396993,
          -0.06478567,
          -0.04859733,
          -0.012762632,
          0.018234834,
          0.03154795,
          0.01747468,
          -0.036188938,
          -0.116111696,
          -0.1560466,
          -0.07898112,
          0.1000156,
          0.23196714,
          0.15023033,
          -0.14323847,
          -0.4350261,
          -0.48290563,
          -0.24634731,
          0.07780126,
          -0.0021518415,
          -0.024131296,
          -0.06989899,
          -0.0927669,
          -0.07554559,
          -0.036972955,
          -0.0032080472,
          0.013246097,
          0.0043793046,
          -0.04152376,
          -0.11348279,
          -0.14923884,
          -0.07424215,
          0.097723804,
          0.22168083,
          0.1339691,
          -0.1645071,
          -0.46450844,
          -0.5266969,
          -0.30838692,
          0.00016014597,
          -0.009869123,
          -0.03695394,
          -0.08796437,
          -0.113803945,
          -0.09656537,
          -0.056164023,
          -0.020090418,
          -0.0006350765,
          -0.004444101,
          -0.042983156,
          -0.107887164,
          -0.14132589,
          -0.07128453,
          0.09111054,
          0.20785898,
          0.12100558,
          -0.16991948,
          -0.46413788,
          -0.5310768,
          -0.329509,
          -0.042445287,
          -0.010459528,
          -0.041059233,
          -0.09662681,
          -0.12586468,
          -0.10973069,
          -0.06860836,
          -0.030912362,
          -0.008855955,
          -0.0080899885,
          -0.0400672,
          -0.0992118,
          -0.13243516,
          -0.07028121,
          0.080042474,
          0.19028433,
          0.110790275,
          -0.16049248,
          -0.4352239,
          -0.49719998,
          -0.3102576,
          -0.04976158,
          -0.0032623077,
          -0.03551815,
          -0.09473279,
          -0.12768325,
          -0.113787465,
          -0.07314759,
          -0.03465236,
          -0.01057058,
          -0.0059500216,
          -0.03245483,
          -0.08738353,
          -0.122583516,
          -0.071163416,
          0.064660996,
          0.16882378,
          0.10234183,
          -0.13848911,
          -0.38123292,
          -0.42908776,
          -0.25431657,
          -0.024460802,
          0.011623744,
          -0.020293768,
          -0.082068205,
          -0.11889168,
          -0.10828095,
          -0.06930974,
          -0.030871812,
          -0.0054158014,
          0.0022172995,
          -0.02005044,
          -0.072393745,
          -0.11168654,
          -0.07362001,
          0.045398533,
          0.14348342,
          0.09437365,
          -0.10719839,
          -0.30748352,
          -0.33328116,
          -0.16817878,
          0.02812652,
          0.033325825,
          0.0037320247,
          -0.059397828,
          -0.10006975,
          -0.09361157,
          -0.0573676,
          -0.019773219,
          0.006433422,
          0.016237382,
          -0.0030250011,
          -0.054332893,
          -0.099591345,
          -0.077129364,
          0.022963457,
          0.114450864,
          0.085449524,
          -0.07062348,
          -0.22067933,
          -0.21827263,
          -0.060564622,
          0.10052164,
          0.06025844,
          0.034820087,
          -0.02841226,
          -0.07270615,
          -0.07101222,
          -0.038330663,
          -0.0022042145,
          0.02425033,
          0.035498004,
          0.018154936,
          -0.03342912,
          -0.08612816,
          -0.08102049,
          -0.0017061158,
          0.08211834,
          0.074150026,
          -0.03311167,
          -0.12832713,
          -0.09377395,
          0.058350425,
          0.18379654,
          0.0902552,
          0.07051858,
          0.00841337,
          -0.039074037,
          -0.042447846,
          -0.013869613,
          0.020395324,
          0.046788663,
          0.058961198,
          0.04271714,
          -0.010083326,
          -0.07117243,
          -0.08455535,
          -0.027515084,
          0.047082365,
          0.059230544,
          0.0010350136,
          -0.0381006,
          0.030104548,
          0.17781901,
          0.26838773,
          0.12075802,
          0.1078762,
          0.048034977,
          -0.0020330043,
          -0.010446557,
          0.013820631,
          0.0461003,
          0.07236109,
          0.08521152,
          0.06959815,
          0.015107678,
          -0.054706916,
          -0.0870213,
          -0.053302336,
          0.01011983,
          0.03975441,
          0.027928969,
          0.042787455,
          0.14368159,
          0.28742665,
          0.34494066,
          0.14904436,
          0.14370228,
          0.08710741,
          0.035222746,
          0.02212126,
          0.04220692,
          0.07265312,
          0.09895924,
          0.112540014,
          0.09748566,
          0.041347235,
          -0.036872946,
          -0.08782099,
          -0.077939,
          -0.027856713,
          0.015188194,
          0.0444108,
          0.10814427,
          0.23845965,
          0.37792933,
          0.40510008,
          0.17246914,
          0.17484729,
          0.12227744,
          0.06944442,
          0.05229399,
          0.06863523,
          0.09764871,
          0.124406084,
          0.1390591,
          0.12488878,
          0.06765902,
          -0.018001584,
          -0.0865475,
          -0.10042212,
          -0.06585856,
          -0.014548227,
          0.04828025,
          0.15323791,
          0.30773872,
          0.44194672,
          0.44217172,
          0.18869688,
          0.19847524,
          0.1504723,
          0.09760892,
          0.07727509,
          0.09055842,
          0.11873463,
          0.1465276,
          0.16283971,
          0.1502325,
          0.09293279,
          0.0013816962,
          -0.08303461,
          -0.1199527,
          -0.10288758,
          -0.049078614,
          0.038427584,
          0.1750854,
          0.347039,
          0.47445282,
          0.45159766
        ],
        "name": "gpr_MatMulcst"
      },
      {
        "dims": [
          "1"
        ],
        "data_type": 1,
        "float_data": [
          0.4177344
        ],
        "name": "gpr_Mulcst"
      },
      {
        "dims": [
          "1"
        ],
        "data_type": 1,
        "float_data": [
          -0.47441134
        ],
        "name": "gpr_Addcst"
      },
      {
        "dims": [
          "2"
        ],
        "data_type": 7,
        "int64_data": [
          "-1",
          "1"
        ],
        "name": "Re_Reshapecst"
      }
    ],
    "input": [
      {
        "name": "input",
        "type": {
          "tensor_type": {
            "elem_type": 1,
            "shape": {
              "dim": [
                {
                  "dim_value": "33345"
                },
                {
                  "dim_value": "2"
                }
              ]
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "GPmean",
        "type": {
          "tensor_type": {
            "elem_type": 1,
            "shape": {
              "dim": [
                {
                  "dim_value": "33345"
                },
                {
                  "dim_value": "1"
                }
              ]
            }
          }
        }
      }
    ],
    "value_info": [
      {
        "name": "Di_C0",
        "type": {
          "tensor_type": {
            "elem_type": 1,
            "shape": {
              "dim": [
                {
                  "dim_value": "33345"
                },
                {
                  "dim_value": "2"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Di_C02",
        "type": {
          "tensor_type": {
            "elem_type": 1,
            "shape": {
              "dim": [
                {
                  "dim_value": "378"
                },
                {
                  "dim_value": "2"
                }
              ]
            }
          }
        }
      },
      {
        "name": "UU000UU",
        "type": {
          "tensor_type": {
            "elem_type": 1,
            "shape": {
              "dim": [
                {
                  "dim_value": "33345"
                },
                {
                  "dim_value": "2"
                }
              ]
            }
          }
        }
      },
      {
        "name": "UU001UU",
        "type": {
          "tensor_type": {
            "elem_type": 1,
            "shape": {
              "dim": [
                {
                  "dim_value": "378"
                },
                {
                  "dim_value": "33345"
                }
              ]
            }
          }
        }
      }
    ]
  },
  "opset_import": [
    {
      "domain": "",
      "version": "12"
    }
  ]
}