{
  "ir_version": "7",
  "producer_name": "skl2onnx",
  "producer_version": "1.18.0",
  "domain": "ai.onnx",
  "model_version": "0",
  "doc_string": "",
  "graph": {
    "node": [
      {
        "input": [
          "input",
          "Di_Divcst"
        ],
        "output": [
          "Di_C0"
        ],
        "name": "Di_Div",
        "op_type": "Div",
        "domain": ""
      },
      {
        "input": [
          "Di_Divcst1",
          "Di_Divcst"
        ],
        "output": [
          "Di_C02"
        ],
        "name": "Di_Div1",
        "op_type": "Div",
        "domain": ""
      },
      {
        "input": [
          "Di_C0",
          "Di_C02"
        ],
        "output": [
          "UU000UU",
          "UU001UU"
        ],
        "name": "Sc_Scan",
        "op_type": "Scan",
        "attribute": [
          {
            "name": "body",
            "g": {
              "node": [
                {
                  "input": [
                    "next_in"
                  ],
                  "output": [
                    "next_out"
                  ],
                  "name": "cdistd_1_Identity",
                  "op_type": "Identity",
                  "domain": ""
                },
                {
                  "input": [
                    "next_in",
                    "next"
                  ],
                  "output": [
                    "cdistdf_1_C0"
                  ],
                  "name": "cdistdf_1_Sub",
                  "op_type": "Sub",
                  "domain": ""
                },
                {
                  "input": [
                    "cdistdf_1_C0"
                  ],
                  "output": [
                    "cdistdf_1_reduced0"
                  ],
                  "name": "cdistdf_1_ReduceSumSquare",
                  "op_type": "ReduceSumSquare",
                  "attribute": [
                    {
                      "name": "axes",
                      "ints": [
                        "1"
                      ],
                      "type": "INTS"
                    },
                    {
                      "name": "keepdims",
                      "i": "0",
                      "type": "INT"
                    }
                  ],
                  "domain": ""
                },
                {
                  "input": [
                    "cdistdf_1_reduced0"
                  ],
                  "output": [
                    "scan_out"
                  ],
                  "name": "cdistdf_1_Identity",
                  "op_type": "Identity",
                  "domain": ""
                }
              ],
              "name": "OnnxIdentity",
              "input": [
                {
                  "name": "next_in",
                  "type": {
                    "tensor_type": {
                      "elem_type": 1,
                      "shape": {
                        "dim": [
                          {
                            "dim_value": "33345"
                          },
                          {
                            "dim_value": "2"
                          }
                        ]
                      }
                    }
                  }
                },
                {
                  "name": "next",
                  "type": {
                    "tensor_type": {
                      "elem_type": 1,
                      "shape": {
                        "dim": [
                          {
                            "dim_value": "2"
                          }
                        ]
                      }
                    }
                  }
                }
              ],
              "output": [
                {
                  "name": "next_out",
                  "type": {
                    "tensor_type": {
                      "elem_type": 1,
                      "shape": {
                        "dim": [
                          {
                            "dim_value": "33345"
                          },
                          {
                            "dim_value": "2"
                          }
                        ]
                      }
                    }
                  }
                },
                {
                  "name": "scan_out",
                  "type": {
                    "tensor_type": {
                      "elem_type": 1,
                      "shape": {
                        "dim": [
                          {
                            "dim_value": "1"
                          }
                        ]
                      }
                    }
                  }
                }
              ]
            },
            "type": "GRAPH"
          },
          {
            "name": "num_scan_inputs",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "UU001UU"
        ],
        "output": [
          "kgpd_transposed0"
        ],
        "name": "kgpd_Transpose",
        "op_type": "Transpose",
        "attribute": [
          {
            "name": "perm",
            "ints": [
              "1",
              "0"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "kgpd_transposed0",
          "kgpd_Mulcst"
        ],
        "output": [
          "kgpd_C0"
        ],
        "name": "kgpd_Mul",
        "op_type": "Mul",
        "domain": ""
      },
      {
        "input": [
          "kgpd_C0"
        ],
        "output": [
          "kgpd_Y0"
        ],
        "name": "kgpd_Neg",
        "op_type": "Neg",
        "domain": ""
      },
      {
        "input": [
          "kgpd_Y0"
        ],
        "output": [
          "kgpd_output0"
        ],
        "name": "kgpd_Exp",
        "op_type": "Exp",
        "domain": ""
      },
      {
        "input": [
          "kgpd_output0",
          "gpr_MatMulcst"
        ],
        "output": [
          "gpr_Y0"
        ],
        "name": "gpr_MatMul",
        "op_type": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "gpr_Y0",
          "gpr_Mulcst"
        ],
        "output": [
          "gpr_C01"
        ],
        "name": "gpr_Mul",
        "op_type": "Mul",
        "domain": ""
      },
      {
        "input": [
          "gpr_C01",
          "gpr_Addcst"
        ],
        "output": [
          "gpr_C0"
        ],
        "name": "gpr_Add",
        "op_type": "Add",
        "domain": ""
      },
      {
        "input": [
          "gpr_C0",
          "Re_Reshapecst"
        ],
        "output": [
          "GPmean"
        ],
        "name": "Re_Reshape",
        "op_type": "Reshape",
        "domain": ""
      }
    ],
    "name": "d01bac201d5e4bab8d23135161c5d6ab",
    "initializer": [
      {
        "dims": [
          "2"
        ],
        "data_type": 1,
        "float_data": [
          35.994205,
          36.081753
        ],
        "name": "Di_Divcst"
      },
      {
        "dims": [
          "378",
          "2"
        ],
        "data_type": 1,
        "float_data": [
          0.0,
          0.0,
          9.7,
          0.0,
          19.4,
          0.0,
          29.1,
          0.0,
          38.8,
          0.0,
          48.5,
          0.0,
          58.2,
          0.0,
          67.9,
          0.0,
          77.6,
          0.0,
          87.3,
          0.0,
          97.0,
          0.0,
          106.7,
          0.0,
          116.4,
          0.0,
          126.1,
          0.0,
          135.8,
          0.0,
          145.5,
          0.0,
          155.2,
          0.0,
          164.9,
          0.0,
          174.6,
          0.0,
          184.3,
          0.0,
          194.0,
          0.0,
          0.0,
          10.0,
          9.7,
          10.0,
          19.4,
          10.0,
          29.1,
          10.0,
          38.8,
          10.0,
          48.5,
          10.0,
          58.2,
          10.0,
          67.9,
          10.0,
          77.6,
          10.0,
          87.3,
          10.0,
          97.0,
          10.0,
          106.7,
          10.0,
          116.4,
          10.0,
          126.1,
          10.0,
          135.8,
          10.0,
          145.5,
          10.0,
          155.2,
          10.0,
          164.9,
          10.0,
          174.6,
          10.0,
          184.3,
          10.0,
          194.0,
          10.0,
          0.0,
          20.0,
          9.7,
          20.0,
          19.4,
          20.0,
          29.1,
          20.0,
          38.8,
          20.0,
          48.5,
          20.0,
          58.2,
          20.0,
          67.9,
          20.0,
          77.6,
          20.0,
          87.3,
          20.0,
          97.0,
          20.0,
          106.7,
          20.0,
          116.4,
          20.0,
          126.1,
          20.0,
          135.8,
          20.0,
          145.5,
          20.0,
          155.2,
          20.0,
          164.9,
          20.0,
          174.6,
          20.0,
          184.3,
          20.0,
          194.0,
          20.0,
          0.0,
          30.0,
          9.7,
          30.0,
          19.4,
          30.0,
          29.1,
          30.0,
          38.8,
          30.0,
          48.5,
          30.0,
          58.2,
          30.0,
          67.9,
          30.0,
          77.6,
          30.0,
          87.3,
          30.0,
          97.0,
          30.0,
          106.7,
          30.0,
          116.4,
          30.0,
          126.1,
          30.0,
          135.8,
          30.0,
          145.5,
          30.0,
          155.2,
          30.0,
          164.9,
          30.0,
          174.6,
          30.0,
          184.3,
          30.0,
          194.0,
          30.0,
          0.0,
          40.0,
          9.7,
          40.0,
          19.4,
          40.0,
          29.1,
          40.0,
          38.8,
          40.0,
          48.5,
          40.0,
          58.2,
          40.0,
          67.9,
          40.0,
          77.6,
          40.0,
          87.3,
          40.0,
          97.0,
          40.0,
          106.7,
          40.0,
          116.4,
          40.0,
          126.1,
          40.0,
          135.8,
          40.0,
          145.5,
          40.0,
          155.2,
          40.0,
          164.9,
          40.0,
          174.6,
          40.0,
          184.3,
          40.0,
          194.0,
          40.0,
          0.0,
          50.0,
          9.7,
          50.0,
          19.4,
          50.0,
          29.1,
          50.0,
          38.8,
          50.0,
          48.5,
          50.0,
          58.2,
          50.0,
          67.9,
          50.0,
          77.6,
          50.0,
          87.3,
          50.0,
          97.0,
          50.0,
          106.7,
          50.0,
          116.4,
          50.0,
          126.1,
          50.0,
          135.8,
          50.0,
          145.5,
          50.0,
          155.2,
          50.0,
          164.9,
          50.0,
          174.6,
          50.0,
          184.3,
          50.0,
          194.0,
          50.0,
          0.0,
          60.0,
          9.7,
          60.0,
          19.4,
          60.0,
          29.1,
          60.0,
          38.8,
          60.0,
          48.5,
          60.0,
          58.2,
          60.0,
          67.9,
          60.0,
          77.6,
          60.0,
          87.3,
          60.0,
          97.0,
          60.0,
          106.7,
          60.0,
          116.4,
          60.0,
          126.1,
          60.0,
          135.8,
          60.0,
          145.5,
          60.0,
          155.2,
          60.0,
          164.9,
          60.0,
          174.6,
          60.0,
          184.3,
          60.0,
          194.0,
          60.0,
          0.0,
          70.0,
          9.7,
          70.0,
          19.4,
          70.0,
          29.1,
          70.0,
          38.8,
          70.0,
          48.5,
          70.0,
          58.2,
          70.0,
          67.9,
          70.0,
          77.6,
          70.0,
          87.3,
          70.0,
          97.0,
          70.0,
          106.7,
          70.0,
          116.4,
          70.0,
          126.1,
          70.0,
          135.8,
          70.0,
          145.5,
          70.0,
          155.2,
          70.0,
          164.9,
          70.0,
          174.6,
          70.0,
          184.3,
          70.0,
          194.0,
          70.0,
          0.0,
          80.0,
          9.7,
          80.0,
          19.4,
          80.0,
          29.1,
          80.0,
          38.8,
          80.0,
          48.5,
          80.0,
          58.2,
          80.0,
          67.9,
          80.0,
          77.6,
          80.0,
          87.3,
          80.0,
          97.0,
          80.0,
          106.7,
          80.0,
          116.4,
          80.0,
          126.1,
          80.0,
          135.8,
          80.0,
          145.5,
          80.0,
          155.2,
          80.0,
          164.9,
          80.0,
          174.6,
          80.0,
          184.3,
          80.0,
          194.0,
          80.0,
          0.0,
          90.0,
          9.7,
          90.0,
          19.4,
          90.0,
          29.1,
          90.0,
          38.8,
          90.0,
          48.5,
          90.0,
          58.2,
          90.0,
          67.9,
          90.0,
          77.6,
          90.0,
          87.3,
          90.0,
          97.0,
          90.0,
          106.7,
          90.0,
          116.4,
          90.0,
          126.1,
          90.0,
          135.8,
          90.0,
          145.5,
          90.0,
          155.2,
          90.0,
          164.9,
          90.0,
          174.6,
          90.0,
          184.3,
          90.0,
          194.0,
          90.0,
          0.0,
          100.0,
          9.7,
          100.0,
          19.4,
          100.0,
          29.1,
          100.0,
          38.8,
          100.0,
          48.5,
          100.0,
          58.2,
          100.0,
          67.9,
          100.0,
          77.6,
          100.0,
          87.3,
          100.0,
          97.0,
          100.0,
          106.7,
          100.0,
          116.4,
          100.0,
          126.1,
          100.0,
          135.8,
          100.0,
          145.5,
          100.0,
          155.2,
          100.0,
          164.9,
          100.0,
          174.6,
          100.0,
          184.3,
          100.0,
          194.0,
          100.0,
          0.0,
          110.0,
          9.7,
          110.0,
          19.4,
          110.0,
          29.1,
          110.0,
          38.8,
          110.0,
          48.5,
          110.0,
          58.2,
          110.0,
          67.9,
          110.0,
          77.6,
          110.0,
          87.3,
          110.0,
          97.0,
          110.0,
          106.7,
          110.0,
          116.4,
          110.0,
          126.1,
          110.0,
          135.8,
          110.0,
          145.5,
          110.0,
          155.2,
          110.0,
          164.9,
          110.0,
          174.6,
          110.0,
          184.3,
          110.0,
          194.0,
          110.0,
          0.0,
          120.0,
          9.7,
          120.0,
          19.4,
          120.0,
          29.1,
          120.0,
          38.8,
          120.0,
          48.5,
          120.0,
          58.2,
          120.0,
          67.9,
          120.0,
          77.6,
          120.0,
          87.3,
          120.0,
          97.0,
          120.0,
          106.7,
          120.0,
          116.4,
          120.0,
          126.1,
          120.0,
          135.8,
          120.0,
          145.5,
          120.0,
          155.2,
          120.0,
          164.9,
          120.0,
          174.6,
          120.0,
          184.3,
          120.0,
          194.0,
          120.0,
          0.0,
          130.0,
          9.7,
          130.0,
          19.4,
          130.0,
          29.1,
          130.0,
          38.8,
          130.0,
          48.5,
          130.0,
          58.2,
          130.0,
          67.9,
          130.0,
          77.6,
          130.0,
          87.3,
          130.0,
          97.0,
          130.0,
          106.7,
          130.0,
          116.4,
          130.0,
          126.1,
          130.0,
          135.8,
          130.0,
          145.5,
          130.0,
          155.2,
          130.0,
          164.9,
          130.0,
          174.6,
          130.0,
          184.3,
          130.0,
          194.0,
          130.0,
          0.0,
          140.0,
          9.7,
          140.0,
          19.4,
          140.0,
          29.1,
          140.0,
          38.8,
          140.0,
          48.5,
          140.0,
          58.2,
          140.0,
          67.9,
          140.0,
          77.6,
          140.0,
          87.3,
          140.0,
          97.0,
          140.0,
          106.7,
          140.0,
          116.4,
          140.0,
          126.1,
          140.0,
          135.8,
          140.0,
          145.5,
          140.0,
          155.2,
          140.0,
          164.9,
          140.0,
          174.6,
          140.0,
          184.3,
          140.0,
          194.0,
          140.0,
          0.0,
          150.0,
          9.7,
          150.0,
          19.4,
          150.0,
          29.1,
          150.0,
          38.8,
          150.0,
          48.5,
          150.0,
          58.2,
          150.0,
          67.9,
          150.0,
          77.6,
          150.0,
          87.3,
          150.0,
          97.0,
          150.0,
          106.7,
          150.0,
          116.4,
          150.0,
          126.1,
          150.0,
          135.8,
          150.0,
          145.5,
          150.0,
          155.2,
          150.0,
          164.9,
          150.0,
          174.6,
          150.0,
          184.3,
          150.0,
          194.0,
          150.0,
          0.0,
          160.0,
          9.7,
          160.0,
          19.4,
          160.0,
          29.1,
          160.0,
          38.8,
          160.0,
          48.5,
          160.0,
          58.2,
          160.0,
          67.9,
          160.0,
          77.6,
          160.0,
          87.3,
          160.0,
          97.0,
          160.0,
          106.7,
          160.0,
          116.4,
          160.0,
          126.1,
          160.0,
          135.8,
          160.0,
          145.5,
          160.0,
          155.2,
          160.0,
          164.9,
          160.0,
          174.6,
          160.0,
          184.3,
          160.0,
          194.0,
          160.0,
          0.0,
          170.0,
          9.7,
          170.0,
          19.4,
          170.0,
          29.1,
          170.0,
          38.8,
          170.0,
          48.5,
          170.0,
          58.2,
          170.0,
          67.9,
          170.0,
          77.6,
          170.0,
          87.3,
          170.0,
          97.0,
          170.0,
          106.7,
          170.0,
          116.4,
          170.0,
          126.1,
          170.0,
          135.8,
          170.0,
          145.5,
          170.0,
          155.2,
          170.0,
          164.9,
          170.0,
          174.6,
          170.0,
          184.3,
          170.0,
          194.0,
          170.0
        ],
        "name": "Di_Divcst1"
      },
      {
        "dims": [
          "1"
        ],
        "data_type": 1,
        "float_data": [
          0.5
        ],
        "name": "kgpd_Mulcst"
      },
      {
        "dims": [
          "378"
        ],
        "data_type": 1,
        "float_data": [
          0.21552542,
          0.21145055,
          0.17876372,
          0.12931392,
          0.0713818,
          0.00602497,
          -0.06643449,
          -0.13589573,
          -0.17945328,
          -0.17213562,
          -0.10559009,
          -0.00034182623,
          0.09992726,
          0.15095153,
          0.133268,
          0.06331339,
          -0.01742466,
          -0.06775543,
          -0.06961795,
          -0.034256026,
          0.00986125,
          0.2781318,
          0.2754133,
          0.24653824,
          0.20572238,
          0.16080786,
          0.10941053,
          0.047168758,
          -0.019162737,
          -0.06712701,
          -0.06985257,
          -0.016817804,
          0.072119296,
          0.15260954,
          0.18050542,
          0.13952287,
          0.052468438,
          -0.03249519,
          -0.07152392,
          -0.05059864,
          0.009538326,
          0.07013356,
          0.22340564,
          0.20726101,
          0.17554285,
          0.14462501,
          0.12069334,
          0.09640488,
          0.061013535,
          0.015741274,
          -0.02008218,
          -0.020092461,
          0.027457438,
          0.10457027,
          0.16898875,
          0.17937812,
          0.12361182,
          0.02957017,
          -0.05060133,
          -0.072828844,
          -0.027957756,
          0.054786973,
          0.12841621,
          0.078032896,
          0.03931022,
          -0.00054149196,
          -0.024391232,
          -0.028622504,
          -0.025181407,
          -0.03000025,
          -0.04659333,
          -0.059314065,
          -0.04402021,
          0.010551587,
          0.08765824,
          0.14767401,
          0.15269747,
          0.0942221,
          0.0032235477,
          -0.066554785,
          -0.07197745,
          -0.007718609,
          0.09136105,
          0.17321119,
          -0.078284234,
          -0.13354877,
          -0.1780857,
          -0.19705299,
          -0.1901896,
          -0.17186332,
          -0.15903215,
          -0.15589827,
          -0.1483888,
          -0.11487086,
          -0.046308916,
          0.039972935,
          0.10574199,
          0.115568444,
          0.063193336,
          -0.019193687,
          -0.077789985,
          -0.07039385,
          0.006535086,
          0.1157928,
          0.20315608,
          -0.1588255,
          -0.20832328,
          -0.2428675,
          -0.25406495,
          -0.24588399,
          -0.23222731,
          -0.22568342,
          -0.22553001,
          -0.21547449,
          -0.1751785,
          -0.09858527,
          -0.00511036,
          0.06697315,
          0.083424106,
          0.038802803,
          -0.035018433,
          -0.0851452,
          -0.06988599,
          0.014494355,
          0.13108909,
          0.22530735,
          -0.1250968,
          -0.14090763,
          -0.1458631,
          -0.14156395,
          -0.1369556,
          -0.14338925,
          -0.16520083,
          -0.19257075,
          -0.20371568,
          -0.17762478,
          -0.11026887,
          -0.02275391,
          0.04661511,
          0.0641936,
          0.023999581,
          -0.044194397,
          -0.089695685,
          -0.07121806,
          0.016806377,
          0.13999218,
          0.24469091,
          -0.011966426,
          0.022221278,
          0.05873114,
          0.085279875,
          0.08811582,
          0.058839537,
          0.0015364117,
          -0.06485551,
          -0.112623505,
          -0.11864555,
          -0.07841807,
          -0.011867795,
          0.044706415,
          0.058413375,
          0.020806601,
          -0.043483224,
          -0.0883991,
          -0.073368415,
          0.011125947,
          0.1365329,
          0.25261793,
          0.09700913,
          0.17324919,
          0.24458817,
          0.29161042,
          0.29775882,
          0.25661528,
          0.17686686,
          0.08168995,
          0.001293084,
          -0.039301552,
          -0.032107066,
          0.008561146,
          0.051676814,
          0.065260306,
          0.035248477,
          -0.023619443,
          -0.073514074,
          -0.074734025,
          -0.010096865,
          0.103521645,
          0.22431092,
          0.12764826,
          0.2150864,
          0.29546568,
          0.34934995,
          0.36139622,
          0.32605052,
          0.25071406,
          0.15489343,
          0.06502273,
          0.0059299413,
          -0.008755846,
          0.016404772,
          0.058588877,
          0.08616764,
          0.07531074,
          0.02526716,
          -0.03816616,
          -0.075595945,
          -0.056829564,
          0.020960374,
          0.13157687,
          0.06551122,
          0.12628864,
          0.18235992,
          0.22213037,
          0.23641904,
          0.22045448,
          0.17543112,
          0.109880716,
          0.040106647,
          -0.0123124095,
          -0.027656432,
          0.0014319561,
          0.061692502,
          0.12068727,
          0.14117526,
          0.10252422,
          0.015865205,
          -0.07865031,
          -0.13277182,
          -0.1166029,
          -0.03388676,
          -0.036831163,
          -0.026533257,
          -0.018194675,
          -0.010560982,
          -0.0028331815,
          0.0022180683,
          -0.0019772067,
          -0.021134041,
          -0.052501857,
          -0.08017716,
          -0.07953872,
          -0.03175918,
          0.059084974,
          0.15905969,
          0.21656081,
          0.19017255,
          0.07591077,
          -0.08493602,
          -0.22461806,
          -0.28374505,
          -0.24071723,
          -0.09960104,
          -0.13662514,
          -0.17695788,
          -0.20670025,
          -0.21428144,
          -0.19875912,
          -0.17221038,
          -0.1524915,
          -0.14931652,
          -0.15301256,
          -0.13613775,
          -0.07092053,
          0.046410203,
          0.18150127,
          0.27172267,
          0.25872287,
          0.12529206,
          -0.08784783,
          -0.29834783,
          -0.42306268,
          -0.41869995,
          -0.07310082,
          -0.13049375,
          -0.19817482,
          -0.25472224,
          -0.28055462,
          -0.27005097,
          -0.23629586,
          -0.20319404,
          -0.18809138,
          -0.18617642,
          -0.16940747,
          -0.10460254,
          0.018492905,
          0.16839245,
          0.2789397,
          0.28292623,
          0.15356912,
          -0.073098086,
          -0.3113625,
          -0.46800295,
          -0.48802075,
          0.028320115,
          -0.015340193,
          -0.079293266,
          -0.14188847,
          -0.18061377,
          -0.18573865,
          -0.16711248,
          -0.14777972,
          -0.14671732,
          -0.16182032,
          -0.16652668,
          -0.12591758,
          -0.024334038,
          0.114119455,
          0.22931601,
          0.2553345,
          0.16041219,
          -0.029209504,
          -0.2385259,
          -0.38160864,
          -0.40482482,
          0.13789049,
          0.13021123,
          0.0943024,
          0.046090614,
          0.005884997,
          -0.01443286,
          -0.019435339,
          -0.026645413,
          -0.05228833,
          -0.09549792,
          -0.13321254,
          -0.1321887,
          -0.07255916,
          0.03270809,
          0.13792562,
          0.18776244,
          0.1502838,
          0.03844178,
          -0.094911665,
          -0.1858291,
          -0.19345596,
          0.1824394,
          0.21133426,
          0.2105142,
          0.18785328,
          0.15824458,
          0.13325907,
          0.112986825,
          0.08647626,
          0.04160004,
          -0.02198568,
          -0.08666136,
          -0.12381873,
          -0.11124299,
          -0.049598508,
          0.034367494,
          0.10191002,
          0.12529737,
          0.10437586,
          0.065444745,
          0.04360329,
          0.060975563,
          0.12865075,
          0.17676035,
          0.20126322,
          0.20332536,
          0.19182886,
          0.17607997,
          0.1585177,
          0.13290386,
          0.08999736,
          0.027238693,
          -0.044644736,
          -0.10387224,
          -0.12843579,
          -0.108684406,
          -0.05287473,
          0.018386943,
          0.084812194,
          0.13711835,
          0.1786101,
          0.217783,
          0.25860393
        ],
        "name": "gpr_MatMulcst"
      },
      {
        "dims": [
          "1"
        ],
        "data_type": 1,
        "float_data": [
          0.22262731
        ],
        "name": "gpr_Mulcst"
      },
      {
        "dims": [
          "1"
        ],
        "data_type": 1,
        "float_data": [
          -1.1438996
        ],
        "name": "gpr_Addcst"
      },
      {
        "dims": [
          "2"
        ],
        "data_type": 7,
        "int64_data": [
          "-1",
          "1"
        ],
        "name": "Re_Reshapecst"
      }
    ],
    "input": [
      {
        "name": "input",
        "type": {
          "tensor_type": {
            "elem_type": 1,
            "shape": {
              "dim": [
                {
                  "dim_value": "33345"
                },
                {
                  "dim_value": "2"
                }
              ]
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "GPmean",
        "type": {
          "tensor_type": {
            "elem_type": 1,
            "shape": {
              "dim": [
                {
                  "dim_value": "33345"
                },
                {
                  "dim_value": "1"
                }
              ]
            }
          }
        }
      }
    ],
    "value_info": [
      {
        "name": "Di_C0",
        "type": {
          "tensor_type": {
            "elem_type": 1,
            "shape": {
              "dim": [
                {
                  "dim_value": "33345"
                },
                {
                  "dim_value": "2"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Di_C02",
        "type": {
          "tensor_type": {
            "elem_type": 1,
            "shape": {
              "dim": [
                {
                  "dim_value": "378"
                },
                {
                  "dim_value": "2"
                }
              ]
            }
          }
        }
      },
      {
        "name": "UU000UU",
        "type": {
          "tensor_type": {
            "elem_type": 1,
            "shape": {
              "dim": [
                {
                  "dim_value": "33345"
                },
                {
                  "dim_value": "2"
                }
              ]
            }
          }
        }
      },
      {
        "name": "UU001UU",
        "type": {
          "tensor_type": {
            "elem_type": 1,
            "shape": {
              "dim": [
                {
                  "dim_value": "378"
                },
                {
                  "dim_value": "33345"
                }
              ]
            }
          }
        }
      }
    ]
  },
  "opset_import": [
    {
      "domain": "",
      "version": "12"
    }
  ]
}