{"irVersion":9,"opsetImport":[{"version":19}],"graph":{"name":"Graph","initializer":[{"name":"init_carry","dataType":1,"dims":[6],"floatData":[0,0,0,0,0,0]},{"name":"init_carry_1","dataType":1,"dims":[6],"floatData":[0,0,0,0,0,0]}],"node":[{"opType":"Constant","input":[],"output":["trip_count_0"],"attribute":[{"name":"value","type":4,"t":{"name":"trip_count_0","dataType":7,"dims":[],"int64Data":[6]}}]},{"opType":"Constant","input":[],"output":["cond_0"],"attribute":[{"name":"value","type":4,"t":{"name":"cond_0","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["reshape_shape_0"],"attribute":[{"name":"value","type":4,"t":{"name":"reshape_shape_0","dataType":7,"dims":[5],"int64Data":[1,3,2,1,1]}}]},{"opType":"Constant","input":[],"output":["trip_count_1"],"attribute":[{"name":"value","type":4,"t":{"name":"trip_count_1","dataType":7,"dims":[],"int64Data":[6]}}]},{"opType":"Constant","input":[],"output":["cond_1"],"attribute":[{"name":"value","type":4,"t":{"name":"cond_1","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Constant","input":[],"output":["reshape_shape_1"],"attribute":[{"name":"value","type":4,"t":{"name":"reshape_shape_1","dataType":7,"dims":[5],"int64Data":[1,3,2,1,1]}}]},{"opType":"Loop","input":["trip_count_0","cond_0","init_carry"],"output":["loop_out"],"attribute":[{"name":"body","type":5,"g":{"name":"loop_body_0","initializer":[],"node":[{"opType":"Constant","input":[],"output":["axes"],"attribute":[{"name":"value","type":4,"t":{"name":"axes","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["mr_dim_tp_0_4"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_tp_0_4","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["mr_dim_tp_0_3"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_tp_0_3","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["mr_dim_tp_0_2"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_tp_0_2","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["mr_dim_tp_0_1"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_tp_0_1","dataType":7,"dims":[],"int64Data":[3]}}]},{"opType":"Constant","input":[],"output":["mr_dim_tp_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_tp_0_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["tp_zero_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"tp_zero_0_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["tp_zero_0_2"],"attribute":[{"name":"value","type":4,"t":{"name":"tp_zero_0_2","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["tp_zero_0_4"],"attribute":[{"name":"value","type":4,"t":{"name":"tp_zero_0_4","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_zero_tp_lin_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_tp_lin_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_tp_lin_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_tp_lin_0_0","dataType":7,"dims":[],"int64Data":[6]}}]},{"opType":"Constant","input":[],"output":["lin_stride_tp_lin_0_1"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_tp_lin_0_1","dataType":7,"dims":[],"int64Data":[3]}}]},{"opType":"Constant","input":[],"output":["lin_stride_tp_lin_0_2"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_tp_lin_0_2","dataType":7,"dims":[],"int64Data":[3]}}]},{"opType":"Constant","input":[],"output":["lin_stride_tp_lin_0_3"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_tp_lin_0_3","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["lin_stride_tp_lin_0_4"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_tp_lin_0_4","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["flat_shape_X"],"attribute":[{"name":"value","type":4,"t":{"name":"flat_shape_X","dataType":7,"dims":[1],"int64Data":[-1]}}]},{"opType":"Constant","input":[],"output":["tp_scalar_0_shape"],"attribute":[{"name":"value","type":4,"t":{"name":"tp_scalar_0_shape","dataType":7,"dims":[0],"int64Data":[]}}]},{"opType":"Unsqueeze","input":["iter","axes"],"output":["unsq_out"],"attribute":[]},{"opType":"Mod","input":["iter","mr_dim_tp_0_4"],"output":["mr_mod_out_tp_0_4"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_tp_0_4"],"output":["mr_div_out_tp_0_4"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_tp_0_4","mr_dim_tp_0_3"],"output":["mr_mod_out_tp_0_3"],"attribute":[]},{"opType":"Div","input":["mr_div_out_tp_0_4","mr_dim_tp_0_3"],"output":["mr_div_out_tp_0_3"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_tp_0_3","mr_dim_tp_0_2"],"output":["mr_mod_out_tp_0_2"],"attribute":[]},{"opType":"Div","input":["mr_div_out_tp_0_3","mr_dim_tp_0_2"],"output":["mr_div_out_tp_0_2"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_tp_0_2","mr_dim_tp_0_1"],"output":["mr_mod_out_tp_0_1"],"attribute":[]},{"opType":"Div","input":["mr_div_out_tp_0_2","mr_dim_tp_0_1"],"output":["mr_div_out_tp_0_1"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_tp_0_1","mr_dim_tp_0_0"],"output":["mr_mod_out_tp_0_0"],"attribute":[]},{"opType":"Div","input":["mr_div_out_tp_0_1","mr_dim_tp_0_0"],"output":["mr_div_out_tp_0_0"],"attribute":[]},{"opType":"Mul","input":["tp_zero_0_0","lin_stride_tp_lin_0_0"],"output":["lin_mul_out_tp_lin_0_0"],"attribute":[]},{"opType":"Add","input":["lin_zero_tp_lin_0","lin_mul_out_tp_lin_0_0"],"output":["lin_add_out_tp_lin_0_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_tp_0_2","lin_stride_tp_lin_0_1"],"output":["lin_mul_out_tp_lin_0_1"],"attribute":[]},{"opType":"Add","input":["lin_add_out_tp_lin_0_0","lin_mul_out_tp_lin_0_1"],"output":["lin_add_out_tp_lin_0_1"],"attribute":[]},{"opType":"Mul","input":["tp_zero_0_2","lin_stride_tp_lin_0_2"],"output":["lin_mul_out_tp_lin_0_2"],"attribute":[]},{"opType":"Add","input":["lin_add_out_tp_lin_0_1","lin_mul_out_tp_lin_0_2"],"output":["lin_add_out_tp_lin_0_2"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_tp_0_1","lin_stride_tp_lin_0_3"],"output":["lin_mul_out_tp_lin_0_3"],"attribute":[]},{"opType":"Add","input":["lin_add_out_tp_lin_0_2","lin_mul_out_tp_lin_0_3"],"output":["lin_add_out_tp_lin_0_3"],"attribute":[]},{"opType":"Mul","input":["tp_zero_0_4","lin_stride_tp_lin_0_4"],"output":["lin_mul_out_tp_lin_0_4"],"attribute":[]},{"opType":"Add","input":["lin_add_out_tp_lin_0_3","lin_mul_out_tp_lin_0_4"],"output":["lin_add_out_tp_lin_0_4"],"attribute":[]},{"opType":"Unsqueeze","input":["lin_add_out_tp_lin_0_4","axes"],"output":["tp_linU_0_out"],"attribute":[]},{"opType":"Reshape","input":["X","flat_shape_X"],"output":["X_flat"],"attribute":[]},{"opType":"Gather","input":["X_flat","tp_linU_0_out"],"output":["tp_g_0_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Reshape","input":["tp_g_0_out","tp_scalar_0_shape"],"output":["tp_scalar_0_out"],"attribute":[]},{"opType":"Unsqueeze","input":["tp_scalar_0_out","axes"],"output":["updateUnsq_out"],"attribute":[]},{"opType":"Identity","input":["cond_in"],"output":["cond_out"],"attribute":[]},{"opType":"ScatterElements","input":["carry","unsq_out","updateUnsq_out"],"output":["carry_out"],"attribute":[{"name":"axis","i":0,"type":2}]}],"input":[{"name":"iter","type":{"tensorType":{"elemType":7,"shape":{"dim":[]}}}},{"name":"cond_in","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":6}]}}}}],"output":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":6}]}}}}],"valueInfo":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":6}]}}}},{"name":"X","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}}]}}]},{"opType":"Reshape","input":["loop_out","reshape_shape_0"],"output":["XT"],"attribute":[]},{"opType":"Loop","input":["trip_count_1","cond_1","init_carry_1"],"output":["loop_out_1"],"attribute":[{"name":"body","type":5,"g":{"name":"loop_body_0","initializer":[],"node":[{"opType":"Constant","input":[],"output":["axes"],"attribute":[{"name":"value","type":4,"t":{"name":"axes","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_XT_1_4"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_XT_1_4","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_XT_1_3"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_XT_1_3","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_XT_1_2"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_XT_1_2","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_XT_1_1"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_XT_1_1","dataType":7,"dims":[],"int64Data":[3]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_XT_1_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_XT_1_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["gb_zero_XT_1_0"],"attribute":[{"name":"value","type":4,"t":{"name":"gb_zero_XT_1_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["gb_zero_XT_1_3"],"attribute":[{"name":"value","type":4,"t":{"name":"gb_zero_XT_1_3","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["gb_zero_XT_1_4"],"attribute":[{"name":"value","type":4,"t":{"name":"gb_zero_XT_1_4","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_zero_gb_lin_XT_1"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_gb_lin_XT_1","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_XT_1_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_XT_1_0","dataType":7,"dims":[],"int64Data":[6]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_XT_1_1"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_XT_1_1","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_XT_1_2"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_XT_1_2","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_XT_1_3"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_XT_1_3","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_XT_1_4"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_XT_1_4","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["flat_shape_XT"],"attribute":[{"name":"value","type":4,"t":{"name":"flat_shape_XT","dataType":7,"dims":[1],"int64Data":[-1]}}]},{"opType":"Constant","input":[],"output":["sg_len_idx_gb_lin_XT_1"],"attribute":[{"name":"value","type":4,"t":{"name":"sg_len_idx_gb_lin_XT_1","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_C_1_4"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_C_1_4","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_C_1_3"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_C_1_3","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_C_1_2"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_C_1_2","dataType":7,"dims":[],"int64Data":[2]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_C_1_1"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_C_1_1","dataType":7,"dims":[],"int64Data":[3]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_C_1_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_C_1_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["gb_zero_C_1_0"],"attribute":[{"name":"value","type":4,"t":{"name":"gb_zero_C_1_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["gb_zero_C_1_2"],"attribute":[{"name":"value","type":4,"t":{"name":"gb_zero_C_1_2","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["gb_zero_C_1_3"],"attribute":[{"name":"value","type":4,"t":{"name":"gb_zero_C_1_3","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["gb_zero_C_1_4"],"attribute":[{"name":"value","type":4,"t":{"name":"gb_zero_C_1_4","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_zero_gb_lin_C_1"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_gb_lin_C_1","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_C_1_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_C_1_0","dataType":7,"dims":[],"int64Data":[3]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_C_1_1"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_C_1_1","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_C_1_2"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_C_1_2","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_C_1_3"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_C_1_3","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_C_1_4"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_C_1_4","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["flat_shape_C"],"attribute":[{"name":"value","type":4,"t":{"name":"flat_shape_C","dataType":7,"dims":[1],"int64Data":[-1]}}]},{"opType":"Constant","input":[],"output":["sg_len_idx_gb_lin_C_1"],"attribute":[{"name":"value","type":4,"t":{"name":"sg_len_idx_gb_lin_C_1","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Unsqueeze","input":["iter","axes"],"output":["unsq_out"],"attribute":[]},{"opType":"Mod","input":["iter","mr_dim_gb_out_XT_1_4"],"output":["mr_mod_out_gb_out_XT_1_4"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_gb_out_XT_1_4"],"output":["mr_div_out_gb_out_XT_1_4"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_XT_1_4","mr_dim_gb_out_XT_1_3"],"output":["mr_mod_out_gb_out_XT_1_3"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_XT_1_4","mr_dim_gb_out_XT_1_3"],"output":["mr_div_out_gb_out_XT_1_3"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_XT_1_3","mr_dim_gb_out_XT_1_2"],"output":["mr_mod_out_gb_out_XT_1_2"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_XT_1_3","mr_dim_gb_out_XT_1_2"],"output":["mr_div_out_gb_out_XT_1_2"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_XT_1_2","mr_dim_gb_out_XT_1_1"],"output":["mr_mod_out_gb_out_XT_1_1"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_XT_1_2","mr_dim_gb_out_XT_1_1"],"output":["mr_div_out_gb_out_XT_1_1"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_XT_1_1","mr_dim_gb_out_XT_1_0"],"output":["mr_mod_out_gb_out_XT_1_0"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_XT_1_1","mr_dim_gb_out_XT_1_0"],"output":["mr_div_out_gb_out_XT_1_0"],"attribute":[]},{"opType":"Mul","input":["gb_zero_XT_1_0","lin_stride_gb_lin_XT_1_0"],"output":["lin_mul_out_gb_lin_XT_1_0"],"attribute":[]},{"opType":"Add","input":["lin_zero_gb_lin_XT_1","lin_mul_out_gb_lin_XT_1_0"],"output":["lin_add_out_gb_lin_XT_1_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_XT_1_1","lin_stride_gb_lin_XT_1_1"],"output":["lin_mul_out_gb_lin_XT_1_1"],"attribute":[]},{"opType":"Add","input":["lin_add_out_gb_lin_XT_1_0","lin_mul_out_gb_lin_XT_1_1"],"output":["lin_add_out_gb_lin_XT_1_1"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_XT_1_2","lin_stride_gb_lin_XT_1_2"],"output":["lin_mul_out_gb_lin_XT_1_2"],"attribute":[]},{"opType":"Add","input":["lin_add_out_gb_lin_XT_1_1","lin_mul_out_gb_lin_XT_1_2"],"output":["lin_add_out_gb_lin_XT_1_2"],"attribute":[]},{"opType":"Mul","input":["gb_zero_XT_1_3","lin_stride_gb_lin_XT_1_3"],"output":["lin_mul_out_gb_lin_XT_1_3"],"attribute":[]},{"opType":"Add","input":["lin_add_out_gb_lin_XT_1_2","lin_mul_out_gb_lin_XT_1_3"],"output":["lin_add_out_gb_lin_XT_1_3"],"attribute":[]},{"opType":"Mul","input":["gb_zero_XT_1_4","lin_stride_gb_lin_XT_1_4"],"output":["lin_mul_out_gb_lin_XT_1_4"],"attribute":[]},{"opType":"Add","input":["lin_add_out_gb_lin_XT_1_3","lin_mul_out_gb_lin_XT_1_4"],"output":["lin_add_out_gb_lin_XT_1_4"],"attribute":[]},{"opType":"Reshape","input":["XT","flat_shape_XT"],"output":["XT_flat"],"attribute":[]},{"opType":"Shape","input":["XT_flat"],"output":["sg_shape_out_gb_lin_XT_1"],"attribute":[]},{"opType":"Gather","input":["sg_shape_out_gb_lin_XT_1","sg_len_idx_gb_lin_XT_1"],"output":["sg_len_gb_lin_XT_1_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["lin_add_out_gb_lin_XT_1_4","sg_len_gb_lin_XT_1_out"],"output":["Mod_sg_mod_gb_lin_XT_1_out"],"attribute":[]},{"opType":"Unsqueeze","input":["Mod_sg_mod_gb_lin_XT_1_out","axes"],"output":["sg_idx_unsq_gb_lin_XT_1_out"],"attribute":[]},{"opType":"Gather","input":["XT_flat","sg_idx_unsq_gb_lin_XT_1_out"],"output":["sg_g_gb_lin_XT_1_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["iter","mr_dim_gb_out_C_1_4"],"output":["mr_mod_out_gb_out_C_1_4"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_gb_out_C_1_4"],"output":["mr_div_out_gb_out_C_1_4"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_C_1_4","mr_dim_gb_out_C_1_3"],"output":["mr_mod_out_gb_out_C_1_3"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_C_1_4","mr_dim_gb_out_C_1_3"],"output":["mr_div_out_gb_out_C_1_3"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_C_1_3","mr_dim_gb_out_C_1_2"],"output":["mr_mod_out_gb_out_C_1_2"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_C_1_3","mr_dim_gb_out_C_1_2"],"output":["mr_div_out_gb_out_C_1_2"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_C_1_2","mr_dim_gb_out_C_1_1"],"output":["mr_mod_out_gb_out_C_1_1"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_C_1_2","mr_dim_gb_out_C_1_1"],"output":["mr_div_out_gb_out_C_1_1"],"attribute":[]},{"opType":"Mod","input":["mr_div_out_gb_out_C_1_1","mr_dim_gb_out_C_1_0"],"output":["mr_mod_out_gb_out_C_1_0"],"attribute":[]},{"opType":"Div","input":["mr_div_out_gb_out_C_1_1","mr_dim_gb_out_C_1_0"],"output":["mr_div_out_gb_out_C_1_0"],"attribute":[]},{"opType":"Mul","input":["gb_zero_C_1_0","lin_stride_gb_lin_C_1_0"],"output":["lin_mul_out_gb_lin_C_1_0"],"attribute":[]},{"opType":"Add","input":["lin_zero_gb_lin_C_1","lin_mul_out_gb_lin_C_1_0"],"output":["lin_add_out_gb_lin_C_1_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_C_1_1","lin_stride_gb_lin_C_1_1"],"output":["lin_mul_out_gb_lin_C_1_1"],"attribute":[]},{"opType":"Add","input":["lin_add_out_gb_lin_C_1_0","lin_mul_out_gb_lin_C_1_1"],"output":["lin_add_out_gb_lin_C_1_1"],"attribute":[]},{"opType":"Mul","input":["gb_zero_C_1_2","lin_stride_gb_lin_C_1_2"],"output":["lin_mul_out_gb_lin_C_1_2"],"attribute":[]},{"opType":"Add","input":["lin_add_out_gb_lin_C_1_1","lin_mul_out_gb_lin_C_1_2"],"output":["lin_add_out_gb_lin_C_1_2"],"attribute":[]},{"opType":"Mul","input":["gb_zero_C_1_3","lin_stride_gb_lin_C_1_3"],"output":["lin_mul_out_gb_lin_C_1_3"],"attribute":[]},{"opType":"Add","input":["lin_add_out_gb_lin_C_1_2","lin_mul_out_gb_lin_C_1_3"],"output":["lin_add_out_gb_lin_C_1_3"],"attribute":[]},{"opType":"Mul","input":["gb_zero_C_1_4","lin_stride_gb_lin_C_1_4"],"output":["lin_mul_out_gb_lin_C_1_4"],"attribute":[]},{"opType":"Add","input":["lin_add_out_gb_lin_C_1_3","lin_mul_out_gb_lin_C_1_4"],"output":["lin_add_out_gb_lin_C_1_4"],"attribute":[]},{"opType":"Reshape","input":["C","flat_shape_C"],"output":["C_flat"],"attribute":[]},{"opType":"Shape","input":["C_flat"],"output":["sg_shape_out_gb_lin_C_1"],"attribute":[]},{"opType":"Gather","input":["sg_shape_out_gb_lin_C_1","sg_len_idx_gb_lin_C_1"],"output":["sg_len_gb_lin_C_1_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["lin_add_out_gb_lin_C_1_4","sg_len_gb_lin_C_1_out"],"output":["Mod_sg_mod_gb_lin_C_1_out"],"attribute":[]},{"opType":"Unsqueeze","input":["Mod_sg_mod_gb_lin_C_1_out","axes"],"output":["sg_idx_unsq_gb_lin_C_1_out"],"attribute":[]},{"opType":"Gather","input":["C_flat","sg_idx_unsq_gb_lin_C_1_out"],"output":["sg_g_gb_lin_C_1_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Squeeze","input":["sg_g_gb_lin_XT_1_out","axes"],"output":["sq_1_in0_scalar_out"],"attribute":[]},{"opType":"Squeeze","input":["sg_g_gb_lin_C_1_out","axes"],"output":["sq_1_in1_scalar_out"],"attribute":[]},{"opType":"Add","input":["sq_1_in0_scalar_out","sq_1_in1_scalar_out"],"output":["1_out"],"attribute":[]},{"opType":"Unsqueeze","input":["1_out","axes"],"output":["updateUnsq_out"],"attribute":[]},{"opType":"Identity","input":["cond_in"],"output":["cond_out"],"attribute":[]},{"opType":"ScatterElements","input":["carry","unsq_out","updateUnsq_out"],"output":["carry_out"],"attribute":[{"name":"axis","i":0,"type":2}]}],"input":[{"name":"iter","type":{"tensorType":{"elemType":7,"shape":{"dim":[]}}}},{"name":"cond_in","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":6}]}}}}],"output":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":6}]}}}}],"valueInfo":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":6}]}}}},{"name":"XT","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}},{"name":"C","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}}]}}]},{"opType":"Reshape","input":["loop_out_1","reshape_shape_1"],"output":["Out"],"attribute":[]}],"input":[{"name":"X","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":1},{"dimValue":2},{"dimValue":1},{"dimValue":3},{"dimValue":1}]}}}},{"name":"C","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":1},{"dimValue":3},{"dimValue":1},{"dimValue":1},{"dimValue":1}]}}}}],"output":[{"name":"Out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":1},{"dimValue":3},{"dimValue":2},{"dimValue":1},{"dimValue":1}]}}}}]}}