{
  "irVersion": 9,
  "opsetImport": [
    {
      "version": 17
    }
  ],
  "graph": {
    "name": "Graph",
    "initializer": [
      {
        "name": "init_carry",
        "dataType": 1,
        "dims": [
          6
        ],
        "floatData": [
          0,
          0,
          0,
          0,
          0,
          0
        ]
      }
    ],
    "node": [
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "trip_count_0"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "trip_count_0",
              "dataType": 7,
              "dims": [],
              "int64Data": [
                6
              ]
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "cond_0"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "cond_0",
              "dataType": 9,
              "dims": [],
              "int32Data": [
                1
              ]
            }
          }
        ]
      },
      {
        "opType": "Loop",
        "input": [
          "trip_count_0",
          "cond_0",
          "init_carry"
        ],
        "output": [
          "O"
        ],
        "attribute": [
          {
            "name": "body",
            "type": 5,
            "g": {
              "name": "loop_body_0",
              "initializer": [],
              "node": [
                {
                  "opType": "Constant",
                  "input": [],
                  "output": [
                    "axes"
                  ],
                  "attribute": [
                    {
                      "name": "value",
                      "type": 4,
                      "t": {
                        "name": "axes",
                        "dataType": 7,
                        "dims": [
                          1
                        ],
                        "int64Data": [
                          0
                        ]
                      }
                    }
                  ]
                },
                {
                  "opType": "Unsqueeze",
                  "input": [
                    "iter",
                    "axes"
                  ],
                  "output": [
                    "unsq_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Gather",
                  "input": [
                    "X",
                    "unsq_out"
                  ],
                  "output": [
                    "gather_X_0_out"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Gather",
                  "input": [
                    "A",
                    "unsq_out"
                  ],
                  "output": [
                    "gather_A_0_out"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Squeeze",
                  "input": [
                    "gather_X_0_out",
                    "axes"
                  ],
                  "output": [
                    "sq_0_in0_scalar_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Squeeze",
                  "input": [
                    "gather_A_0_out",
                    "axes"
                  ],
                  "output": [
                    "sq_0_in1_scalar_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Add",
                  "input": [
                    "sq_0_in0_scalar_out",
                    "sq_0_in1_scalar_out"
                  ],
                  "output": [
                    "0_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Gather",
                  "input": [
                    "B",
                    "unsq_out"
                  ],
                  "output": [
                    "gather_B_1_out"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Squeeze",
                  "input": [
                    "gather_B_1_out",
                    "axes"
                  ],
                  "output": [
                    "sq_1_in1_scalar_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Mul",
                  "input": [
                    "0_out",
                    "sq_1_in1_scalar_out"
                  ],
                  "output": [
                    "1_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Relu",
                  "input": [
                    "1_out"
                  ],
                  "output": [
                    "2_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Sigmoid",
                  "input": [
                    "2_out"
                  ],
                  "output": [
                    "3_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Gather",
                  "input": [
                    "Y",
                    "unsq_out"
                  ],
                  "output": [
                    "gather_Y_4_out"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Squeeze",
                  "input": [
                    "gather_Y_4_out",
                    "axes"
                  ],
                  "output": [
                    "sq_4_in1_scalar_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Sub",
                  "input": [
                    "3_out",
                    "sq_4_in1_scalar_out"
                  ],
                  "output": [
                    "4_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Exp",
                  "input": [
                    "4_out"
                  ],
                  "output": [
                    "5_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Gather",
                  "input": [
                    "S",
                    "unsq_out"
                  ],
                  "output": [
                    "gather_S_6_out"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Squeeze",
                  "input": [
                    "gather_S_6_out",
                    "axes"
                  ],
                  "output": [
                    "sq_6_in1_scalar_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Div",
                  "input": [
                    "5_out",
                    "sq_6_in1_scalar_out"
                  ],
                  "output": [
                    "6_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Tanh",
                  "input": [
                    "6_out"
                  ],
                  "output": [
                    "7_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Unsqueeze",
                  "input": [
                    "7_out",
                    "axes"
                  ],
                  "output": [
                    "updateUnsq_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "ScatterElements",
                  "input": [
                    "carry",
                    "unsq_out",
                    "updateUnsq_out"
                  ],
                  "output": [
                    "carry_out"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Identity",
                  "input": [
                    "cond_in"
                  ],
                  "output": [
                    "cond_out"
                  ],
                  "attribute": []
                }
              ],
              "input": [
                {
                  "name": "iter",
                  "type": {
                    "tensorType": {
                      "elemType": 7,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "cond_in",
                  "type": {
                    "tensorType": {
                      "elemType": 9,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "carry",
                  "type": {
                    "tensorType": {
                      "elemType": 1,
                      "shape": {
                        "dim": [
                          {
                            "dimValue": 6
                          }
                        ]
                      }
                    }
                  }
                }
              ],
              "output": [
                {
                  "name": "cond_out",
                  "type": {
                    "tensorType": {
                      "elemType": 9,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "carry_out",
                  "type": {
                    "tensorType": {
                      "elemType": 1,
                      "shape": {
                        "dim": [
                          {
                            "dimValue": 6
                          }
                        ]
                      }
                    }
                  }
                }
              ],
              "valueInfo": [
                {
                  "name": "cond_out",
                  "type": {
                    "tensorType": {
                      "elemType": 9,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "carry_out",
                  "type": {
                    "tensorType": {
                      "elemType": 1,
                      "shape": {
                        "dim": [
                          {
                            "dimValue": 6
                          }
                        ]
                      }
                    }
                  }
                }
              ]
            }
          }
        ]
      }
    ],
    "input": [
      {
        "name": "X",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": 6
                }
              ]
            }
          }
        }
      },
      {
        "name": "A",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": 6
                }
              ]
            }
          }
        }
      },
      {
        "name": "B",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": 6
                }
              ]
            }
          }
        }
      },
      {
        "name": "Y",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": 6
                }
              ]
            }
          }
        }
      },
      {
        "name": "S",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": 6
                }
              ]
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "O",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": 6
                }
              ]
            }
          }
        }
      }
    ]
  }
}