{
  "irVersion": 9,
  "opsetImport": [
    {
      "version": 17
    }
  ],
  "graph": {
    "name": "Graph",
    "initializer": [
      {
        "name": "init_carry",
        "dataType": 1,
        "dims": [
          4
        ],
        "floatData": [
          0,
          0,
          0,
          0
        ]
      }
    ],
    "node": [
      {
        "opType": "Loop",
        "input": [
          "trip_count",
          "cond",
          "init_carry"
        ],
        "output": [
          "C"
        ],
        "attribute": [
          {
            "name": "body",
            "type": 5,
            "g": {
              "name": "loop_body",
              "initializer": [],
              "node": [
                {
                  "opType": "Constant",
                  "input": [],
                  "output": [
                    "axes"
                  ],
                  "attribute": [
                    {
                      "name": "value",
                      "type": 4,
                      "t": {
                        "name": "axes",
                        "dataType": 7,
                        "dims": [
                          1
                        ],
                        "int64Data": [
                          0
                        ]
                      }
                    }
                  ]
                },
                {
                  "opType": "Unsqueeze",
                  "input": [
                    "iter_idx",
                    "axes"
                  ],
                  "output": [
                    "idx_unsq_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Gather",
                  "input": [
                    "A",
                    "idx_unsq_out"
                  ],
                  "output": [
                    "g_A_out"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Gather",
                  "input": [
                    "B",
                    "idx_unsq_out"
                  ],
                  "output": [
                    "g_B_out"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Add",
                  "input": [
                    "g_A_out",
                    "g_B_out"
                  ],
                  "output": [
                    "Add_0_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "ScatterElements",
                  "input": [
                    "carry",
                    "idx_unsq_out",
                    "Add_0_out"
                  ],
                  "output": [
                    "carry_out"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Identity",
                  "input": [
                    "cond_in"
                  ],
                  "output": [
                    "cond_out"
                  ],
                  "attribute": []
                }
              ],
              "input": [
                {
                  "name": "iter_idx",
                  "type": {
                    "tensorType": {
                      "elemType": 7,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "cond_in",
                  "type": {
                    "tensorType": {
                      "elemType": 9,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "carry",
                  "type": {
                    "tensorType": {
                      "elemType": 1,
                      "shape": {
                        "dim": [
                          {
                            "dimValue": 4
                          }
                        ]
                      }
                    }
                  }
                }
              ],
              "output": [
                {
                  "name": "cond_out",
                  "type": {
                    "tensorType": {
                      "elemType": 9,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "carry_out",
                  "type": {
                    "tensorType": {
                      "elemType": 1,
                      "shape": {
                        "dim": [
                          {
                            "dimValue": 4
                          }
                        ]
                      }
                    }
                  }
                }
              ],
              "valueInfo": [
                {
                  "name": "cond_out",
                  "type": {
                    "tensorType": {
                      "elemType": 9,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "carry_out",
                  "type": {
                    "tensorType": {
                      "elemType": 1,
                      "shape": {
                        "dim": [
                          {
                            "dimValue": 4
                          }
                        ]
                      }
                    }
                  }
                }
              ]
            }
          }
        ]
      }
    ],
    "input": [
      {
        "name": "A",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": 4
                }
              ]
            }
          }
        }
      },
      {
        "name": "B",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": 4
                }
              ]
            }
          }
        }
      },
      {
        "name": "trip_count",
        "type": {
          "tensorType": {
            "elemType": 7,
            "shape": {
              "dim": []
            }
          }
        }
      },
      {
        "name": "cond",
        "type": {
          "tensorType": {
            "elemType": 9,
            "shape": {
              "dim": []
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "C",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": 4
                }
              ]
            }
          }
        }
      }
    ]
  }
}