{"irVersion":9,"opsetImport":[{"version":19}],"graph":{"name":"Graph","initializer":[{"name":"init_carry","dataType":1,"dims":[4],"floatData":[0,0,0,0]}],"node":[{"opType":"Constant","input":[],"output":["trip_count_0"],"attribute":[{"name":"value","type":4,"t":{"name":"trip_count_0","dataType":7,"dims":[],"int64Data":[4]}}]},{"opType":"Constant","input":[],"output":["cond_0"],"attribute":[{"name":"value","type":4,"t":{"name":"cond_0","dataType":9,"dims":[],"int32Data":[1]}}]},{"opType":"Loop","input":["trip_count_0","cond_0","init_carry"],"output":["C"],"attribute":[{"name":"body","type":5,"g":{"name":"loop_body_0","initializer":[],"node":[{"opType":"Constant","input":[],"output":["axes"],"attribute":[{"name":"value","type":4,"t":{"name":"axes","dataType":7,"dims":[1],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_A_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_A_0_0","dataType":7,"dims":[],"int64Data":[4]}}]},{"opType":"Constant","input":[],"output":["lin_zero_gb_lin_A_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_gb_lin_A_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_A_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_A_0_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["sg_len_idx_gb_lin_A_0"],"attribute":[{"name":"value","type":4,"t":{"name":"sg_len_idx_gb_lin_A_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["mr_dim_gb_out_B_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"mr_dim_gb_out_B_0_0","dataType":7,"dims":[],"int64Data":[4]}}]},{"opType":"Constant","input":[],"output":["lin_zero_gb_lin_B_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_zero_gb_lin_B_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Constant","input":[],"output":["lin_stride_gb_lin_B_0_0"],"attribute":[{"name":"value","type":4,"t":{"name":"lin_stride_gb_lin_B_0_0","dataType":7,"dims":[],"int64Data":[1]}}]},{"opType":"Constant","input":[],"output":["sg_len_idx_gb_lin_B_0"],"attribute":[{"name":"value","type":4,"t":{"name":"sg_len_idx_gb_lin_B_0","dataType":7,"dims":[],"int64Data":[0]}}]},{"opType":"Unsqueeze","input":["iter","axes"],"output":["unsq_out"],"attribute":[]},{"opType":"Mod","input":["iter","mr_dim_gb_out_A_0_0"],"output":["mr_mod_out_gb_out_A_0_0"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_gb_out_A_0_0"],"output":["mr_div_out_gb_out_A_0_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_A_0_0","lin_stride_gb_lin_A_0_0"],"output":["lin_mul_out_gb_lin_A_0_0"],"attribute":[]},{"opType":"Add","input":["lin_zero_gb_lin_A_0","lin_mul_out_gb_lin_A_0_0"],"output":["lin_add_out_gb_lin_A_0_0"],"attribute":[]},{"opType":"Shape","input":["A"],"output":["sg_shape_out_gb_lin_A_0"],"attribute":[]},{"opType":"Gather","input":["sg_shape_out_gb_lin_A_0","sg_len_idx_gb_lin_A_0"],"output":["sg_len_gb_lin_A_0_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["lin_add_out_gb_lin_A_0_0","sg_len_gb_lin_A_0_out"],"output":["Mod_sg_mod_gb_lin_A_0_out"],"attribute":[]},{"opType":"Unsqueeze","input":["Mod_sg_mod_gb_lin_A_0_out","axes"],"output":["sg_idx_unsq_gb_lin_A_0_out"],"attribute":[]},{"opType":"Gather","input":["A","sg_idx_unsq_gb_lin_A_0_out"],"output":["sg_g_gb_lin_A_0_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["iter","mr_dim_gb_out_B_0_0"],"output":["mr_mod_out_gb_out_B_0_0"],"attribute":[]},{"opType":"Div","input":["iter","mr_dim_gb_out_B_0_0"],"output":["mr_div_out_gb_out_B_0_0"],"attribute":[]},{"opType":"Mul","input":["mr_mod_out_gb_out_B_0_0","lin_stride_gb_lin_B_0_0"],"output":["lin_mul_out_gb_lin_B_0_0"],"attribute":[]},{"opType":"Add","input":["lin_zero_gb_lin_B_0","lin_mul_out_gb_lin_B_0_0"],"output":["lin_add_out_gb_lin_B_0_0"],"attribute":[]},{"opType":"Shape","input":["B"],"output":["sg_shape_out_gb_lin_B_0"],"attribute":[]},{"opType":"Gather","input":["sg_shape_out_gb_lin_B_0","sg_len_idx_gb_lin_B_0"],"output":["sg_len_gb_lin_B_0_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Mod","input":["lin_add_out_gb_lin_B_0_0","sg_len_gb_lin_B_0_out"],"output":["Mod_sg_mod_gb_lin_B_0_out"],"attribute":[]},{"opType":"Unsqueeze","input":["Mod_sg_mod_gb_lin_B_0_out","axes"],"output":["sg_idx_unsq_gb_lin_B_0_out"],"attribute":[]},{"opType":"Gather","input":["B","sg_idx_unsq_gb_lin_B_0_out"],"output":["sg_g_gb_lin_B_0_out"],"attribute":[{"name":"axis","i":0,"type":2}]},{"opType":"Squeeze","input":["sg_g_gb_lin_A_0_out","axes"],"output":["sq_0_in0_scalar_out"],"attribute":[]},{"opType":"Squeeze","input":["sg_g_gb_lin_B_0_out","axes"],"output":["sq_0_in1_scalar_out"],"attribute":[]},{"opType":"Add","input":["sq_0_in0_scalar_out","sq_0_in1_scalar_out"],"output":["0_out"],"attribute":[]},{"opType":"Unsqueeze","input":["0_out","axes"],"output":["updateUnsq_out"],"attribute":[]},{"opType":"Identity","input":["cond_in"],"output":["cond_out"],"attribute":[]},{"opType":"ScatterElements","input":["carry","unsq_out","updateUnsq_out"],"output":["carry_out"],"attribute":[{"name":"axis","i":0,"type":2}]}],"input":[{"name":"iter","type":{"tensorType":{"elemType":7,"shape":{"dim":[]}}}},{"name":"cond_in","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":4}]}}}}],"output":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":4}]}}}}],"valueInfo":[{"name":"cond_out","type":{"tensorType":{"elemType":9,"shape":{"dim":[]}}}},{"name":"carry_out","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":4}]}}}},{"name":"A","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}},{"name":"B","type":{"tensor_type":{"elem_type":1,"shape":{"dim":[]}}}}]}}]}],"input":[{"name":"A","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":4}]}}}},{"name":"B","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":4}]}}}}],"output":[{"name":"C","type":{"tensorType":{"elemType":1,"shape":{"dim":[{"dimValue":4}]}}}}]}}