{
  "irVersion": 9,
  "opsetImport": [
    {
      "version": 17
    }
  ],
  "graph": {
    "name": "Graph",
    "initializer": [
      {
        "name": "init_carry",
        "dataType": 1,
        "dims": [
          4
        ],
        "floatData": [
          0,
          0,
          0,
          0
        ],
        "int32Data": [],
        "stringData": [],
        "int64Data": [],
        "doubleData": [],
        "uint64Data": [],
        "externalData": []
      }
    ],
    "node": [
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "trip_count_0"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "trip_count_0",
              "dataType": 7,
              "dims": [],
              "floatData": [],
              "int32Data": [],
              "stringData": [],
              "int64Data": [
                4
              ],
              "doubleData": [],
              "uint64Data": [],
              "externalData": []
            }
          }
        ]
      },
      {
        "opType": "Constant",
        "input": [],
        "output": [
          "cond_0"
        ],
        "attribute": [
          {
            "name": "value",
            "type": 4,
            "t": {
              "name": "cond_0",
              "dataType": 9,
              "dims": [],
              "floatData": [],
              "int32Data": [
                1
              ],
              "stringData": [],
              "int64Data": [],
              "doubleData": [],
              "uint64Data": [],
              "externalData": []
            }
          }
        ]
      },
      {
        "opType": "Loop",
        "input": [
          "trip_count_0",
          "cond_0",
          "init_carry"
        ],
        "output": [
          "C"
        ],
        "attribute": [
          {
            "name": "body",
            "type": 5,
            "g": {
              "name": "loop_body_0",
              "initializer": [],
              "node": [
                {
                  "opType": "Constant",
                  "input": [],
                  "output": [
                    "axes"
                  ],
                  "attribute": [
                    {
                      "name": "value",
                      "type": 4,
                      "t": {
                        "name": "axes",
                        "dataType": 7,
                        "dims": [
                          1
                        ],
                        "floatData": [],
                        "int32Data": [],
                        "stringData": [],
                        "int64Data": [
                          0
                        ],
                        "doubleData": [],
                        "uint64Data": [],
                        "externalData": []
                      }
                    }
                  ]
                },
                {
                  "opType": "Unsqueeze",
                  "input": [
                    "iter",
                    "axes"
                  ],
                  "output": [
                    "unsq_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Gather",
                  "input": [
                    "A",
                    "unsq_out"
                  ],
                  "output": [
                    "gather_A_0_out"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Gather",
                  "input": [
                    "B",
                    "unsq_out"
                  ],
                  "output": [
                    "gather_B_0_out"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Squeeze",
                  "input": [
                    "gather_A_0_out",
                    "axes"
                  ],
                  "output": [
                    "sq_0_in0_scalar_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Squeeze",
                  "input": [
                    "gather_B_0_out",
                    "axes"
                  ],
                  "output": [
                    "sq_0_in1_scalar_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Add",
                  "input": [
                    "sq_0_in0_scalar_out",
                    "sq_0_in1_scalar_out"
                  ],
                  "output": [
                    "0_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "Unsqueeze",
                  "input": [
                    "0_out",
                    "axes"
                  ],
                  "output": [
                    "updateUnsq_out"
                  ],
                  "attribute": []
                },
                {
                  "opType": "ScatterElements",
                  "input": [
                    "carry",
                    "unsq_out",
                    "updateUnsq_out"
                  ],
                  "output": [
                    "carry_out"
                  ],
                  "attribute": [
                    {
                      "name": "axis",
                      "i": 0,
                      "type": 2
                    }
                  ]
                },
                {
                  "opType": "Identity",
                  "input": [
                    "cond_in"
                  ],
                  "output": [
                    "cond_out"
                  ],
                  "attribute": []
                }
              ],
              "input": [
                {
                  "name": "iter",
                  "type": {
                    "tensorType": {
                      "elemType": 7,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "cond_in",
                  "type": {
                    "tensorType": {
                      "elemType": 9,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "carry",
                  "type": {
                    "tensorType": {
                      "elemType": 1,
                      "shape": {
                        "dim": [
                          {
                            "dimValue": 4
                          }
                        ]
                      }
                    }
                  }
                }
              ],
              "output": [
                {
                  "name": "cond_out",
                  "type": {
                    "tensorType": {
                      "elemType": 9,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "carry_out",
                  "type": {
                    "tensorType": {
                      "elemType": 1,
                      "shape": {
                        "dim": [
                          {
                            "dimValue": 4
                          }
                        ]
                      }
                    }
                  }
                }
              ],
              "valueInfo": [
                {
                  "name": "cond_out",
                  "type": {
                    "tensorType": {
                      "elemType": 9,
                      "shape": {
                        "dim": []
                      }
                    }
                  }
                },
                {
                  "name": "carry_out",
                  "type": {
                    "tensorType": {
                      "elemType": 1,
                      "shape": {
                        "dim": [
                          {
                            "dimValue": 4
                          }
                        ]
                      }
                    }
                  }
                }
              ]
            }
          }
        ]
      }
    ],
    "input": [
      {
        "name": "A",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": 4
                }
              ]
            }
          }
        }
      },
      {
        "name": "B",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": 4
                }
              ]
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "C",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": 4
                }
              ]
            }
          }
        }
      }
    ]
  }
}