{
    "irVersion": "8",
    "graph": {
      "node": [
        {
          "input": [
            "B",
            "C"
          ],
          "output": [
            "BC"
          ],
          "opType": "Add"
        },
        {
          "input": [
            "A",
            "BC"
          ],
          "output": [
            "ABC"
          ],
          "opType": "MatMul"
        },
        {
          "input": [
            "ABC",
            "D"
          ],
          "output": [
            "ABCD"
          ],
          "opType": "Add"
        }
      ],
      "name": "lr",
      "input": [
        {
          "name": "B",
          "type": {
            "tensorType": {
              "elemType": 6,
              "shape": {
                "dim": [
                  {
                    "dimValue": "1"
                  },
                  {
                    "dimValue": "1"
                  }
                ]
              }
            }
          }
        },
        {
          "name": "C",
          "type": {
            "tensorType": {
              "elemType": 6,
              "shape": {
                "dim": [
                  {
                    "dimValue": "1"
                  },
                  {
                    "dimValue": "1"
                  }
                ]
              }
            }
          }
        },
        {
          "name": "A",
          "type": {
            "tensorType": {
              "elemType": 6,
              "shape": {
                "dim": [
                  {
                    "dimValue": "3"
                  },
                  {
                    "dimValue": "1"
                  }
                ]
              }
            }
          }
        },
        {
            "name": "D",
            "type": {
              "tensorType": {
                "elemType": 6,
                "shape": {
                  "dim": [
                    {
                      "dimValue": "1"
                    },
                    {
                      "dimValue": "3"
                    }
                  ]
                }
              }
            }
          }
      ],
      "output": [
        {
          "name": "ABCD",
          "type": {
            "tensorType": {
              "elemType": 6,
              "shape": {
                "dim": [
                  {
                    "dimValue": "1"
                  },
                  {
                    "dimValue": "3"
                  }
                ]
              }
            }
          }
        }
      ]
    },
    "opsetImport": [
      {
        "version": "18"
      }
    ]
  }